[
    {
        "title": "How do you think AI/machine learning will affect construction in the future?",
        "selftext": "I'm asking because I have been hearing a lot of software programs and hardware that are being created to improve on construction and it's going in many different directions. Of course, I like hearing from others and I wanna know what you guys have to say/think. Thanks!",
        "url": "https://www.reddit.com/r/Construction/comments/kk80ze/how_do_you_think_aimachine_learning_will_affect/",
        "score": 6,
        "num_comments": 7,
        "created_utc": 1608938341.0,
        "created_dt": "2020-12-25 18:19:01",
        "author": "Beautiful-Assistant9",
        "subreddit": "Construction",
        "comments": [
            {
                "comment_body": "Garbage in garbage out. An AI that is only fed garbage information won’t be nearly as useful as an experienced superintendent that can look at a fresh set of plans and notice right away what issues they may run into. AND prepare for them. I’m a PM and can think of many things that can be automated in my job. But unless an AI can resolve problems on the spot and back them up financially I don’t see how my job can be done by a machine completely. Even our GPS heavy equipment still needs an operator to properly handle throttle response. \nI don’t know though. May be too soon to tell.",
                "comment_author": "Cpl-V",
                "comment_score": 3,
                "comment_created_utc": 1608952270.0,
                "comment_created_dt": "2020-12-25 22:11:10"
            },
            {
                "comment_body": "I've been in construction for about 25 years, and it seems like automation of most construction operations has been \"about 10 years away\" ever since I started.  \nHaving said that, a lot of things are done/built/assembled offsite now that used to be done onsite, and GPS, lasers and other gizmos have made some things both easier and more accurate. Equipment has gotten more powerful and more specialized. Safety gear is cheaper, less hassle, and works better.\n\nSo I've seen a lot of improvements, but I still think the day when it's more cost-effective to build things with robots instead of people is a long way off.",
                "comment_author": "Ken_Thomas",
                "comment_score": 3,
                "comment_created_utc": 1608952501.0,
                "comment_created_dt": "2020-12-25 22:15:01"
            },
            {
                "comment_body": "Machine learning is hands-down one of the craziest things I have ever looked into. I think the obvious things that will be most likely to be done by a robot brain in the reasonably near future is stuff that is already done by machines and just needs to be fitted with tech where the human operator can be nixed. Stuff like grading, dirt removal, etc. I still don’t see it being used for stuff like excavating for footings or other “custom” type digs that require coordination with humans from other companies on site any time soon.\n\nI think we are still a while away from seeing human-like robots running around the jobs pulling wire, building formwork, pouring concrete, connecting pipes, landing steel columns, welding joints etc. This would require hardware (robotic ppl) that doesn’t already exist in mass quantities like bulldozers, track hoes, and dump trucks and I have to imagine making a robot with all the functionalities and versatility of a human body would be extremely cost-prohibitive. I have seen some stuff where machines have been invented to hang Sheetrock, frame walls, and lay brick but these machines aren’t human-like robots and would need to be transported from floor to floor in a building as they are not mobile like a person is and even with not being very mobile, I am sure they are still extremely expensive. Even if there was a huge demand for robots I believe they’d still be extremely expensive, but I don’t think there would be a massive demand because most smaller contractors won’t have the funds to buy enough robotic workers to replace their workforce. Without massive demand there is no mass production, without mass production, the goods would not be cheap. \n\nThis may be a little doomsdayish of me, but I think machine learning will decimate the trades, but not in the way most ppl think it will. I don’t think it will crush trade jobs by doing all the trade jobs instead of humans, I think machine learning is going to absolutely decimate white-collar office jobs. Not all, but enough that it will have a large, negative economic impact. The technology is fascinating/terrifying and is way more advanced than ppl want to believe right now. U don’t need any new hardware to replace an office worker, only software. Large impact on office workers will have a massive effect on real estate development in major cities which would then ripple to needing less infrastructure, and would ultimately lead to the higher paying, large commercial real estate construction market being much smaller.",
                "comment_author": "ikover15",
                "comment_score": 2,
                "comment_created_utc": 1608955689.0,
                "comment_created_dt": "2020-12-25 23:08:09"
            },
            {
                "comment_body": "I feel like it will mostly be used to create advanced instructions and precise drawings",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1608992090.0,
                "comment_created_dt": "2020-12-26 09:14:50"
            },
            {
                "comment_body": "So I watched the new hilti tool video a few weeks ago. It was a frickin robot.  Like an eod bot but heavier with arm for holding tools.   No price listed so likely very expensive but I",
                "comment_author": "wonderoustuff",
                "comment_score": 1,
                "comment_created_utc": 1608957020.0,
                "comment_created_dt": "2020-12-25 23:30:20"
            },
            {
                "comment_body": "Do you all think the drywall robots will do meth and only work a half day?",
                "comment_author": "stinkymaster-",
                "comment_score": 1,
                "comment_created_utc": 1609021561.0,
                "comment_created_dt": "2020-12-26 17:26:01"
            },
            {
                "comment_body": "AI and machine learning are poised to revolutionize the construction industry in the coming years, offering numerous benefits and improvements. Here's an overview of how AI and machine learning are likely to affect construction in the future, with a focus on the benefits of [Vision AI](https://visionify.ai/):\r  \n\r  \n1. Improved Safety:\r  \n   Vision AI can be employed for real-time safety monitoring on construction sites. AI-powered cameras and sensors can detect potential hazards, such as unauthorized personnel in restricted areas, equipment malfunctions, or unsafe working conditions. This helps in preventing accidents and ensuring the safety of workers.\r  \n\r  \n2. Enhanced Project Management:\r  \n   AI algorithms can analyze historical construction data and current project progress to predict delays, budget overruns, and resource allocation issues. This allows project managers to make more informed decisions and optimize project schedules and budgets.\r  \n\r  \n3. Quality Control:\r  \n   Vision AI can perform quality inspections using cameras and computer vision algorithms. It can identify defects in construction materials or structures that might be missed by the human eye. This ensures higher quality standards and reduces the need for costly rework.\r  \n\r  \n4. Autonomous Equipment:\r  \n   AI-powered autonomous machinery and vehicles can streamline various construction tasks. Drones equipped with AI can perform aerial surveys, monitor progress, and capture high-resolution images for site analysis, reducing manual labor and increasing efficiency.\r  \n\r  \n5. Design Optimization:\r  \n   Machine learning can analyze past construction designs and outcomes to suggest more efficient and cost-effective designs. This can result in better-performing structures and cost savings.\r  \n\r  \n6. Predictive Maintenance:\r  \n   Vision AI can be used to monitor the condition of construction equipment and machinery in real-time. It can predict when maintenance is needed, reducing unexpected breakdowns and increasing the lifespan of equipment.\r  \n\r  \n7. Environmental Impact:\r  \n   AI can help optimize construction processes to minimize environmental impact. By analyzing data on material usage, energy consumption, and waste generation, construction companies can make eco-friendly choices and reduce their carbon footprint.\r  \n\r  \n\r  \nIn conclusion, AI and machine learning are set to play a pivotal role in the construction industry's future. Vision AI, in particular, will bring about improvements in safety, efficiency, cost-effectiveness, and sustainability, ultimately reshaping the way construction projects are planned, executed, and managed.",
                "comment_author": "Visionifyai",
                "comment_score": 1,
                "comment_created_utc": 1705585860.0,
                "comment_created_dt": "2024-01-18 08:51:00"
            }
        ]
    },
    {
        "title": "Survey on impact of AI in Lean Construction ",
        "selftext": "Hello everyone,\n\nAs part of my academic term paper, I am conducting a study on \"Artificial Intelligence and Lean Construction: Identifying Gaps and Opportunities for Improved Practices.\"\n\nTo enrich this study with real-world insights, I have developed a brief 10-minute survey aimed at understanding how AI is currently integrated with lean construction methodologies and exploring areas for potential improvement. Your expertise would be invaluable to this study.\n\nIf you're a professional in construction, engineering, or related fields, I would greatly appreciate your participation in this survey. You can access the questionnaire via link provided: \n\n🗓 Requesting you to Complete it before- 31st October 2024\n\nAll responses will remain confidential and used solely for academic purposes. Your insights will significantly contribute to advancing industry practices, and I thank you in advance for your time and support!\n\nBest regards!\n",
        "url": "https://forms.gle/TNcUkRfqK1iZhPhs5",
        "score": 0,
        "num_comments": 1,
        "created_utc": 1729454122.0,
        "created_dt": "2024-10-20 15:55:22",
        "author": "Brilliant-Ad-2371",
        "subreddit": "ConstructionManagers",
        "comments": [
            {
                "comment_body": "AI will have no significant place in the construction industry in the near future.",
                "comment_author": "TrinketSmasher",
                "comment_score": 2,
                "comment_created_utc": 1729530125.0,
                "comment_created_dt": "2024-10-21 13:02:05"
            }
        ]
    },
    {
        "title": "Artificial Intelligence in Construction Project Management",
        "selftext": "Guys what are your thoughts on impact of Artificial Intelligence (AI) in construction project management.\n\nI am a project manager with a commercial construction GC and while I have seen the industry evolve with technology, I still don’t see how all of the trades and workers can be fully replaced with AI in future. I think AI can definitely improve the processes. I have seen robots doing layout for interior walls, robots laying brick veneer, robots acting as helpers to the main skilled worker and so on…but I think construction industry still have a huge “people” component that is here to stay for a successful execution of a project.\n\nThoughts?",
        "url": "https://www.reddit.com/r/Construction/comments/12g19jm/artificial_intelligence_in_construction_project/",
        "score": 10,
        "num_comments": 26,
        "created_utc": 1680994731.0,
        "created_dt": "2023-04-08 18:58:51",
        "author": "Comeallreadit",
        "subreddit": "Construction",
        "comments": [
            {
                "comment_body": "I got tasked with developing some survey specific training and safety, i legit used ChapGPT for all of it and everyone was astounded by the quality.\n\nI can see stuff like that being replaced, same with bidding. you could program an AI to look at the bidding sites, pick out jobs to bid based on your criteria, build the bid and send it off.. in prob 3 mins.\n\nit's an interesting time",
                "comment_author": "UnsuspectingChief",
                "comment_score": 7,
                "comment_created_utc": 1680995118.0,
                "comment_created_dt": "2023-04-08 19:05:18"
            },
            {
                "comment_body": "I've given it some trial runs - how can a construction schedule be shortened, what are types of construction contracts, etc.  It did a reasonable job of creating a first draft.",
                "comment_author": "Builderwill",
                "comment_score": 4,
                "comment_created_utc": 1680997140.0,
                "comment_created_dt": "2023-04-08 19:39:00"
            },
            {
                "comment_body": "Robots will never replace plumbers",
                "comment_author": "PipeApprentice",
                "comment_score": 3,
                "comment_created_utc": 1681008565.0,
                "comment_created_dt": "2023-04-08 22:49:25"
            },
            {
                "comment_body": "AI isn’t about laborers job, it’s about yours. Chatgpt won’t take your job, but someone who uses it will…..",
                "comment_author": "GeologistLow4736",
                "comment_score": 2,
                "comment_created_utc": 1681043217.0,
                "comment_created_dt": "2023-04-09 08:26:57"
            },
            {
                "comment_body": "Absolutely, you're spot on! The construction industry indeed has a unique blend of craftsmanship and human collaboration that's integral to project success. While AI has made impressive strides in automating certain tasks and optimizing processes, the \"people\" factor remains irreplaceable. In a recent project, I had the chance to use the [construction optioneering](https://www.alicetechnologies.com/construction-optioneering) from Alice Technologies, and it was a game-changer. The AI-powered platform helped me analyze different construction scenarios, fine-tune schedules, and allocate resources efficiently, allowing us to deliver a complex project seamlessly while still harnessing the expertise and teamwork that make the industry thrive. So, while AI streamlines processes, the human touch remains the heart of construction.",
                "comment_author": "strawberry_yakult222",
                "comment_score": 2,
                "comment_created_utc": 1693235870.0,
                "comment_created_dt": "2023-08-28 11:17:50"
            },
            {
                "comment_body": "I am hearing people are using VR Headsets to sell projects and remodels. Changing colors and sizes in real time with everyone signed in from different places. Great organization tool for project management and selling jobs. Hopefully inspections can be done this way soon.",
                "comment_author": "insideout5790",
                "comment_score": 1,
                "comment_created_utc": 1681051051.0,
                "comment_created_dt": "2023-04-09 10:37:31"
            },
            {
                "comment_body": "AI can help project managers to optimize project schedules, manage resources effectively, and predict project outcomes. With the help of AI, construction firms can reduce project delays and save time and money. However, the implementation of AI in construction project management requires significant investment in technology and skilled professionals. Despite the challenges, the benefits of AI in construction project management are undeniable, and it is likely to become an integral part of the industry in the future.",
                "comment_author": "SWMWDesign",
                "comment_score": 1,
                "comment_created_utc": 1684419286.0,
                "comment_created_dt": "2023-05-18 10:14:46"
            },
            {
                "comment_body": "Utilizing AI in construction project management can greatly help to improve processes in order to accomplish construction projects with minimal delays. Connecteam is a software solution that can also be used for such requirements which we have been using in our firm. Some of its features are for communication, workflow/task management, scheduling, progress monitoring, time tracking, etc.",
                "comment_author": "Miller10Margaret",
                "comment_score": 1,
                "comment_created_utc": 1696916891.0,
                "comment_created_dt": "2023-10-10 01:48:11"
            },
            {
                "comment_body": "I completely agree with you, and I believe the impact of Artificial Intelligence (AI) in construction project management is both exciting and complex. While AI and automation have certainly improved various aspects of construction, such as precision and efficiency in tasks like layout and bricklaying, the human element in construction remains irreplaceable.\r  \n\r  \nAI can streamline project management by optimizing schedules, predicting potential issues, and managing resources more effectively. It can also enhance safety by monitoring worksites and identifying potential hazards. However, it's important to remember that the construction industry is highly dynamic, and the expertise, creativity, and adaptability of skilled workers are invaluable.\r  \n\r  \nThe future likely involves a hybrid approach, where AI augments human capabilities. Skilled workers will continue to play a critical role in decision-making, problem-solving, and adapting to unforeseen challenges. As you mentioned, the \"people\" component is here to stay, and it's this synergy between AI and human expertise that holds great potential for the successful execution of construction projects. Embracing AI as a tool rather than a replacement can lead to more efficient, safer, and cost-effective projects while preserving the industry's human touch.",
                "comment_author": "mattsharon",
                "comment_score": 1,
                "comment_created_utc": 1697006546.0,
                "comment_created_dt": "2023-10-11 02:42:26"
            },
            {
                "comment_body": "AI in construction isn’t about replacing human skills, but enhancing them for greater efficiency.\n\nFor example, our team is exploring how to accurately assess the competency of skilled laborers using AI. What we’ve found is that it’s possible to identify the strengths and weaknesses of individual workers in their specific trades, regardless of their location or language. Imagine consistently finding the perfect fit for a job, anywhere in the world.\n\nAnother thing we’re experimenting with is safety - we are testing a tool that can process training materials and create tailored questionnaires. Workers then respond in their own words and language, allowing us to pinpoint comprehension gaps. This not only ensures understanding but also helps predict and prevent potential issues before they occur.  \nHas anyone else experimented with similar AI applications in construction? Would love to discuss!",
                "comment_author": "dreamy-fisherman458",
                "comment_score": 1,
                "comment_created_utc": 1700572299.0,
                "comment_created_dt": "2023-11-21 08:11:39"
            },
            {
                "comment_body": "The integration of Artificial Intelligence (AI) in construction project management is a fascinating and evolving topic.",
                "comment_author": "shreejisteelco",
                "comment_score": 1,
                "comment_created_utc": 1703245288.0,
                "comment_created_dt": "2023-12-22 06:41:28"
            },
            {
                "comment_body": "Informative Post.",
                "comment_author": "shreejisteelco",
                "comment_score": 1,
                "comment_created_utc": 1703245916.0,
                "comment_created_dt": "2023-12-22 06:51:56"
            },
            {
                "comment_body": "I can definitely see how it will affect the takeoff and bidding process, but at the same time the takeoff is only as good as the quality of the drawings. A quality estimator knows what’s included in the drawings but more importantly they know what’s NOT included it might be missing.\nEither way, interesting times for sure!",
                "comment_author": "Comeallreadit",
                "comment_score": 1,
                "comment_created_utc": 1681026656.0,
                "comment_created_dt": "2023-04-09 03:50:56"
            },
            {
                "comment_body": "Interesting! The schedule is another thing I can see getting impacted by AI",
                "comment_author": "Comeallreadit",
                "comment_score": 2,
                "comment_created_utc": 1681026771.0,
                "comment_created_dt": "2023-04-09 03:52:51"
            },
            {
                "comment_body": "Theres already a robot that will replace hundreds and even thousands of man hours per job on commercial jobs drilling drop in anchors.",
                "comment_author": "itrytosnowboard",
                "comment_score": 2,
                "comment_created_utc": 1681234727.0,
                "comment_created_dt": "2023-04-11 13:38:47"
            },
            {
                "comment_body": "Yes, I can’t see that happening anytime soon. Huge respect to the plumbers!",
                "comment_author": "Comeallreadit",
                "comment_score": 1,
                "comment_created_utc": 1681026860.0,
                "comment_created_dt": "2023-04-09 03:54:20"
            },
            {
                "comment_body": "Interesting! Thank you for this. Anything to add almost a year later??",
                "comment_author": "Stocks_Dawg",
                "comment_score": 1,
                "comment_created_utc": 1716760709.0,
                "comment_created_dt": "2024-05-26 17:58:29"
            },
            {
                "comment_body": "This is really interesting",
                "comment_author": "JonsAlterEgo",
                "comment_score": 1,
                "comment_created_utc": 1717462826.0,
                "comment_created_dt": "2024-06-03 21:00:26"
            },
            {
                "comment_body": "It is definitely great for the marketing and attract new customers!!",
                "comment_author": "Comeallreadit",
                "comment_score": 1,
                "comment_created_utc": 1681132386.0,
                "comment_created_dt": "2023-04-10 09:13:06"
            },
            {
                "comment_body": "Link?",
                "comment_author": "PipeApprentice",
                "comment_score": 1,
                "comment_created_utc": 1681428908.0,
                "comment_created_dt": "2023-04-13 19:35:08"
            },
            {
                "comment_body": "The Hilti JAIBot. We are supposed to be testing it on a job my company has. \n\n&#x200B;\n\nhttps://www.hilti.com/content/hilti/W1/US/en/business/business/trends/jaibot.html",
                "comment_author": "itrytosnowboard",
                "comment_score": 2,
                "comment_created_utc": 1681466179.0,
                "comment_created_dt": "2023-04-14 05:56:19"
            },
            {
                "comment_body": "I would love to hear about how it went/ if you are using them on current projects?",
                "comment_author": "Stocks_Dawg",
                "comment_score": 1,
                "comment_created_utc": 1716760623.0,
                "comment_created_dt": "2024-05-26 17:57:03"
            },
            {
                "comment_body": "I'm not even mad about this. When I was a plumbers apprentice I was drilling those like a fucking maniac and I would gladly let a robot do it.",
                "comment_author": "Dragonballsackz",
                "comment_score": 1,
                "comment_created_utc": 1722620343.0,
                "comment_created_dt": "2024-08-02 13:39:03"
            }
        ]
    },
    {
        "title": "aI wiLl tAKe yOuR JoB",
        "selftext": "N/A",
        "url": "https://i.redd.it/m5fcb7egwk0c1.jpeg",
        "score": 466,
        "num_comments": 146,
        "created_utc": 1700083302.0,
        "created_dt": "2023-11-15 16:21:42",
        "author": "FriedChicken",
        "subreddit": "Construction",
        "comments": [
            {
                "comment_body": "What worries me obviously isn't physical automation, but AI models (eventually) replacing any need for skill. I'm a commercial electrician (office side now), and I don't doubt that eventually we'll have a language model that can interpret code and walk people through installations. This, in theory, is cool - it makes everyone's lives easier. But, as someone who has benefitted greatly from a technical trade, I do worry that a lot of kids in the future will be left with lower wages once skill is less of a requirement.\n\nAnd for the record, I'm not saying this happens tomorrow, but over the next 10-20 years it almost certainly will.",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 122,
                "comment_created_utc": 1700090012.0,
                "comment_created_dt": "2023-11-15 18:13:32"
            },
            {
                "comment_body": "Not even AI can’t make sense of these plans.",
                "comment_author": "phiz36",
                "comment_score": 36,
                "comment_created_utc": 1700094381.0,
                "comment_created_dt": "2023-11-15 19:26:21"
            },
            {
                "comment_body": "i cant wait for a mf robot to bring in the sheet rock delivery, logistically, during an active construction site with every other trade working in no discernible rhythm, absolutely no order, then see those same mf robots top off the walls whilst standing on temporary sprinkler pipes and getting choked out by wires, cut by ducts and threaded rods for a fire rating. id pay to see that.  well be alright",
                "comment_author": "theREALmindsets",
                "comment_score": 30,
                "comment_created_utc": 1700098208.0,
                "comment_created_dt": "2023-11-15 20:30:08"
            },
            {
                "comment_body": "Help us Boston Dynamics; your our only hope. Seriously the day I can set my tool bag on robo-Fido’s back and have it hand me tools will make me a happy man.",
                "comment_author": "ComeOnTars2424",
                "comment_score": 18,
                "comment_created_utc": 1700092648.0,
                "comment_created_dt": "2023-11-15 18:57:28"
            },
            {
                "comment_body": "Finishing machines that paint and cure doors.\n\nRobot arm for sanding cabinets and furniture in the shop.\n\nRobot for painting outsides of buildings.\n\nDrone for painting outsides of buildings.\n\nRobot for painting inside buildings. \n\nI mean painting industry is gonna turn into 1 man operating an unmanned machine.\n\nAI controlling a few drones to paint a house or a ship not really a crazy leap.",
                "comment_author": "N/A",
                "comment_score": 12,
                "comment_created_utc": 1700098079.0,
                "comment_created_dt": "2023-11-15 20:27:59"
            },
            {
                "comment_body": "AI will replace superintendents, and we will finally be treated as humans.",
                "comment_author": "Stock_Western3199",
                "comment_score": 6,
                "comment_created_utc": 1700107599.0,
                "comment_created_dt": "2023-11-15 23:06:39"
            },
            {
                "comment_body": "I smile every time I see someone come in to fix our welding robot. I weld, take a 15 min break every 2 hours, one 30min lunch, cost 75k a year.\n\nThe robot that feeds me parts to FINISH what it started? Cost 120k just to buy it, requires a lot of maintenance, only runs 60% of the time. The other 40%, humans are doing its job because it is broke or out of calibration.\n\nGet fucked, AI. I ain't scared of you. *dry spits*",
                "comment_author": "N/A",
                "comment_score": 24,
                "comment_created_utc": 1700094293.0,
                "comment_created_dt": "2023-11-15 19:24:53"
            },
            {
                "comment_body": "The threat of paradigm shift in construction where automation and AI take over most of design/production is very far off imo, maybe when I’m an old man we’ll start seeing it outside of a few unicorn projects. But for now I’m chillin.\n\nI could see it being helpful in the context of most tradespeople retiring/dying soon and no one to replace them",
                "comment_author": "Rich_Jaguar7343",
                "comment_score": 3,
                "comment_created_utc": 1700093993.0,
                "comment_created_dt": "2023-11-15 19:19:53"
            },
            {
                "comment_body": "They have robots that tie rebar on bridges. My old company just got one and it put a dozen of workers out on the street. They will find a way. Maybe in a couple lifetimes but they will",
                "comment_author": "N/A",
                "comment_score": 5,
                "comment_created_utc": 1700145657.0,
                "comment_created_dt": "2023-11-16 09:40:57"
            },
            {
                "comment_body": "I really just don't worry about AI",
                "comment_author": "Kennady4president",
                "comment_score": 3,
                "comment_created_utc": 1700097742.0,
                "comment_created_dt": "2023-11-15 20:22:22"
            },
            {
                "comment_body": "Design really doesn’t even cost that much vs labor. And its impossible to employ robots. What happens when crackheads steal their supplies? So yeah, on the good jobs, people will still shell out for custom designs and put up with union scale. They tried to kill the UA with vic and pro press, and it didn’t work.",
                "comment_author": "Tallon_raider",
                "comment_score": 2,
                "comment_created_utc": 1700098972.0,
                "comment_created_dt": "2023-11-15 20:42:52"
            },
            {
                "comment_body": "They train them off of data. So they give it all the data they have but what about all the guys who \"figured it out\" as they went along to MAKE it work. That's the hard part about the job anyway. I don't know how much data they'll give AI to do that",
                "comment_author": "Humble_Peach93",
                "comment_score": 2,
                "comment_created_utc": 1700104430.0,
                "comment_created_dt": "2023-11-15 22:13:50"
            },
            {
                "comment_body": "They are going to replace desk jobs first, lawyers accountants, probably general physicians/MDs. Skilled labor will be some of the last. Auto mechanics will be near the last. Eventually the robots will come fir all of us, I'm going to push my kids to robot maintenance.",
                "comment_author": "craftydan1",
                "comment_score": 2,
                "comment_created_utc": 1700107722.0,
                "comment_created_dt": "2023-11-15 23:08:42"
            },
            {
                "comment_body": "We've already got 3d printed houses being built. Give it another 20 years, the changes will be insane",
                "comment_author": "wanderingfloatilla",
                "comment_score": 8,
                "comment_created_utc": 1700085537.0,
                "comment_created_dt": "2023-11-15 16:58:57"
            },
            {
                "comment_body": "Wait till the Tesla bot comes out",
                "comment_author": "Swainsane",
                "comment_score": 1,
                "comment_created_utc": 1700095227.0,
                "comment_created_dt": "2023-11-15 19:40:27"
            },
            {
                "comment_body": "It’s really sad this is gonna happen way faster than a lot of old heads think it will.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700100593.0,
                "comment_created_dt": "2023-11-15 21:09:53"
            },
            {
                "comment_body": "Machines will never be cheaper then human labors.",
                "comment_author": "LeeWizcraft",
                "comment_score": -6,
                "comment_created_utc": 1700090516.0,
                "comment_created_dt": "2023-11-15 18:21:56"
            },
            {
                "comment_body": "There is every chance working will be optional for our children's children.",
                "comment_author": "TreatNext",
                "comment_score": 1,
                "comment_created_utc": 1700093983.0,
                "comment_created_dt": "2023-11-15 19:19:43"
            },
            {
                "comment_body": "https://apsc.ubc.ca/news/2023/ai-powered-robots-gamechanger-for-faster-safer-construction",
                "comment_author": "OwenMichael312",
                "comment_score": 1,
                "comment_created_utc": 1700094414.0,
                "comment_created_dt": "2023-11-15 19:26:54"
            },
            {
                "comment_body": "Soon™",
                "comment_author": "NebraskaGeek",
                "comment_score": 1,
                "comment_created_utc": 1700106249.0,
                "comment_created_dt": "2023-11-15 22:44:09"
            },
            {
                "comment_body": "AI can take my job and pay my bills too. Now bring me some tacos AI!",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700112512.0,
                "comment_created_dt": "2023-11-16 00:28:32"
            },
            {
                "comment_body": "im all for it",
                "comment_author": "Plenty-Wafer-7886",
                "comment_score": 1,
                "comment_created_utc": 1700137178.0,
                "comment_created_dt": "2023-11-16 07:19:38"
            },
            {
                "comment_body": "they do the heavy lifting thats cool",
                "comment_author": "Plenty-Wafer-7886",
                "comment_score": 1,
                "comment_created_utc": 1700137185.0,
                "comment_created_dt": "2023-11-16 07:19:45"
            },
            {
                "comment_body": "I'm a stone and brick mason by trade. 15 years and counting I'm only 31 if ai can do what I do it can have it lol \n\nJk I hate when other trades try and get our work. But you know what I'm saying. \n\n\n\nThey had some of our locals' members go and use the SAMs when they came out. Semi auto mason... I'll tell ya what it's just like any other job(site). Masons gotta pick up the slack lol. Masons still gotta operate the thing and lay the units. 32 inch long bulky ass units. Hard pass I'd rather pound in 16s all day alone, and not have to be troubleshooting a robot half the size of my scaffolding.",
                "comment_author": "Tightisrite",
                "comment_score": 1,
                "comment_created_utc": 1700137845.0,
                "comment_created_dt": "2023-11-16 07:30:45"
            },
            {
                "comment_body": "Unfortunately I see the robots doing the skilled part and humans will be left to do the physical part. I am 62 years old and in construction and still do a lot of physical labor but would love to see robots used as a tool to replace physical labor.",
                "comment_author": "Secure_Tie3321",
                "comment_score": 1,
                "comment_created_utc": 1700138672.0,
                "comment_created_dt": "2023-11-16 07:44:32"
            },
            {
                "comment_body": "This seems like an odd take. Like I’m sure auto workers never thought a machine could do their job but here we are. Why taunt AI developers like this? Seems like peak boomer energy here.",
                "comment_author": "bigdaddyteacher",
                "comment_score": 1,
                "comment_created_utc": 1700139155.0,
                "comment_created_dt": "2023-11-16 07:52:35"
            },
            {
                "comment_body": "AI is going to remove the repetitive mind numbing tasks and jobs from everyday work. Physical jobs or jobs that require critical thinking/design will not get replaced anytime soon. Though if people are so worried about jobs being taken over maybe you should look into politicians that actually support unions.",
                "comment_author": "Available_Cream2305",
                "comment_score": 1,
                "comment_created_utc": 1700140040.0,
                "comment_created_dt": "2023-11-16 08:07:20"
            },
            {
                "comment_body": "Good.",
                "comment_author": "gazman7801",
                "comment_score": 1,
                "comment_created_utc": 1700150527.0,
                "comment_created_dt": "2023-11-16 11:02:07"
            },
            {
                "comment_body": "They have robots that can perform surgery. I’m sure there is one in development at least that can bend pipe, or screw pipe, or glue pipe or whatever. The challenge is that the design world can’t get 2 dimensions right, that’s why bim is a joke. Until then, the robots will just do what the engineers say. We all know how jacked that is.",
                "comment_author": "Ok_Possession_2060",
                "comment_score": 1,
                "comment_created_utc": 1700151875.0,
                "comment_created_dt": "2023-11-16 11:24:35"
            },
            {
                "comment_body": "Let's see AI float drywall",
                "comment_author": "Chocol8Cheese",
                "comment_score": 1,
                "comment_created_utc": 1700159135.0,
                "comment_created_dt": "2023-11-16 13:25:35"
            },
            {
                "comment_body": "I would say the danger is that AI will replace any need for skill, as well as an insane amount of labor available. The only reason that trades are making the money they are now is due to the insane labor shortage. If that were to change, those wages are tanking extremely quickly.",
                "comment_author": "resdaz",
                "comment_score": 1,
                "comment_created_utc": 1700164678.0,
                "comment_created_dt": "2023-11-16 14:57:58"
            },
            {
                "comment_body": "Everything will be pre-built.  Careful the labor force has already decreased by 75% on jobs.",
                "comment_author": "GreatLawfulness2647",
                "comment_score": 1,
                "comment_created_utc": 1700169421.0,
                "comment_created_dt": "2023-11-16 16:17:01"
            },
            {
                "comment_body": "Mailman is not safe at all. Going the way of the iceman and milk man",
                "comment_author": "GreatLawfulness2647",
                "comment_score": 1,
                "comment_created_utc": 1700169534.0,
                "comment_created_dt": "2023-11-16 16:18:54"
            },
            {
                "comment_body": "This sub is fking hillarious",
                "comment_author": "These_Tumbleweed4885",
                "comment_score": 1,
                "comment_created_utc": 1700181792.0,
                "comment_created_dt": "2023-11-16 19:43:12"
            },
            {
                "comment_body": "Can we program a computer to drink on the job and put piss bottles behind the drywall?",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700183121.0,
                "comment_created_dt": "2023-11-16 20:05:21"
            },
            {
                "comment_body": "This is the goal of AI. To make skilled (expensive) labor redundant. Companies want you poorly paid with no benefits and no other options. You're more profitable when you're desperate.",
                "comment_author": "RVAVandal",
                "comment_score": 33,
                "comment_created_utc": 1700095848.0,
                "comment_created_dt": "2023-11-15 19:50:48"
            },
            {
                "comment_body": "This is the real threat.",
                "comment_author": "AmazingWaterWeenie",
                "comment_score": 30,
                "comment_created_utc": 1700091530.0,
                "comment_created_dt": "2023-11-15 18:38:50"
            },
            {
                "comment_body": "Job I helped on was a 6 story loft apartment complex above the precast garage. Our only bidded work was to level in and grout these “lay flats” so they could drop the whole finished pods on top of them and pay us TnM to fix all the fuck ups…. Skills going away boys",
                "comment_author": "Jerkcarpenter",
                "comment_score": 7,
                "comment_created_utc": 1700098599.0,
                "comment_created_dt": "2023-11-15 20:36:39"
            },
            {
                "comment_body": "Just bc they can interpret code doesn’t mean they can bend pipe or crawl an attic half a day in 115 degree temps. Our job is safe.",
                "comment_author": "Growe731",
                "comment_score": 17,
                "comment_created_utc": 1700095018.0,
                "comment_created_dt": "2023-11-15 19:36:58"
            },
            {
                "comment_body": "Yeah I could see something like that. Imagine a software that takes a scan of the whole house combined with AR technology to show the most optimal layout for the pipe work per the plans. I could see niche uses for that but would it be a replacement I think not.",
                "comment_author": "morchorchorman",
                "comment_score": 3,
                "comment_created_utc": 1700094165.0,
                "comment_created_dt": "2023-11-15 19:22:45"
            },
            {
                "comment_body": "I work as a nurse and while it won't really replace me anytime soon, I could totally see it taking over patient management in terms of making decisions on what meds to give, what labs to draw, diagnosing, etc. basically taking over a doctor's executive function. And if supervised properly, it might be an improvement actually.",
                "comment_author": "Oldass_Millennial",
                "comment_score": 4,
                "comment_created_utc": 1700096685.0,
                "comment_created_dt": "2023-11-15 20:04:45"
            },
            {
                "comment_body": "As far as the service side goes hop over to r/plumbing. Installing sinks is easily done by watching a 1 minute YouTube video. Somehow it's the most commonly incorrect thing on the sub. People are lazy and either don't want to deal with it, think they are smart and don't need to look it up, or don't care. \n\nFor the new construction side I'd say the reason we have such high wages anyways is because no one wants to do construction. We earn more in the trades than many college grads simply because of the shortages. There's also workmanship, which is something AI can't give you.\n\nOur jobs are safe.",
                "comment_author": "N/A",
                "comment_score": 4,
                "comment_created_utc": 1700113378.0,
                "comment_created_dt": "2023-11-16 00:42:58"
            },
            {
                "comment_body": "please fucking do. i honest to god hope this happens. our designers fucking suck. we have been on a job for over a YEAR and still havent got a SINGLE GOOD SET OF DRAWINGS",
                "comment_author": "thatblackbowtie",
                "comment_score": 17,
                "comment_created_utc": 1700092094.0,
                "comment_created_dt": "2023-11-15 18:48:14"
            },
            {
                "comment_body": "It’s not awfully relevant but I read a book (Open Veins of Latin America) which talked about the fall of the Spanish Empire. The author argued that the main reason for its collapse was the loss of their Artisans. The empire was loaded up with debt plus having to import  skilled labor, it began to fail. I do worry about our future, just wanted to share that.",
                "comment_author": "Thisoneismyfavourite",
                "comment_score": 2,
                "comment_created_utc": 1700096234.0,
                "comment_created_dt": "2023-11-15 19:57:14"
            },
            {
                "comment_body": "One word. Unionize. Then lobby your state to implement regulations.",
                "comment_author": "Laker8show23",
                "comment_score": 2,
                "comment_created_utc": 1700108957.0,
                "comment_created_dt": "2023-11-15 23:29:17"
            },
            {
                "comment_body": "Not gonna happen. It still takes skill to know what you're doing, and not conflict with other trades. There's no way Susan, the middle aged mother of 3, is going to be pulling feeders into a panel and wiring up another lighting circuit.",
                "comment_author": "Dire-Dog",
                "comment_score": 2,
                "comment_created_utc": 1700102698.0,
                "comment_created_dt": "2023-11-15 21:44:58"
            },
            {
                "comment_body": "Seriously, stick to something physical that ai can't replace. Well, idk by then they'll have automated robots that can lift 5x as much as humas work faster with no breaks. Either way we're screwed. We will probably end up being a country of homless. While the rich live on Mars with elon musk.",
                "comment_author": "QuantumAlkaloids",
                "comment_score": 1,
                "comment_created_utc": 1700094288.0,
                "comment_created_dt": "2023-11-15 19:24:48"
            },
            {
                "comment_body": "We'll walk into a job site and a projector on our phone or smart glasses will use AR to show exactly where and what is needed from a human, as designed to the upmost efficiency by AI... Maybe give us a lil shock when we're not reaching maximum efficiency or reach for the wrong tool 🤣. Until recently I was kinda bummed to be born when I'll be dead before the really crazy tech stuff takes off. I think I'll be ready to die in 40 years at this rate.",
                "comment_author": "citori421",
                "comment_score": 1,
                "comment_created_utc": 1700107971.0,
                "comment_created_dt": "2023-11-15 23:12:51"
            },
            {
                "comment_body": "It's even scarier as it gets more and more refined first it lowers the skill floor, letting more people in. And as it gets more and more used, the easier it becomes. Then bam, you have robots that can do it.  Or you just get the prefab blocks that is built a d trucked in.\n\nIt'll be to the point that a human-made house is the \"rich\" will have and even then the concept of rich is going to change as well",
                "comment_author": "Chiluzzar",
                "comment_score": 1,
                "comment_created_utc": 1700108991.0,
                "comment_created_dt": "2023-11-15 23:29:51"
            },
            {
                "comment_body": "That’s why kids should be learning math and computer science.  The future has some skilled trade, but mostly skilled service",
                "comment_author": "XV-77",
                "comment_score": 1,
                "comment_created_utc": 1700113580.0,
                "comment_created_dt": "2023-11-16 00:46:20"
            },
            {
                "comment_body": "We already have robots that will layout the whole job and another that will come paint it. We can use these to make us more efficient but this also means needing less manpower.",
                "comment_author": "YouFirst_ThenCharles",
                "comment_score": 1,
                "comment_created_utc": 1700114176.0,
                "comment_created_dt": "2023-11-16 00:56:16"
            },
            {
                "comment_body": "I disagree. Machines at this current state are incapable of thinking. So much of being an electrician is problem solving. That is the one thing AI cannot do and is not even close to being able to do. People over estimate the ability of AI.",
                "comment_author": "Slow_Recording2192",
                "comment_score": 1,
                "comment_created_utc": 1700154455.0,
                "comment_created_dt": "2023-11-16 12:07:35"
            },
            {
                "comment_body": "Don’t worry, the first kids gonna fry him self trying to follow the shitty instructions. After that, you guys will keep your job as long as you’re certified.",
                "comment_author": "Party_Director_1925",
                "comment_score": 1,
                "comment_created_utc": 1700165615.0,
                "comment_created_dt": "2023-11-16 15:13:35"
            },
            {
                "comment_body": "I already feed standard specifications to GPT to get it to pick out the relevant bits for me.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700176580.0,
                "comment_created_dt": "2023-11-16 18:16:20"
            },
            {
                "comment_body": "Can AI cross reference other plans or does the AI in the field have to field verify still lol",
                "comment_author": "sendherhome22",
                "comment_score": 5,
                "comment_created_utc": 1700136105.0,
                "comment_created_dt": "2023-11-16 07:01:45"
            },
            {
                "comment_body": "Silver lining, I'm much more confident in AI drawing up coherent plans than most architects.",
                "comment_author": "Wuhba",
                "comment_score": 6,
                "comment_created_utc": 1700132012.0,
                "comment_created_dt": "2023-11-16 05:53:32"
            },
            {
                "comment_body": "“That machine can’t drive steel like a man does” \n\n           - John Henry before he died trying to compete with a machine.",
                "comment_author": "_Big_Orange_",
                "comment_score": 9,
                "comment_created_utc": 1700141433.0,
                "comment_created_dt": "2023-11-16 08:30:33"
            },
            {
                "comment_body": "Boston dynamics showcased a robot bringing tools and materials up some scaffolding a few years ago. Its gonna be awesome",
                "comment_author": "Krabbypatty_thief",
                "comment_score": 2,
                "comment_created_utc": 1700140808.0,
                "comment_created_dt": "2023-11-16 08:20:08"
            },
            {
                "comment_body": "In a lot of ways, you’re just describing how modular construction and automated robots building it would be better than having all these dumbasses doing dumb shit.",
                "comment_author": "youy23",
                "comment_score": 2,
                "comment_created_utc": 1700152321.0,
                "comment_created_dt": "2023-11-16 11:32:01"
            },
            {
                "comment_body": "They actually showcased one of their robots doing that a few years ago! It looks awesome",
                "comment_author": "Krabbypatty_thief",
                "comment_score": 2,
                "comment_created_utc": 1700140852.0,
                "comment_created_dt": "2023-11-16 08:20:52"
            },
            {
                "comment_body": "So what will the Apprentice do?",
                "comment_author": "True-Trust4876",
                "comment_score": 2,
                "comment_created_utc": 1730370703.0,
                "comment_created_dt": "2024-10-31 06:31:43"
            },
            {
                "comment_body": "A company I know is working on drone painting tech. Would really eliminate a lot of scaffolding and set up once prep work is done.",
                "comment_author": "Stachemaster86",
                "comment_score": 7,
                "comment_created_utc": 1700100744.0,
                "comment_created_dt": "2023-11-15 21:12:24"
            },
            {
                "comment_body": "My union is pushing welding because robots suck so bad at it.",
                "comment_author": "Tallon_raider",
                "comment_score": 7,
                "comment_created_utc": 1700099522.0,
                "comment_created_dt": "2023-11-15 20:52:02"
            },
            {
                "comment_body": "The people who do a little CNC or any kind of fabrication talking about robots replacing trades people always tickles me. You get it with the crypto crowd too. I will grant them it’s a good ruse to part ignorant rich folks of their money by people with only *just* more construction knowledge than them; while no one in the room still has ever pushed a broom on site. *Give us your $ so we go build robots to replace the carpenters* is probably a good selling tactic.\n\nFor some reason or whatever the same group of folks never gives me a straight answer on whether they’ve ever ran a construction job by themselves, at any level, which I find weird. Just “trust me bro *the future*”.\n\nIt’s construction. I’m not convinced unless someone can come along and actually outperform with better bids and products, but you better do it on time to spec because if it’s not then it’s a backcharge. Until I see it, it’s just a school report.",
                "comment_author": "AlphaNoodlz",
                "comment_score": 6,
                "comment_created_utc": 1700097074.0,
                "comment_created_dt": "2023-11-15 20:11:14"
            },
            {
                "comment_body": "Should be either for yourself or your children.  \nIt's only a matter of time. \n\nTick Tock",
                "comment_author": "Sippiku",
                "comment_score": -4,
                "comment_created_utc": 1700095260.0,
                "comment_created_dt": "2023-11-15 19:41:00"
            },
            {
                "comment_body": "And it’s just the beginning, that robot is gonna get better and better ~ cheaper and cheaper",
                "comment_author": "Sourcoffecat",
                "comment_score": 1,
                "comment_created_utc": 1700163238.0,
                "comment_created_dt": "2023-11-16 14:33:58"
            },
            {
                "comment_body": "Ya know, I kind of think that, but I also kind of think a general purpose humanoid robot might just suddenly appear and everyone will say \"oh shit\". Even if it works 50% as fast as a human, everyone is going to be out of work real fast.",
                "comment_author": "Johns-schlong",
                "comment_score": 1,
                "comment_created_utc": 1700103527.0,
                "comment_created_dt": "2023-11-15 21:58:47"
            },
            {
                "comment_body": "Eh I went to school to be a mechanic. It’s the “liberal arts” of the trades. Plus more and more companies are making things with planned obsolescence over repair. But real talk getting into robot maintenance now is definitely what you should push your kids to do. Every time I hear about robots replacing line cooks and chefs all I can think is who the hell is going to fix let alone clean the robots constantly.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700183782.0,
                "comment_created_dt": "2023-11-16 20:16:22"
            },
            {
                "comment_body": "remodeling will be difficult to automate",
                "comment_author": "CarletonIsHere",
                "comment_score": 21,
                "comment_created_utc": 1700087335.0,
                "comment_created_dt": "2023-11-15 17:28:55"
            },
            {
                "comment_body": "I just wanna be the guy who runs the machine ok, I ain’t asking for much lol /s \n\n\nNo one’s taking our jobs dude… we’re secured for the next 100 years",
                "comment_author": "NuckinFutsCanuck",
                "comment_score": 15,
                "comment_created_utc": 1700087236.0,
                "comment_created_dt": "2023-11-15 17:27:16"
            },
            {
                "comment_body": "Yeah and they fucking suck",
                "comment_author": "N/A",
                "comment_score": 19,
                "comment_created_utc": 1700085656.0,
                "comment_created_dt": "2023-11-15 17:00:56"
            },
            {
                "comment_body": "3D printing only is able to really do structural work. Being able to build piping, cable and other amenities will take a lot longer to replace.\n\nThen you end up with those depressing concrete buildings the soviet union had. These concrete buildings where made to be cheap. So it will be a while before 3D printing becomes cheaper then panel homes. Also people don't tend to like those buildings. Concrete walls don't really say home.}  \n\n\nEven then 3D printers are huge. You will need to set up the printer or just have modular homes. Who builds the 3D printer but not construction workers?",
                "comment_author": "Dkykngfetpic",
                "comment_score": 5,
                "comment_created_utc": 1700089237.0,
                "comment_created_dt": "2023-11-15 18:00:37"
            },
            {
                "comment_body": "\nAgreed.\n\nThere's already automated robots painting. \nAI and robotics might not take 100% of the jobs but in 10 and 20 years it'll remove 25% of the workforce needed in this sector.  \n\nIf people really don't think they will be affected by AI/robotics, they are ignorant of the technology available and being produced.",
                "comment_author": "Sippiku",
                "comment_score": 1,
                "comment_created_utc": 1700095064.0,
                "comment_created_dt": "2023-11-15 19:37:44"
            },
            {
                "comment_body": "My convict ancestors were transported for being machine breakers. I think it’s time.",
                "comment_author": "IsmellYowie",
                "comment_score": 1,
                "comment_created_utc": 1700118555.0,
                "comment_created_dt": "2023-11-16 02:09:15"
            },
            {
                "comment_body": "[deleted]",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700109881.0,
                "comment_created_dt": "2023-11-15 23:44:41"
            },
            {
                "comment_body": "lol. If ai takes over the way things are now the revolution will happen then next day",
                "comment_author": "chapterthrive",
                "comment_score": 0,
                "comment_created_utc": 1700103863.0,
                "comment_created_dt": "2023-11-15 22:04:23"
            },
            {
                "comment_body": "Never is a long time.",
                "comment_author": "Lone_Chrono",
                "comment_score": 13,
                "comment_created_utc": 1700092162.0,
                "comment_created_dt": "2023-11-15 18:49:22"
            },
            {
                "comment_body": "This is very far from true. As technology becomes more advanced it will become cheaper and more readily available to everyone. That’s just how economics works.",
                "comment_author": "TheConstructionGeek",
                "comment_score": 3,
                "comment_created_utc": 1700097528.0,
                "comment_created_dt": "2023-11-15 20:18:48"
            },
            {
                "comment_body": "Go tell suncor in ft. Mac that.",
                "comment_author": "bryant_modifyfx",
                "comment_score": 3,
                "comment_created_utc": 1700093379.0,
                "comment_created_dt": "2023-11-15 19:09:39"
            },
            {
                "comment_body": "lmao there’s a concerted effort to try and sell construction people on robots that don’t exist yet\n\nIt’s construction so it’s real simple. Go do it better than it’s currently being done for cheaper, or admit all you have is a fancy school report.\n\nI’ll be waiting.",
                "comment_author": "AlphaNoodlz",
                "comment_score": 2,
                "comment_created_utc": 1700097316.0,
                "comment_created_dt": "2023-11-15 20:15:16"
            },
            {
                "comment_body": "Industrial revolution anyone?",
                "comment_author": "TreatNext",
                "comment_score": 1,
                "comment_created_utc": 1700094182.0,
                "comment_created_dt": "2023-11-15 19:23:02"
            },
            {
                "comment_body": "Only worry is you think the billionaires people in power are gonna help us all out or leave us to the wayside. They already don’t give a fuck about housing / affordability",
                "comment_author": "Sourcoffecat",
                "comment_score": 1,
                "comment_created_utc": 1700163357.0,
                "comment_created_dt": "2023-11-16 14:35:57"
            },
            {
                "comment_body": "It’s already here.  Where I live everyone and their dog has a degree and a ton of student debt.  They are all overqualified and desperate and the wages reflect that.",
                "comment_author": "Drearypanda",
                "comment_score": 6,
                "comment_created_utc": 1700143150.0,
                "comment_created_dt": "2023-11-16 08:59:10"
            },
            {
                "comment_body": "Player Piano.",
                "comment_author": "monkeyamongmen",
                "comment_score": 1,
                "comment_created_utc": 1700141712.0,
                "comment_created_dt": "2023-11-16 08:35:12"
            },
            {
                "comment_body": "Yikes",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1700102711.0,
                "comment_created_dt": "2023-11-15 21:45:11"
            },
            {
                "comment_body": "The labour had been relocated to factories. Likely safer, no rain, no baking sun, no cold. So good and bad.\n\nMaking jobs easier is good for workers. So many older workers' bodies are worn out. No need to do that to the next generation.",
                "comment_author": "AdAdministrative9362",
                "comment_score": -3,
                "comment_created_utc": 1700122826.0,
                "comment_created_dt": "2023-11-16 03:20:26"
            },
            {
                "comment_body": "We don't get paid what we do because we can crawl in an attic. The job itself isn't going anywhere, but the level of skill required could be.",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 21,
                "comment_created_utc": 1700099290.0,
                "comment_created_dt": "2023-11-15 20:48:10"
            },
            {
                "comment_body": "[deleted]",
                "comment_author": "N/A",
                "comment_score": 4,
                "comment_created_utc": 1700113687.0,
                "comment_created_dt": "2023-11-16 00:48:07"
            },
            {
                "comment_body": "They have robots that can go in a defuse bombs……",
                "comment_author": "palealepint",
                "comment_score": 2,
                "comment_created_utc": 1700111506.0,
                "comment_created_dt": "2023-11-16 00:11:46"
            },
            {
                "comment_body": "Respectfully, you may not be seeing the whole picture. Despite people going looking for jobs. Theses Despite people being disciplined, college educated \"desirable\" employees are more likely to replace us.\n\n It's only a matter of time before the white collars say \"ok I can learn this and do this.\" I'm tired of non tangible jobs getting taken by AI. \" \n\nIt will be a race to the bottom of employment opportunities. The new goal is to be the last one to lose job necessity. Everyone can't be a doctor.",
                "comment_author": "Odd_Bodybuilder_6047",
                "comment_score": 1,
                "comment_created_utc": 1715603207.0,
                "comment_created_dt": "2024-05-13 08:26:47"
            },
            {
                "comment_body": "Lol no, that’s empirically false.  Machines can do both of those things far better than humans can.",
                "comment_author": "XV-77",
                "comment_score": 1,
                "comment_created_utc": 1700113631.0,
                "comment_created_dt": "2023-11-16 00:47:11"
            },
            {
                "comment_body": "Could it teach plumbers not to cut joists in half?",
                "comment_author": "Leather-Plankton-867",
                "comment_score": 4,
                "comment_created_utc": 1700129853.0,
                "comment_created_dt": "2023-11-16 05:17:33"
            },
            {
                "comment_body": "Exactly. The engineers are going to have it tough. The electricians will have work.",
                "comment_author": "Laker8show23",
                "comment_score": 3,
                "comment_created_utc": 1700109258.0,
                "comment_created_dt": "2023-11-15 23:34:18"
            },
            {
                "comment_body": "It's not wise to say safe. Safe for now, obviously. But there will come a time when robots can construct 100% of a home. And before that, there will be a time where they can construct 80% of a home. What matters is how much this robot costs to purchase, operate and maintain. If it's less than a human... good bye human.",
                "comment_author": "TheAero1221",
                "comment_score": 1,
                "comment_created_utc": 1713366095.0,
                "comment_created_dt": "2024-04-17 11:01:35"
            },
            {
                "comment_body": "Welcome to construction",
                "comment_author": "WyattfuckinEarp",
                "comment_score": 20,
                "comment_created_utc": 1700094508.0,
                "comment_created_dt": "2023-11-15 19:28:28"
            },
            {
                "comment_body": "[removed]",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700095175.0,
                "comment_created_dt": "2023-11-15 19:39:35"
            },
            {
                "comment_body": "What happens when the robots have unions!?",
                "comment_author": "tob007",
                "comment_score": 1,
                "comment_created_utc": 1700140579.0,
                "comment_created_dt": "2023-11-16 08:16:19"
            },
            {
                "comment_body": "This. We're so far from legitimate AI, the misnomer kills me. We have, at best, shoddy machine learning. It can only do what it's been taught to do and not always at an effective clip.\n\nBesides that, as machine learning grows, the industry surrounding it will, too. Someone still has to repair, maintain, service, program, troubleshoot, manufacture, transport, etc. everything related to it. My pay has outpaced inflation by a strong margin every year I've been in the workforce. Jobs don't really disappear like that; they just transition to something else that's in demand.\n\n*CARS!? ALL THE FARRIERS WILL LOSE THEIR JOBS!*\n\nI'm usually pretty on board with \"them\" wanting us poor and desperate, but they still need us to consume and the only way to do that is to keep us employed. Following that conspiracy theory, the last thing \"they\" would want is for tens of millions of people to suddenly have a chip on their shoulder *AND* a shitload of free time to think about it.",
                "comment_author": "TheDancy",
                "comment_score": 1,
                "comment_created_utc": 1700306379.0,
                "comment_created_dt": "2023-11-18 06:19:39"
            },
            {
                "comment_body": "Like a bucket and pulley but 1000x more expensive?",
                "comment_author": "youy23",
                "comment_score": 5,
                "comment_created_utc": 1700152364.0,
                "comment_created_dt": "2023-11-16 11:32:44"
            },
            {
                "comment_body": "have you ever seen a construction site? and if so, for what reason? like you walked down the sidewalk and saw a building being built and said, “wow a robot could do that” and thats your knowledge on the matter? lol",
                "comment_author": "theREALmindsets",
                "comment_score": 1,
                "comment_created_utc": 1700143525.0,
                "comment_created_dt": "2023-11-16 09:05:25"
            },
            {
                "comment_body": "🤷‍♂️.. this dumbass thinks ill be alright. zero chance a robot is versatile enough to be a tradesman or even move safely through a jobsite, if not for itself, but even just not hurting someone else.",
                "comment_author": "theREALmindsets",
                "comment_score": 1,
                "comment_created_utc": 1700155130.0,
                "comment_created_dt": "2023-11-16 12:18:50"
            },
            {
                "comment_body": "The best they can",
                "comment_author": "ComeOnTars2424",
                "comment_score": 1,
                "comment_created_utc": 1730376126.0,
                "comment_created_dt": "2024-10-31 08:02:06"
            },
            {
                "comment_body": "It's easy to get an 80% result... it's the details that are tough",
                "comment_author": "N/A",
                "comment_score": 10,
                "comment_created_utc": 1700103108.0,
                "comment_created_dt": "2023-11-15 21:51:48"
            },
            {
                "comment_body": "The world is 100% going to nuke itself into oblivion before AI is able to fully surpass us in every facet it needs to do so without us.",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700095432.0,
                "comment_created_dt": "2023-11-15 19:43:52"
            },
            {
                "comment_body": "It's true. The fancy machines get replaced by really fancy automation. The used ones trickle down, making the whole system change the whole market. Every machine causes a chain reaction. I buy used machines make them work for my manufacturing business.",
                "comment_author": "Odd_Bodybuilder_6047",
                "comment_score": 1,
                "comment_created_utc": 1715604263.0,
                "comment_created_dt": "2024-05-13 08:44:23"
            },
            {
                "comment_body": "Not if it costs more. Companies chase profits, not technology.",
                "comment_author": "Relative_Surround_14",
                "comment_score": 1,
                "comment_created_utc": 1700109656.0,
                "comment_created_dt": "2023-11-15 23:40:56"
            },
            {
                "comment_body": "I hate new cars with a super computer behind the touch screen.i have a '69, '01, '04, and a '16. The 1969 has consistently been the most reliable and 2016 the least. There is a lot of gas and diesels on the road that we want to keep on the road. In 20 years from now, a good mechanic can charge whatever they want.",
                "comment_author": "craftydan1",
                "comment_score": 2,
                "comment_created_utc": 1700197798.0,
                "comment_created_dt": "2023-11-17 00:09:58"
            },
            {
                "comment_body": "The 3D printed houses will be so easy to remodel. Change the doors, cabinets, windows, plumbing, electrical, maybe roof. Done. No drywall or siding to fuck with whatsoever, which is a HUGE difference.",
                "comment_author": "jdog1067",
                "comment_score": 0,
                "comment_created_utc": 1700099836.0,
                "comment_created_dt": "2023-11-15 20:57:16"
            },
            {
                "comment_body": "Yeah ain’t no way in hell any mansion or half decent property is being 3-D printed in the next 20 years. Maybe a good entry level housing.",
                "comment_author": "PMinsane",
                "comment_score": 14,
                "comment_created_utc": 1700086455.0,
                "comment_created_dt": "2023-11-15 17:14:15"
            },
            {
                "comment_body": "Everyone acts like 3d printing is eliminating gatekeepers, and therefore saving everyone money.  I find it's the crypto crowd that gets hard talking about architectural 3d printing",
                "comment_author": "dysoncube",
                "comment_score": 3,
                "comment_created_utc": 1700093662.0,
                "comment_created_dt": "2023-11-15 19:14:22"
            },
            {
                "comment_body": "It's not just printing. Sheetmetal is already computer cut and bent. Check out boxable. Circuit boards i.e. wiring are already printed. Plastic is printed. You could print wires and pipes on your Sheetmetal and fold up your home. That's right now.",
                "comment_author": "TreatNext",
                "comment_score": 3,
                "comment_created_utc": 1700094154.0,
                "comment_created_dt": "2023-11-15 19:22:34"
            },
            {
                "comment_body": "Neither of those things save companies astronomical amounts of money.\n\nAnd just to go a little deeper. The technology from 3d tvs has been scaled to wayyyyy crazier technology at this points. We thought 3d tvs were wild, now we have solid holograms and vr.\n\nNobody thought metaverse was going to be huge, that was just famous people pushing it to increase the value of the stuff they bought in it. Like a stock.\n\nWhat happens when we start 3d printing houses in wood or something? The second someone figures out how to make 3d printing houses more affordable than them being built the way we have been for a long time, everyone will switch to that, and it will just get better and more affordable. Or even some sort of material better than wood for homes that we just haven’t come up with yet? There’s a domino effect going on now with technology, it’s only going to get crazier faster.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700110906.0,
                "comment_created_dt": "2023-11-16 00:01:46"
            },
            {
                "comment_body": "You are forgetting about parts and maintenance costs. Equipment manufacturers in my industry are returning to older and simpler tech.",
                "comment_author": "Relative_Surround_14",
                "comment_score": 1,
                "comment_created_utc": 1700109967.0,
                "comment_created_dt": "2023-11-15 23:46:07"
            },
            {
                "comment_body": "yep, that's the real question. once we're not needed will we be around? and by who or what are we not need? who are we?",
                "comment_author": "TreatNext",
                "comment_score": 1,
                "comment_created_utc": 1700165328.0,
                "comment_created_dt": "2023-11-16 15:08:48"
            },
            {
                "comment_body": "Player Piano writes its own great music. How did AI get good at creativity? I thought that was mankind's only true physical contribution.",
                "comment_author": "Odd_Bodybuilder_6047",
                "comment_score": 2,
                "comment_created_utc": 1715602560.0,
                "comment_created_dt": "2024-05-13 08:16:00"
            },
            {
                "comment_body": "Factory production is not the gem you think it is. They have every second of your day quantified and dumbed down to no technical skill whatsoever. It makes you highly replaceable if you don't exceed your quota on a consistent basis.",
                "comment_author": "PretendAd8816",
                "comment_score": 10,
                "comment_created_utc": 1700148180.0,
                "comment_created_dt": "2023-11-16 10:23:00"
            },
            {
                "comment_body": "It’s called Attrition. It’s a natural reduction in workforce due to the nature of the job. \n\nHigh attrition jobs would be labor. Low attrition jobs would be high paying, low work office jobs. \n\nSo, we will always have to have some sort of higher pay for high attrition jobs.",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700135609.0,
                "comment_created_dt": "2023-11-16 06:53:29"
            },
            {
                "comment_body": "Because AI can’t provide you with the tools needed to cut wood or carry sheets of plywood up a ladder for you.\nJust about anyone can operate a paint brush, but that doesn’t mean they wouldn’t rather pay someone else to do it for them.",
                "comment_author": "pheldozer",
                "comment_score": 3,
                "comment_created_utc": 1700135418.0,
                "comment_created_dt": "2023-11-16 06:50:18"
            },
            {
                "comment_body": "AI will help you become more efficient, which will in turn allow you to do more jobs, essentially making companies and employees more money. The skill and knowledge will still have to be there. Anyone would rather hire a human to do the work without researching it. It takes me 5 hours to watch YouTube videos to figure out how to do DIY projects around the house and I still manage to do it wrong. The trades and skilled workers are safe. AI, will however take over most admin roles within the industry including designers/engineers I'm afraid. Also, keep in mind how much it will cost a company to invest in LLM machines to replace humans. There's a reason fast food restaurants still have people. The technology has been there for decades, but the ROI isn't there yet.  \n\n\nAnother thing to consider is unionization. The unions, especially for electricians and similar trades, will become stronger and more prevalent. I see it similar as the realtor profession. Is a realtor actually needed in today's world? With all of the technology and resources out there, absolutely not. Maybe for first time home buyers... but all they really are nowadays are paper shufflers who get paid $30K for the sale of a $500K home. In just a few short years, AI will be able to (if it isn't already) answer any question about a location/community, house, paperwork, escrow process, optimal selling price, assessed market value, etc. to walk a homebuyer/seller through the process. We'll still need an inspector but even that will  be analyzed by AI for the homebuyer/seller. Not to digress, but there's no reason we should be paying realtors so much in today's world.",
                "comment_author": "crug12",
                "comment_score": 3,
                "comment_created_utc": 1700139589.0,
                "comment_created_dt": "2023-11-16 07:59:49"
            },
            {
                "comment_body": "I own a home services company...I often help people who are about to call a company to install a new switch for a ceiling fan that has a 2 minute, 3 step video on how to connect a \"lost\" remote signal. The money has always been in helping people that do not want to DIY",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700155182.0,
                "comment_created_dt": "2023-11-16 12:19:42"
            },
            {
                "comment_body": "Can't the same be said for the internet right now and youtube, tik tok, etc. There's all kind of information right now that can walk you through doing a decent job for most things and many people believe they can do skilled labor based on a few til tok videos. It still needs to be translated into quality work in the hands of someone skilled enough for the scope of the work.",
                "comment_author": "swayjohnnyray",
                "comment_score": 1,
                "comment_created_utc": 1700136709.0,
                "comment_created_dt": "2023-11-16 07:11:49"
            },
            {
                "comment_body": "Nah actually the AI will for sure recommend cutting most of the joists in half to run your shitter line in the first versions.",
                "comment_author": "tob007",
                "comment_score": 2,
                "comment_created_utc": 1700140508.0,
                "comment_created_dt": "2023-11-16 08:15:08"
            },
            {
                "comment_body": "What do you mean the engineering and arch drawings are supposed to match?",
                "comment_author": "AlphaNoodlz",
                "comment_score": 8,
                "comment_created_utc": 1700096003.0,
                "comment_created_dt": "2023-11-15 19:53:23"
            },
            {
                "comment_body": "Aye easy. The drawing side of construction ain’t easy. A lot to juggle. Some of you field guys wouldn’t last a day in the office. Tracking down information, trying to get clear answers, pressured to get drawings out to keep field busy. Not to mention the chair gets uncomfy after sitting for hours, neck cramps, the free coffee isn’t even that good, & depending where you’re sitting the sun might be in your eyes at a certain time or you get too hot or cold under the diffuser before the thermostat reaches temp. The worst part, we have to be there by 7:30am.. \n\nIn all seriousness. I do ‘drawings’ for large commercial electrical in MI. Most often larger commercial jobs are coordinated among trades via a shared 3D model before producing drawings. Not perfect but better than nothing. Field time $ is double office time, so we work for the field. We work with the foreman ahead of schedule to layout ckts in HRs, label them, plan routing for racks. \nFrom our program (Revit) we can export information to prefab hangers, in-wall boxes with accurate plaster rings, putty pads, spreader bars if needed, & a stubbed 90 at the correct height in to ceiling space. Calculating ug sweeps in tight areas. Huge time saver in the field. Granted my company is fortunately on the forefront of this. Invested time and $ to get here. \n\nThe field benefits from this position in my case. The biggest gap to bridge is the stigma between the two positions. Which I get. College boys vs the rough n tough construction boys. Anyway.",
                "comment_author": "The_Conches_Struggle",
                "comment_score": 5,
                "comment_created_utc": 1700101637.0,
                "comment_created_dt": "2023-11-15 21:27:17"
            },
            {
                "comment_body": "If your bucket could walk and pick up tools itself, go up flights of stairs and around corners then sure you could call it an expensive bucket",
                "comment_author": "Krabbypatty_thief",
                "comment_score": 2,
                "comment_created_utc": 1700175574.0,
                "comment_created_dt": "2023-11-16 17:59:34"
            },
            {
                "comment_body": "Yes I am currently working on a 10 story apartment building, believe it or not but alot of people on this subreddit work construction … I never said a robot could do the work, but Boston dynamics showcased a robot carrying tools up and down some scaffolding. They will be great for carrying materials.",
                "comment_author": "Krabbypatty_thief",
                "comment_score": 3,
                "comment_created_utc": 1700148912.0,
                "comment_created_dt": "2023-11-16 10:35:12"
            },
            {
                "comment_body": "If a meth head can do it I’m sure a robot can /s",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700183483.0,
                "comment_created_dt": "2023-11-16 20:11:23"
            },
            {
                "comment_body": "I disagree. \n\nAI and Robotics don't have to surpass \"us\"/you in every facet. \n\nIn 20 years, twenty to thirty percent of union/labor jobs will be removed because of robotics. It's not a if but a when.  Technology will continue to become better, cheaper, and more refined. \n\nYour welding robot is newer technology.  Give it 5 years and things will get spicy.",
                "comment_author": "Sippiku",
                "comment_score": -4,
                "comment_created_utc": 1700098598.0,
                "comment_created_dt": "2023-11-15 20:36:38"
            },
            {
                "comment_body": "i’m talking about he billions of homes that are currently erected and if all goes to plan will be around for hundreds of years. Surely they will be remodeled countless times. Good luck automating that",
                "comment_author": "CarletonIsHere",
                "comment_score": 4,
                "comment_created_utc": 1700099967.0,
                "comment_created_dt": "2023-11-15 20:59:27"
            },
            {
                "comment_body": "I could see more prefabbing happening.  Offsite design, offsite construction, gather the grunts to snap the Legos together.  Top grunt is making sure all the prefabbed pieces actually showed up",
                "comment_author": "dysoncube",
                "comment_score": 8,
                "comment_created_utc": 1700093491.0,
                "comment_created_dt": "2023-11-15 19:11:31"
            },
            {
                "comment_body": "Making the parts is the easy part. Its assembling them and getting them from where their made to where their needed. 3D printers make them directly in place which is why their so powerful.  \n\n\nWe already can construct buildings and ship them out. Quite a bit of my industrial work comes pre assembled and we just crane it onto site.  \n\n\nThen you need to have construction workers to come in and assemble them. Put them into place. Connect the modules together. And finish up things that cannot be done before shipping. But that is still expensive. That is what 3D printers are trying to cut out the assembly part not the modular building part.",
                "comment_author": "Dkykngfetpic",
                "comment_score": 2,
                "comment_created_utc": 1700101025.0,
                "comment_created_dt": "2023-11-15 21:17:05"
            },
            {
                "comment_body": "What industry are you in that you’re seeing this? Robotics and AI are a new wave pushing into these sectors, it’s brand new and the wearability and maintenance is still being worked out.\n\nI work for a robotics company in the construction industry, we are still working out wearability and maintenance, which is partly why we decided our best approach is to lease, not sell. This also allows us to give our clients all the newest and greatest features we’re developing. This also allows us to include indefinite service and maintenance, with immediate tech support and next day replacement across the country.\n\nYour company may be buying a lower cost option not the proven one, we see the same thing in our competitors. They don’t provide the same support as we do, but they are cheaper than we are.\n\nSomething to think about, in manufacturing, CNC mills ARE “robots”… we’re the very first ones back in the 80’s perfect? No they broke down, but 40 years later, it’s been perfected and you see them in every single machine shop across the world now even huge warehouses full of them being fed billets by robotic arms just to keep up with demand.\n\nThe difference/relationship between machine learning and AI needs to be better defined and understood by the general public. Everyone uses the phrase “AI” as a general statement and it is being used wrong in most cases. I won’t get into it, but everyone should do their research and understand there is a big difference. Most of what we are talking about here is machine learning.\n\nThe concept of AI scares the shit out of me to be honest, but I think if we (the human race) are responsible about what we do with it, it could save our asses in the future.",
                "comment_author": "TheConstructionGeek",
                "comment_score": 1,
                "comment_created_utc": 1700142378.0,
                "comment_created_dt": "2023-11-16 08:46:18"
            },
            {
                "comment_body": "https://en.m.wikipedia.org/wiki/Player_Piano_(novel)",
                "comment_author": "monkeyamongmen",
                "comment_score": 1,
                "comment_created_utc": 1715606029.0,
                "comment_created_dt": "2024-05-13 09:13:49"
            },
            {
                "comment_body": "And to double down these sweet factory made modular units still end up getting ripped open to make hvac connections plumbing electrical. Entire wall systems are missed like idk fire rated wall assemblies at the stairwells. So in short we have crossbreed a new building with a remodel all at once and have to do even stupider means and methods to get the job done.",
                "comment_author": "Jerkcarpenter",
                "comment_score": 2,
                "comment_created_utc": 1700168327.0,
                "comment_created_dt": "2023-11-16 15:58:47"
            },
            {
                "comment_body": ">Because AI can’t provide you with the tools needed to cut wood or carry sheets of plywood up a ladder for you. \n\nI'm not saying it will. You're still on the whole \"robots can do what I do\" mindset, and I'm trying to tell you that doesn't matter.\n\nI just need AI to help *me* rewire a room, or measure and cut drywall. If it can tell me what I need, help with installation by giving me directions and monitoring my progress, that will be more than enough for most jobs.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700144423.0,
                "comment_created_dt": "2023-11-16 09:20:23"
            },
            {
                "comment_body": "have you seen the Robot hanging drywall?  its getting closer.",
                "comment_author": "nickwrx",
                "comment_score": 1,
                "comment_created_utc": 1700139983.0,
                "comment_created_dt": "2023-11-16 08:06:23"
            },
            {
                "comment_body": ">t takes me 5 hours to watch YouTube videos to figure out how to do DIY projects around the house and I still manage to do it wrong. \n\nYou really aren't getting what the poster above, or I am saying. If AI can really replace designers, then it will have no problem guiding an able-bodied person through the process of installation. \n\nComparing what an AI will be able to do in ten years to a YouTube video is exactly the problem with people's thinking. If an AI can learn how to design a room remodel, it will be able to help me apply for permits, then it should have a problem telling me the proper measurements for drywall, talking me through the process of cutting it, and monitoring my progress as I install it.\n\nSome skilled jobs will remain until robotics catches up, so maybe they have another ten years beyond the next ten but all of these people claiming their motor skills are irreplaceable sound just as arrogant as the lawyers who think they can't be replaced.\n\nFunny that you mentioned realtors btw. Their union is getting sued for billions right now for precisely the problem you point out. I doubt people will tolerate a union of electricians trying to pull the same thing in the future.",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700144969.0,
                "comment_created_dt": "2023-11-16 09:29:29"
            },
            {
                "comment_body": "Youtube and Tik tok can't look at the actual situation in my house, or guide me step by step through the actual process of doing something in real time. Videos can't offer suggestions, tell me which tool I need for a specific situation at hand, or let me know if I'm doing a good or bad job of something will be able to do that soon. \n\nDoes that mean I'll be pouring a foundation or framing out a house anytime soon? Of course not. But I likely will be able to handle a lot that used to be beyond the reach of even a legitimately handy DIY  person in the not-too-distant future.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1700144214.0,
                "comment_created_dt": "2023-11-16 09:16:54"
            },
            {
                "comment_body": "Structural, architectural, finish, plumbing, electric, mechanical, and landscaping should never match under ANY circumstances",
                "comment_author": "WyattfuckinEarp",
                "comment_score": 7,
                "comment_created_utc": 1700096146.0,
                "comment_created_dt": "2023-11-15 19:55:46"
            },
            {
                "comment_body": "[removed]",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1700102055.0,
                "comment_created_dt": "2023-11-15 21:34:15"
            },
            {
                "comment_body": "Welding Robots are not new technology lol.\n\n“Give it 5 years”\n\nWelding Robots have been in use since the 1960’s.\n\nBut sure , 5 more years it will be spicy 😂",
                "comment_author": "N/A",
                "comment_score": 7,
                "comment_created_utc": 1700099588.0,
                "comment_created_dt": "2023-11-15 20:53:08"
            },
            {
                "comment_body": "Imagine a really big machine. Modular. Assembled on site. It’s fed raw materials (cold rolled coils, gypsum 2x, plywood, concrete etc.) for the stage of the project, or the proper tools for the project (earth mover stuff). Cuts and assembles prefabricated walls, ceilings, roofs. All with planned penetrations and installations for MEP including conduits, hangers, lights, boxes, sensors….         \nI’m high and on some sci fi shit.         \nI can’t imagine the Structural steel being able to be created on site, and there would definitely be need human finishers, and more inspector scrutiny.",
                "comment_author": "phiz36",
                "comment_score": 1,
                "comment_created_utc": 1700109896.0,
                "comment_created_dt": "2023-11-15 23:44:56"
            },
            {
                "comment_body": "Drilling and blasting. I haven't worked around any AI, but the \"smart\" drills that are around that try to do the work for the operator can't compete against a competent driller in a 40 year old rig. \n\nIt's not cost effective to spend a million on a brand new rig that needs constant maintenance and only works half the time, when you can run an old rig that runs 90% of the time and requires very little maintenance.\n\nThe newest rig I've seen has very little electronics, fewer sensors, and a basic computer, unlike the \"smart\" rig.\n\nMore features and electronics means more things that can go wrong with the machine. Owners don't want to spend money on fancy stuff if it isn't cost effective, parts and maintenance is a huge cost.\n\nIf the smart rigs could outperform older equipment, they might be viable, but the computers can't handle changes in material, and they don't allow the operator to make many changes.\n\nI've seen a 40 year old rig with less hammer power and less air power easily outdrill a smart rig with more hammer and air power.",
                "comment_author": "Relative_Surround_14",
                "comment_score": 1,
                "comment_created_utc": 1700175534.0,
                "comment_created_dt": "2023-11-16 17:58:54"
            },
            {
                "comment_body": "I wasn't aware you were referencing a book. I thought player piano like in the 1800s. Funny",
                "comment_author": "Odd_Bodybuilder_6047",
                "comment_score": 2,
                "comment_created_utc": 1715658461.0,
                "comment_created_dt": "2024-05-13 23:47:41"
            },
            {
                "comment_body": "Need to clarify my comment a little bit.  i work for a home remodeler.  A lot of the stuff we do could be done by the homeowner if they spent some time on YouTube learning and spent a couple grand on tools.  They hire us to do the things they are not willing to do in their free time.\nAI will certainly be an interesting trend to follow as the years go by,  but I feel like the work we do is safe for at least a decade!\nNew construction and doing high hazard, confined space, trenching, etc would be the most sensible use for AI in order to cut down on bodily harm to humans.  Until the robots become self aware!",
                "comment_author": "pheldozer",
                "comment_score": 1,
                "comment_created_utc": 1700171892.0,
                "comment_created_dt": "2023-11-16 16:58:12"
            },
            {
                "comment_body": "gotta leave room for the imagination. wHERE THE Magic happens.",
                "comment_author": "tob007",
                "comment_score": 3,
                "comment_created_utc": 1700140428.0,
                "comment_created_dt": "2023-11-16 08:13:48"
            },
            {
                "comment_body": "Haha yea, relatively okay. Attempt at humor. And I like my job, just wish the awareness was widespread & easier for all companies to get involved. My tone was sarcastic but not malicious. \n\nRight on. That’s awesome you navigate Revit as well. A guy with field experience on Revit is great, a lot to manage. I like my job and see it being more useful in the future, without taking field work.\nI’m in the trailer as well right now. 45 min commute, there at 6:30 with them. Soaking up knowledge from the experienced foremen out there. My dad worked construction and beat his body down. Nothing but respect for those guys.",
                "comment_author": "The_Conches_Struggle",
                "comment_score": 3,
                "comment_created_utc": 1700102547.0,
                "comment_created_dt": "2023-11-15 21:42:27"
            },
            {
                "comment_body": "Tick tock tick tock",
                "comment_author": "Sippiku",
                "comment_score": -5,
                "comment_created_utc": 1700100300.0,
                "comment_created_dt": "2023-11-15 21:05:00"
            },
            {
                "comment_body": "Lmao.\n\nYou don’t work in the industry do you?\n\nRobots have been in use on assembly lines for decades, yet zero progress towards dealing with the inconsistent conditions of every job site. Not gonna happen in our lifetimes.\n\nMaybe MAYBE by the end of my career I’ll need to get trained on operating some sort of robotic tool, but I’m not getting replaced.\n\n“Welding Robots are newer technology”. You were only off by like 6 decades.\nYou literally have no idea what you’re talking about.\n\nBet you’re one of those morons who think we’ll have fully driverless cars in just 5 more years.",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1700100666.0,
                "comment_created_dt": "2023-11-15 21:11:06"
            },
            {
                "comment_body": "Tick Tock Tick Tock",
                "comment_author": "Sippiku",
                "comment_score": -9,
                "comment_created_utc": 1700101034.0,
                "comment_created_dt": "2023-11-15 21:17:14"
            }
        ]
    },
    {
        "title": "Thoughts on AI & Construction: Exploring the Impact of ChatGPT",
        "selftext": "The relationship between artificial intelligence and construction has been an increasingly exciting frontier. The talk of the town these days seems to be ChatGPT. I've heard from plenty of construction colleagues talking about how this is going to change everything from bid proposals, engineering, overhead activities, and risk management.\n\nThese applications of ChatGPT could be vast and far reaching. However, the real question is, how do YOU see ChatGPT fitting into the construction industry? To that end, I've put together the poll below.\n\nWhether you're already incorporating ChatGPT into your work or are just interested in the potential it holds, I think the combined perspective will be interesting:\n\n[**ChatGPT in Construction - Microsoft Forms Link**](https://forms.office.com/r/GkWNUa3p1b)\n\nFor folks taking the poll, I'll share takeaways with you once it's completed!",
        "url": "https://www.reddit.com/r/Construction/comments/13l89ck/thoughts_on_ai_construction_exploring_the_impact/",
        "score": 0,
        "num_comments": 9,
        "created_utc": 1684437884.0,
        "created_dt": "2023-05-18 15:24:44",
        "author": "NF_PDX",
        "subreddit": "Construction",
        "comments": [
            {
                "comment_body": "[deleted]",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1684440824.0,
                "comment_created_dt": "2023-05-18 16:13:44"
            },
            {
                "comment_body": "Using a language model that doesn't have any accountability for being accurate to interpret and clarify ambiguity and conflicting information is not something I get excited about. The AI is trained on the same ambiguous and conflicting data that it would be used to process. Garbage in, garbage out. \n\nBTW, this reads like it was written by ChatGPT, and the moment that connection is made in a person's head they will start to question the fidelity and authenticity of whatever information is being conveyed.",
                "comment_author": "rinikulous",
                "comment_score": 3,
                "comment_created_utc": 1684443396.0,
                "comment_created_dt": "2023-05-18 16:56:36"
            },
            {
                "comment_body": "Already using it, it can check when painting. ?Are you accounting for taking towel bars off in a bathroom? It gets the difference of living space and hallway. Electrical in a kitchen different than a bathroom or garage. I use it also to check prices, and it can compare my last job's sold to labor and current material prices. But it's not chat gpt.",
                "comment_author": "myersfirebird",
                "comment_score": 2,
                "comment_created_utc": 1684466654.0,
                "comment_created_dt": "2023-05-18 23:24:14"
            },
            {
                "comment_body": "This was written in Chat GPT and OP's responses are from Chat GPT.",
                "comment_author": "JonnyJust",
                "comment_score": 1,
                "comment_created_utc": 1684452092.0,
                "comment_created_dt": "2023-05-18 19:21:32"
            },
            {
                "comment_body": "I'm a former white collar worker, I quit my job last month (was a lobbyist in DC) because I watched ChatGPT summarize a piece of legislation in 5 seconds that took me half an hour to research and read through. \n\nI'm looking to get into the construction industry because the work pays well compared to what other options would be available to me, and I realized five years out of college that I hate office work. \n\nBut the main reason I'm looking at construction is because it isn't going to get automated anytime soon, unlike a shit ton of jobs in my former industry and many others. \n\nAs a consequence of the rapid progression of AI, I believe that within the next 5 years, there will be a rush of white collar guys just like me looking to get into trades/construction after AI starts to take over their jobs, and I want to be ahead of the curve and establish myself before that happens.",
                "comment_author": "Waterloo702",
                "comment_score": 1,
                "comment_created_utc": 1684612568.0,
                "comment_created_dt": "2023-05-20 15:56:08"
            },
            {
                "comment_body": "That's a great question! I imagine it's like any other software application or tool used on a project: it's up to the person using it to validate and verify it's used correctly?",
                "comment_author": "NF_PDX",
                "comment_score": 1,
                "comment_created_utc": 1684441139.0,
                "comment_created_dt": "2023-05-18 16:18:59"
            },
            {
                "comment_body": "What are you using?",
                "comment_author": "kedi007",
                "comment_score": 1,
                "comment_created_utc": 1699862314.0,
                "comment_created_dt": "2023-11-13 02:58:34"
            },
            {
                "comment_body": "AI. To measure and check over estimates.",
                "comment_author": "myersfirebird",
                "comment_score": 1,
                "comment_created_utc": 1700359036.0,
                "comment_created_dt": "2023-11-18 20:57:16"
            },
            {
                "comment_body": "Name of the software",
                "comment_author": "kedi007",
                "comment_score": 1,
                "comment_created_utc": 1700362296.0,
                "comment_created_dt": "2023-11-18 21:51:36"
            },
            {
                "comment_body": "Materport and ask Amie",
                "comment_author": "myersfirebird",
                "comment_score": 1,
                "comment_created_utc": 1700444234.0,
                "comment_created_dt": "2023-11-19 20:37:14"
            }
        ]
    },
    {
        "title": "What’s your prediction on how AI will affect General Contractors?",
        "selftext": "I’m not a general contractor, but I’m curious how GCs view AI as it relates to your industry. Specifically, is there anything you’re dealing with that you think AI will help solve?\n",
        "url": "https://www.reddit.com/r/GeneralContractor/comments/1dxay6n/whats_your_prediction_on_how_ai_will_affect/",
        "score": 13,
        "num_comments": 26,
        "created_utc": 1720337613.0,
        "created_dt": "2024-07-07 03:33:33",
        "author": "zumpoof",
        "subreddit": "GeneralContractor",
        "comments": [
            {
                "comment_body": "I’m not a GC but a PM. I’m thinking about a change in work which is why I’m here. \n\nFor now I use it for knowledge gaps in processes and procedures in new projects coming my way.",
                "comment_author": "cf318",
                "comment_score": 5,
                "comment_created_utc": 1720362002.0,
                "comment_created_dt": "2024-07-07 10:20:02"
            },
            {
                "comment_body": "I’m a GC and I use the photo feature on ChatGPT 4o for code compliance verification. I can just take a photo of a wall and it’s pretty good at interpreting code to verify everything is compliant. You could also probably use it to explain what needs to be done to be compliant before you start a job, but I haven’t used it for that yet.",
                "comment_author": "DonutSlave",
                "comment_score": 5,
                "comment_created_utc": 1720385006.0,
                "comment_created_dt": "2024-07-07 16:43:26"
            },
            {
                "comment_body": "I think it will affect as much as me forgetting whether its my second or third wipe while having a shit",
                "comment_author": "wafflesnwhiskey",
                "comment_score": 7,
                "comment_created_utc": 1720361721.0,
                "comment_created_dt": "2024-07-07 10:15:21"
            },
            {
                "comment_body": "Mostly just generating spreadsheets and Gantt charts",
                "comment_author": "Metalstudguru",
                "comment_score": 2,
                "comment_created_utc": 1720358327.0,
                "comment_created_dt": "2024-07-07 09:18:47"
            },
            {
                "comment_body": "Using chatgpt to help me to correct my email to client.",
                "comment_author": "GoodMorningJoe",
                "comment_score": 2,
                "comment_created_utc": 1720385799.0,
                "comment_created_dt": "2024-07-07 16:56:39"
            },
            {
                "comment_body": "Construction is known for behind the curve when it comes to technology, but as a ex-software developer turned GC, I see several big changes coming up in the next few years. Most of the changes will be more noticeable to the office/project managers, things like: AI takeoffs, estimates, RFIs, job accounting, inventory management, bid board organization, ect. Companies will be able to get by with a much smaller in office team, and produce much higher quality bids in MUCH less time. I know people get excited about workers with VR goggles, but the real change in the short term will come to the pre-construction operations. Ive also had my guys in the field use it for organization. For example, inputting their punch list, inspection items, homeowner items, and remaining workflow items, and letting ChatGPT create a unified list, and organizing that list into a schedule. It will literally give you an order of operation based schedule, that includes trades you need to call and a shopping list for Home Depot for all the misc items on your punch list. I know it sounds simple, but things like this can really move the needle.\n\nI know there are already a few companies coming out with some cool technology.\n\nDownToBid- this one is still in beta. I believe.  It’s an AI that will take a set of plans, scrape the data, and then produce a detailed bid package for each division. It also seems to help create RFIs by noticing duplication, contradiction, or lack of data. It’s really a HUGE time saver if it’s accurate. It even matches the bid packages to subcontractors you have in the system and can create custom invites that include that companies info and all the relevant details for the job. My precon teams can take weeks, if not months, to go through these steps, so the idea that it can be done in essentially no time is amazing. \n\nhttps://downtobid.com\n\n\nBasis Board - this is an app I already use. You give it access to your email account, and it automatically creates job listings for each bid request you receive. The AI is smart enough to avoid duplicating jobs and can combine data across multiple employees' email accounts. So, if I’m emailing a client and my estimator is also emailing that client, all those emails go to the same job listing, along with plans (sent in emails), quotes, timelines, contracts, etc. Most of this happens in the background with very little effort from my team. With about 30 minutes a week, we maintain a super accurate bid board that includes all job docs, emails, and can produce reports on all kinds of stuff, e.g., what’s my win % with Client A, or what’s my total volume bid for the month, quarter, etc. It really goes far beyond this brief description but is a huge improvement over a whiteboard or Excel.",
                "comment_author": "cprovan",
                "comment_score": 1,
                "comment_created_utc": 1720375270.0,
                "comment_created_dt": "2024-07-07 14:01:10"
            },
            {
                "comment_body": "I see potential in contracts. Like pulling out terms that are “uncommon” to your particular contracts. As well as writing simple one off contracts for small jobs. I’ve played around with ChatGPT for both",
                "comment_author": "Accurate-Dimension99",
                "comment_score": 1,
                "comment_created_utc": 1720392180.0,
                "comment_created_dt": "2024-07-07 18:43:00"
            },
            {
                "comment_body": "I'm training ChatGP to learn how to be a carpenter. Because really what construction needs are actual people doing the physical work. All the computer shit in the world, doesn't replace a competent carpenter. Once Chat GP becomes a carpenter, we'll know that AI has succeeded in the impossible. \n\nWhen it takes X days to build something due to labor actually taking that long, how the heck can AI change that?",
                "comment_author": "Capable_Prune7842",
                "comment_score": 1,
                "comment_created_utc": 1720560281.0,
                "comment_created_dt": "2024-07-09 17:24:41"
            },
            {
                "comment_body": "Prime minister for what country?",
                "comment_author": "Ok_Split_9405",
                "comment_score": 6,
                "comment_created_utc": 1720372547.0,
                "comment_created_dt": "2024-07-07 13:15:47"
            },
            {
                "comment_body": "That’s why I’m here too!",
                "comment_author": "Propertymanager101",
                "comment_score": 1,
                "comment_created_utc": 1720579836.0,
                "comment_created_dt": "2024-07-09 22:50:36"
            },
            {
                "comment_body": "What? I knew It could analyze photos but had no idea it could do this. What “code” does it make sure the wall complies to? I’m not a GC, but I assumed building codes are different by county/state?",
                "comment_author": "zumpoof",
                "comment_score": 3,
                "comment_created_utc": 1720418048.0,
                "comment_created_dt": "2024-07-08 01:54:08"
            },
            {
                "comment_body": "How exactly does this work?",
                "comment_author": "John_Bender-",
                "comment_score": 2,
                "comment_created_utc": 1720403195.0,
                "comment_created_dt": "2024-07-07 21:46:35"
            },
            {
                "comment_body": "I even use it for text messaging now :)",
                "comment_author": "zumpoof",
                "comment_score": 1,
                "comment_created_utc": 1720417905.0,
                "comment_created_dt": "2024-07-08 01:51:45"
            },
            {
                "comment_body": "So ChatGPT wrote this?",
                "comment_author": "Dull-Mix-870",
                "comment_score": 2,
                "comment_created_utc": 1720394897.0,
                "comment_created_dt": "2024-07-07 19:28:17"
            },
            {
                "comment_body": "I appreciate the thorough response, cprovan. I learned a bunch of new terms from your response as well, like “takeoffs”.  It sounds like there are several places where numbers don’t have to be exactly correct, and in those situations AI can be extremely useful. Also, as you said, in putting together pre-construction operations. Downtobid sounds like cool, and seems like an extension of what you’re saying about pre-construction work.\n\nBasis Board is incredible, I’ve never heard of software that even works like this. That’s so smart.\n\nI’m also an ex-software developer *air high five*. I have a business that serves GCs but lately they keep asking me about how AI can help them and I don’t/didn’t really have a good answer for them. Again, thanks for the response, super insightful.",
                "comment_author": "zumpoof",
                "comment_score": 1,
                "comment_created_utc": 1720417733.0,
                "comment_created_dt": "2024-07-08 01:48:53"
            },
            {
                "comment_body": "That makes sense, ChatGPT is just so good at things like that. Thank you.",
                "comment_author": "zumpoof",
                "comment_score": 1,
                "comment_created_utc": 1720417872.0,
                "comment_created_dt": "2024-07-08 01:51:12"
            },
            {
                "comment_body": "AI can't change that, it's not a threat to the trades. It's a threat to management, operations, and digital skilled labor.",
                "comment_author": "kkbrandt",
                "comment_score": 1,
                "comment_created_utc": 1725529076.0,
                "comment_created_dt": "2024-09-05 05:37:56"
            },
            {
                "comment_body": "Lol, property manager or project manager",
                "comment_author": "Propertymanager101",
                "comment_score": 1,
                "comment_created_utc": 1720579856.0,
                "comment_created_dt": "2024-07-09 22:50:56"
            },
            {
                "comment_body": "Prime Minister of PC land. The only thing I have full control of.",
                "comment_author": "cf318",
                "comment_score": 1,
                "comment_created_utc": 1720580456.0,
                "comment_created_dt": "2024-07-09 23:00:56"
            },
            {
                "comment_body": "Well, all the codes are publicly available, so you just need to specify the jurisdiction. Hasn't been a problem. This is exactly the type of use case that AI is good at - ingesting a clearly defined public ruleset and then applying it, accounting for conflicts / complexity. When then talk about lawyers being replaced - I think inspectors are much more at risk. \n\nTheoretically, you could replace them with AI today. If contractors just submitted photos of work to an AI that assessed compliance, I bet the accuracy and reliability would be higher than human inspectors and it would completely eliminate delays",
                "comment_author": "DonutSlave",
                "comment_score": 1,
                "comment_created_utc": 1720435590.0,
                "comment_created_dt": "2024-07-08 06:46:30"
            },
            {
                "comment_body": "I just take a photo of something and ask it to confirm compliance with the code in my jurisdiction. It's really amazing how much it can get from a single image. \n\nHere is a very simple example of how it could be used, that shows how powerful the AI is at image interpretation. Very simple image, no context explained. [https://file.notion.so/f/f/8de46544-bbf4-4c02-b09d-cfcc9401201e/83069bc4-069c-46f7-b31a-05b2c2cefa72/Screenshot\\_2024-07-08\\_at\\_6.47.23\\_AM.png?id=5fd8a5e5-3d2c-4c02-b5a9-3cf593036b91&table=block&spaceId=8de46544-bbf4-4c02-b09d-cfcc9401201e&expirationTimestamp=1720569600000&signature=-iY0C\\_aFSvPe\\_JmbmXlPZNeG1omOsmhvzNKIva7GhQ0&downloadName=Screenshot+2024-07-08+at+6.47.23%E2%80%AFAM.png](https://file.notion.so/f/f/8de46544-bbf4-4c02-b09d-cfcc9401201e/83069bc4-069c-46f7-b31a-05b2c2cefa72/Screenshot_2024-07-08_at_6.47.23_AM.png?id=5fd8a5e5-3d2c-4c02-b5a9-3cf593036b91&table=block&spaceId=8de46544-bbf4-4c02-b09d-cfcc9401201e&expirationTimestamp=1720569600000&signature=-iY0C_aFSvPe_JmbmXlPZNeG1omOsmhvzNKIva7GhQ0&downloadName=Screenshot+2024-07-08+at+6.47.23%E2%80%AFAM.png)",
                "comment_author": "DonutSlave",
                "comment_score": 1,
                "comment_created_utc": 1720435917.0,
                "comment_created_dt": "2024-07-08 06:51:57"
            },
            {
                "comment_body": "Lol, definitely use it to clean up most emails, posts, or important texts.",
                "comment_author": "cprovan",
                "comment_score": 1,
                "comment_created_utc": 1720399260.0,
                "comment_created_dt": "2024-07-07 20:41:00"
            },
            {
                "comment_body": "Project manager 👍",
                "comment_author": "cf318",
                "comment_score": 1,
                "comment_created_utc": 1720580400.0,
                "comment_created_dt": "2024-07-09 23:00:00"
            },
            {
                "comment_body": "That is so cool. I agree that it will eventually beat human inspection soon. Worst case is that it quickly identifies egregious violations before a human ever has to be bothered with something so obvious.",
                "comment_author": "zumpoof",
                "comment_score": 2,
                "comment_created_utc": 1720488645.0,
                "comment_created_dt": "2024-07-08 21:30:45"
            },
            {
                "comment_body": "Nothing shows up when I click this link.",
                "comment_author": "John_Bender-",
                "comment_score": 1,
                "comment_created_utc": 1720486459.0,
                "comment_created_dt": "2024-07-08 20:54:19"
            },
            {
                "comment_body": "I always tell people ChatGPT is like grammar check- it’s just part of writing now.",
                "comment_author": "zumpoof",
                "comment_score": 1,
                "comment_created_utc": 1720417795.0,
                "comment_created_dt": "2024-07-08 01:49:55"
            }
        ]
    },
    {
        "title": "Using AI in Construction Management",
        "selftext": "I always wondered how I can utilize AI in the constriction world. And I’m totally not for robots taking away from the true manual labor but today was my first use of ChatGPT in the CM world. \nSo my marketing director asked me to put together some bullet points for a case study of my project I just finished. I went into ChatGPT and asked to provide me 4 bullet points of my project (I gave some specifics of my project) and clicked enter. It gave me 4 great points that I edited a bit but it saved me about an hour of actual doing this myself. \n\nPretty sweet i think. \n\nAre there any other ways you’ve used AI in our industry?",
        "url": "https://www.reddit.com/r/ConstructionManagers/comments/193nj54/using_ai_in_construction_management/",
        "score": 32,
        "num_comments": 87,
        "created_utc": 1704931618.0,
        "created_dt": "2024-01-10 19:06:58",
        "author": "rp2DaC",
        "subreddit": "ConstructionManagers",
        "comments": [
            {
                "comment_body": "Spec search.\n\nThere are ai that read pdfs\n\nThen you can just ask.. \"what's the wall height of an F6\" or what's hanger spacing for 2\" copper",
                "comment_author": "completelypositive",
                "comment_score": 12,
                "comment_created_utc": 1704979720.0,
                "comment_created_dt": "2024-01-11 08:28:40"
            },
            {
                "comment_body": "I recently sat with a start-up company trying to revolutionize project management through AI. They realized a big pain point for GCs and CMs is the amount of data entry needed to use Procore, Projectsight, etc successfully. Their hope is to eliminate data entry by connecting to CMs emails, texts, etc and pumping that data into their CM software, so all the CM has to do is review and edit instead of entering data themselves. I'm a bit skeptical, but I'm interested because they just sold their previous business for $100m.",
                "comment_author": "wrk592",
                "comment_score": 23,
                "comment_created_utc": 1704938888.0,
                "comment_created_dt": "2024-01-10 21:08:08"
            },
            {
                "comment_body": "I use it to rewrite emails. I can completely vent all frustration and anger  in my best jobsite profanity and insults with subs, A/E's, owner's, clients, etc. in a written email and pass it through ChatGPT and tell it to rewrite the email as if it were being delivered to a bus full of nuns and children. It's cathartic to write what you really want to say and have it purified for inoffensive delivery through ChatGPT.",
                "comment_author": "SigmundsCouch",
                "comment_score": 17,
                "comment_created_utc": 1704936174.0,
                "comment_created_dt": "2024-01-10 20:22:54"
            },
            {
                "comment_body": "Our field personnel upload their credit card receipts into our in-house project management software.   ChatGPT reads the scan, determines if it is fuel, lumber, hardware or something else and kicks out a report to accounting with dollar amounts , job number based on who did the upload, and job cost categories in some cases.   This is our own software we designed.",
                "comment_author": "crabman5962",
                "comment_score": 6,
                "comment_created_utc": 1704949297.0,
                "comment_created_dt": "2024-01-11 00:01:37"
            },
            {
                "comment_body": "Use it translate English and Spanish",
                "comment_author": "Ready_Treacle_4871",
                "comment_score": 5,
                "comment_created_utc": 1704934708.0,
                "comment_created_dt": "2024-01-10 19:58:28"
            },
            {
                "comment_body": "This sounds great to just get through the red tape portion of my day.\n\nSubmittals would be key. That and O & M manuals. CO drafting once input of the material and labor data.\n\nRFIs would still be me as I’m the one evaluating a set of plans / documents. An AI would maybe know to look for the basics, but I don’t know if it will ever be able to distinguish minute details of Architect fuckups.",
                "comment_author": "Floorguy1",
                "comment_score": 4,
                "comment_created_utc": 1704989055.0,
                "comment_created_dt": "2024-01-11 11:04:15"
            },
            {
                "comment_body": "I use chat Gpt when I write mean emails to shitty subs, makes it sound less intense haha",
                "comment_author": "GCsurfstar",
                "comment_score": 2,
                "comment_created_utc": 1704965148.0,
                "comment_created_dt": "2024-01-11 04:25:48"
            },
            {
                "comment_body": "I use it for emails to trades that are delaying the job or some other annoyance. Works great. Then just for fun I ask it to rewrite with the inflection of porky pig or a pirate or something creative and share that with team members to lift spirits. Anyone in a management position should be leveraging AI or at a minimum know what it's about and how it outputs information to spot it.",
                "comment_author": "Kungflubat",
                "comment_score": 2,
                "comment_created_utc": 1705026160.0,
                "comment_created_dt": "2024-01-11 21:22:40"
            },
            {
                "comment_body": "And now we witness the start of a multitude of fuckups. Construction doesn't have room for laziness, I can forsee major problems ahead for any job this man/woman is involved in.",
                "comment_author": "kingpinjunky02",
                "comment_score": 1,
                "comment_created_utc": 1704933844.0,
                "comment_created_dt": "2024-01-10 19:44:04"
            },
            {
                "comment_body": "Mostly just extracting text from docs, especially on things that can be missed. We use it in Precon to read proposals/quotes from subs to identify and extract exclusions. We also use it to read specs to extract equipment warranties and match them up against quotes to make sure if extended warranties are needed they were covered. Then use that all to generate handoffs. Theres some other spec stuff, like pulling/generating submittal logs from specs.",
                "comment_author": "FullSend510",
                "comment_score": 1,
                "comment_created_utc": 1704943077.0,
                "comment_created_dt": "2024-01-10 22:17:57"
            },
            {
                "comment_body": "I'm seeking insights from experts in the construction field regarding the impact of AI on enhancing safety and quality within the industry.\n\nAs a BSc Construction management student at Nottingham Trent University, I've prepared a brief survey that requires just 5 minutes of your time. Your participation and any information you provide would be highly valued.\n\nThank you in advance for your time and contributions!\n\n[https://forms.office.com/Pages/ResponsePage.aspx?id=xcLLiu3Ix0KBabpDig2-L4spcTk2WoxKqqHtwIsDjX9UQzdPUzZXUFQ4NUoxQjBRSVVFWE1BVk1FTy4u](https://forms.office.com/Pages/ResponsePage.aspx?id=xcLLiu3Ix0KBabpDig2-L4spcTk2WoxKqqHtwIsDjX9UQzdPUzZXUFQ4NUoxQjBRSVVFWE1BVk1FTy4u)",
                "comment_author": "LewisAinsworth",
                "comment_score": 1,
                "comment_created_utc": 1712677323.0,
                "comment_created_dt": "2024-04-09 11:42:03"
            },
            {
                "comment_body": "If chatgpt did the work and you just did a edit. what if your boss found out and then he did the same thing and your removed from the job. AI is good to remove the heavy task that waste a lot of time like keeping all the file updated and everyone informed about new changes and items like that. I think i spend about 4hr a week checking and making sure the file we have not changed and if they have get them in working models and make sure clash test work on them.",
                "comment_author": "ZadaGrims",
                "comment_score": 0,
                "comment_created_utc": 1704932647.0,
                "comment_created_dt": "2024-01-10 19:24:07"
            },
            {
                "comment_body": "Sounds like everyone in this thread is looking for an AI tool to read all project docs then act as a Q&A . Trunk Tools is that exact function. Integrates with everything. Dropped the website below.\ntrunktools.com",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 0,
                "comment_created_utc": 1721769135.0,
                "comment_created_dt": "2024-07-23 17:12:15"
            },
            {
                "comment_body": "I use Google Bard to write methodologies and what not. It’s great!",
                "comment_author": "snoozeyaloose",
                "comment_score": 1,
                "comment_created_utc": 1704964640.0,
                "comment_created_dt": "2024-01-11 04:17:20"
            },
            {
                "comment_body": "Eventually will be used for the submittal review process and looking for issues with the drawings",
                "comment_author": "Individual_Section_6",
                "comment_score": 1,
                "comment_created_utc": 1704990023.0,
                "comment_created_dt": "2024-01-11 11:20:23"
            },
            {
                "comment_body": "We loaded past project issues into a comprehensive database to make it searchable by sub, system/equipment type, etc. We used Power BI to create the searchable database. Our next step is to connect the database to AI so our queries create better and more direct feedback.",
                "comment_author": "treddonit7429",
                "comment_score": 1,
                "comment_created_utc": 1705195854.0,
                "comment_created_dt": "2024-01-13 20:30:54"
            },
            {
                "comment_body": "This is one sounds really useful. Do you mind sharing what program that is?",
                "comment_author": "rp2DaC",
                "comment_score": 6,
                "comment_created_utc": 1704979765.0,
                "comment_created_dt": "2024-01-11 08:29:25"
            },
            {
                "comment_body": "Can you share ? Thank you!",
                "comment_author": "Disastrous_Ad8483",
                "comment_score": 3,
                "comment_created_utc": 1704982212.0,
                "comment_created_dt": "2024-01-11 09:10:12"
            },
            {
                "comment_body": "I’ve tried to use Microsoft ai to make lists from specs such as a list of inspections or a list of submittals however it is limited if you have large documents.  Would love to hear of anybody else has tried this.",
                "comment_author": "dickpound430",
                "comment_score": 3,
                "comment_created_utc": 1704998013.0,
                "comment_created_dt": "2024-01-11 13:33:33"
            },
            {
                "comment_body": "PDFgear (Microsoft store fo free)has a basic AI that you can use to \"talk\" to ur pdf. I use it to go through books and have it quiz me on the chapters \n\n. Also\n\nhttps://notebooklm.google/\n\nYou can upload your pdfs/copied text And then you can select what the AI references when talking to you.",
                "comment_author": "tokithetoker",
                "comment_score": 1,
                "comment_created_utc": 1705025623.0,
                "comment_created_dt": "2024-01-11 21:13:43"
            },
            {
                "comment_body": "Digging up an old post here; would be keen to get your feedback on this spec PDF search tool we built. \n\nMy co-founder faced this problem cause he worked as an estimator in the Bay Area and complained about how long it would go through these PDFs cause it would usually be CTRL + F (concrete block) and then look through 80+ pages to see his answer 😅\n\nDM'd you! hope you don't mind",
                "comment_author": "dtek_01",
                "comment_score": 1,
                "comment_created_utc": 1713509572.0,
                "comment_created_dt": "2024-04-19 02:52:52"
            },
            {
                "comment_body": "[www.docubuild.io](http://www.docubuild.io) does that, along with other cool AI use-cases (and lots of non-ai features too). In a nutshell, the Ai figures out what docs you need to complete a project, helps you request it from your team & subcontractors, automatically checks the work submitted, automatically creates OM Manuals, instantly digests all info so you can query it like your example. We've got a few big companies using it in Australia. \n\nI'm founder and obsessed with all things construction management. Always keen for a chat if anyone wants to see a demo / chat about the industry.",
                "comment_author": "docubuild",
                "comment_score": 1,
                "comment_created_utc": 1718077318.0,
                "comment_created_dt": "2024-06-10 23:41:58"
            },
            {
                "comment_body": "Which ai does this?",
                "comment_author": "whatever_you_say_man",
                "comment_score": 1,
                "comment_created_utc": 1705005228.0,
                "comment_created_dt": "2024-01-11 15:33:48"
            },
            {
                "comment_body": "What kind of data are you referring to?",
                "comment_author": "rp2DaC",
                "comment_score": 2,
                "comment_created_utc": 1704939020.0,
                "comment_created_dt": "2024-01-10 21:10:20"
            },
            {
                "comment_body": "Was this Slate? Sounds like them and they definitely have the most advanced tech I’ve seen. Would love to hear more about what your thoughts were and how forward they looked.",
                "comment_author": "FullSend510",
                "comment_score": 1,
                "comment_created_utc": 1704943206.0,
                "comment_created_dt": "2024-01-10 22:20:06"
            },
            {
                "comment_body": "[deleted]",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1704943549.0,
                "comment_created_dt": "2024-01-10 22:25:49"
            },
            {
                "comment_body": "😂 I’m gonna try that tomorrow and see how it gets re-written.",
                "comment_author": "rp2DaC",
                "comment_score": 4,
                "comment_created_utc": 1704936254.0,
                "comment_created_dt": "2024-01-10 20:24:14"
            },
            {
                "comment_body": "What really would make it better if it (chatgpt) worked in the background without you needing to tell it anything, once you've written it, it should have a little icon to tell you \"here's the revised version\" click to update etc.\nCopy and pasting can be annoying.",
                "comment_author": "second-last-mohican",
                "comment_score": 3,
                "comment_created_utc": 1704953051.0,
                "comment_created_dt": "2024-01-11 01:04:11"
            },
            {
                "comment_body": "This is me, daily hahaha",
                "comment_author": "GCsurfstar",
                "comment_score": 1,
                "comment_created_utc": 1704965168.0,
                "comment_created_dt": "2024-01-11 04:26:08"
            },
            {
                "comment_body": "So I’m definitely going to have to try this. Because as a finishing sub, my schedule is always getting crunched by other trades dragging ass and/or dropping the ball.",
                "comment_author": "Floorguy1",
                "comment_score": 1,
                "comment_created_utc": 1704988493.0,
                "comment_created_dt": "2024-01-11 10:54:53"
            },
            {
                "comment_body": "Hey, keen to know more about your tool.",
                "comment_author": "UnluckyAd9512",
                "comment_score": 1,
                "comment_created_utc": 1726203115.0,
                "comment_created_dt": "2024-09-13 00:51:55"
            },
            {
                "comment_body": "Submittals is the one I'm waiting on and been scouring the internet for... Really need to pass off the BS submittal process to AI.",
                "comment_author": "alter_ego311",
                "comment_score": 2,
                "comment_created_utc": 1705000533.0,
                "comment_created_dt": "2024-01-11 14:15:33"
            },
            {
                "comment_body": "Ilhame here. I hear you! AI can definitely help streamline tasks like submittals, O&M manuals, and drafting COs by handling the tedious parts. While RFIs might still need your expertise for now, AI is constantly improving. Who knows, it might get better at catching those minute details in the future. In the meantime, it's great for cutting through the red tape and making your day a bit easier!",
                "comment_author": "Adventurous-Snow-368",
                "comment_score": 1,
                "comment_created_utc": 1719870656.0,
                "comment_created_dt": "2024-07-01 17:50:56"
            },
            {
                "comment_body": "Agreed 100%. There will be some things in our industry that will never be replaced by Ai. Calling out architecture mess ups will always be my joy to do. But would be cool if they can have something compare the dimensions on a floor plan and maybe like an enlarged bathroom plan to make sure those dimensions line up. Or maybe to review architectural Rcp and electrical rcp to make sure light fixtures match up. If that can some how be automated that would save time for us. Ya ya I know you can easily overlay the two rcps and do it yourself or have the intern or PE do it but we’re talking about how to use technology to save us time. Just a thought.",
                "comment_author": "rp2DaC",
                "comment_score": 1,
                "comment_created_utc": 1704990125.0,
                "comment_created_dt": "2024-01-11 11:22:05"
            },
            {
                "comment_body": "Yes. Something similar to Check Set but all AI. Check all references and detail tags. Find any product without a corresponding spec. Run overlays for all the design disciplines.",
                "comment_author": "slowsol",
                "comment_score": 1,
                "comment_created_utc": 1705166558.0,
                "comment_created_dt": "2024-01-13 12:22:38"
            },
            {
                "comment_body": "I’m a developer with a bunch of experience working with AI, I’ve actually speaking to a few other PMs about automating their red tape and this looks like a real use case, I’d love to talk and build this out for you for free if you’re willing to help me learn more!",
                "comment_author": "Leadership_Upper",
                "comment_score": 1,
                "comment_created_utc": 1706574874.0,
                "comment_created_dt": "2024-01-29 19:34:34"
            },
            {
                "comment_body": "They then use an email rule that sends them directly to the trash can. It has come full circle.",
                "comment_author": "slowsol",
                "comment_score": 1,
                "comment_created_utc": 1705166694.0,
                "comment_created_dt": "2024-01-13 12:24:54"
            },
            {
                "comment_body": "😂😂😂",
                "comment_author": "rp2DaC",
                "comment_score": 1,
                "comment_created_utc": 1705026831.0,
                "comment_created_dt": "2024-01-11 21:33:51"
            },
            {
                "comment_body": "Well, first, construction certainly has room for laziness, I see it every day. I doubt a building is gonna burn if there's a typo in this guy's report.\n\nSecond, this guy is using AI in a very limited way that's easy to check. You're being a little dramatic. Shit like this is one step above Clippy. Excel does *way* more advanced automation for me every day, do I have major problems ahead?",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 17,
                "comment_created_utc": 1704934641.0,
                "comment_created_dt": "2024-01-10 19:57:21"
            },
            {
                "comment_body": "Skipping out on the details means more details will be skipped. OP already fucked up my Christmas bonus for 2024",
                "comment_author": "Cpl-V",
                "comment_score": -1,
                "comment_created_utc": 1704936148.0,
                "comment_created_dt": "2024-01-10 20:22:28"
            },
            {
                "comment_body": "Oh yeah can’t wait to write a contract or a scope exhibit with AI. FOR SURE THERE WONT BE ANY SCOPE GAPS.",
                "comment_author": "rp2DaC",
                "comment_score": 1,
                "comment_created_utc": 1704933937.0,
                "comment_created_dt": "2024-01-10 19:45:37"
            },
            {
                "comment_body": "Let AI do that menial crap all day. Then focus on the highest payoff activities. Don’t be worried about your job. Your job will evolve.",
                "comment_author": "slowsol",
                "comment_score": 1,
                "comment_created_utc": 1705166909.0,
                "comment_created_dt": "2024-01-13 12:28:29"
            },
            {
                "comment_body": "DM me if you have questions.",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 0,
                "comment_created_utc": 1721769179.0,
                "comment_created_dt": "2024-07-23 17:12:59"
            },
            {
                "comment_body": "DM'ing you with a tool",
                "comment_author": "dtek_01",
                "comment_score": 1,
                "comment_created_utc": 1713509687.0,
                "comment_created_dt": "2024-04-19 02:54:47"
            },
            {
                "comment_body": "Trunk tools is the name!",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 1,
                "comment_created_utc": 1721768868.0,
                "comment_created_dt": "2024-07-23 17:07:48"
            },
            {
                "comment_body": "Egnyte… but unless your employer provides probably cost prohibitive on its own. They have huge minimums",
                "comment_author": "IrishInUSA7943",
                "comment_score": 1,
                "comment_created_utc": 1705126313.0,
                "comment_created_dt": "2024-01-13 01:11:53"
            },
            {
                "comment_body": "DM'ing you with a tool that helps with this :)",
                "comment_author": "dtek_01",
                "comment_score": 1,
                "comment_created_utc": 1713509734.0,
                "comment_created_dt": "2024-04-19 02:55:34"
            },
            {
                "comment_body": "Trunk tools is the name!",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 1,
                "comment_created_utc": 1721768894.0,
                "comment_created_dt": "2024-07-23 17:08:14"
            },
            {
                "comment_body": "I’m actually trying to work on a comprehensive AI solution including this for PVs etc. Would love to chat if you would",
                "comment_author": "Leadership_Upper",
                "comment_score": 1,
                "comment_created_utc": 1706575267.0,
                "comment_created_dt": "2024-01-29 19:41:07"
            },
            {
                "comment_body": "Trunk tools is the company name",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 0,
                "comment_created_utc": 1721769004.0,
                "comment_created_dt": "2024-07-23 17:10:04"
            },
            {
                "comment_body": "Some examples I was given was -\n\nYou receive an email with an RFI attached. The software would understand it's an RFI, it would write the RFI and attach the PDF/whatever to the RFI, and it would be ready to go next time you log into the software after a review.\n\nSimilarly for change orders - you receive a text for with your subcontractor saying, \"I have to charge you $3000 for changing the foundation wall from 12'' to 16\". The software would understand it's a change order, it would input it into your PCO log, all you would have to do is review before sending it off to your owner.\n\nAnother thing they're trying to address is: the lack of subcontractors using the construction management software. Let's be real - not all of us have a sophisticated subcontractor pool that uses our CM software. They're trying to \"meet the sub where they are\", AKA email or text.",
                "comment_author": "wrk592",
                "comment_score": 13,
                "comment_created_utc": 1704940043.0,
                "comment_created_dt": "2024-01-10 21:27:23"
            },
            {
                "comment_body": "It was not Slate. It was back in October... I can't remember the name. They're still 8mo out from going public. Happy to share more via DM though.",
                "comment_author": "wrk592",
                "comment_score": 2,
                "comment_created_utc": 1704943629.0,
                "comment_created_dt": "2024-01-10 22:27:09"
            },
            {
                "comment_body": "It was not",
                "comment_author": "wrk592",
                "comment_score": 1,
                "comment_created_utc": 1704944157.0,
                "comment_created_dt": "2024-01-10 22:35:57"
            },
            {
                "comment_body": "I'm sure that feature will be available at some point. The drawback is IT departments set it up to store the original l, unedited version. An HR nightmare.",
                "comment_author": "SigmundsCouch",
                "comment_score": 2,
                "comment_created_utc": 1704967835.0,
                "comment_created_dt": "2024-01-11 05:10:35"
            },
            {
                "comment_body": "Definitely give it a try! Using ChatGPT to streamline communication and manage your schedule could really help when other trades are causing delays. It might make your workflow a lot smoother. Good luck!",
                "comment_author": "Adventurous-Snow-368",
                "comment_score": 1,
                "comment_created_utc": 1719870550.0,
                "comment_created_dt": "2024-07-01 17:49:10"
            },
            {
                "comment_body": "One day it will be an AI submitted to another AI, who will reject and kick it back to the GC/Sub AI.",
                "comment_author": "Floorguy1",
                "comment_score": 2,
                "comment_created_utc": 1705009463.0,
                "comment_created_dt": "2024-01-11 16:44:23"
            },
            {
                "comment_body": "I’m a developer with a bunch of experience working with AI, I’d love to talk and build this out for you for free if you’re willing to help me learn more about the industry!",
                "comment_author": "Leadership_Upper",
                "comment_score": 1,
                "comment_created_utc": 1706558914.0,
                "comment_created_dt": "2024-01-29 15:08:34"
            },
            {
                "comment_body": "That would be incredible! An AI that functions like Check Set, but with even more capabilities, could be a game-changer. Having it check all references, detail tags, and find products without corresponding specs would save so much time. Running overlays for all design disciplines automatically would be a huge efficiency boost. Embracing this kind of technology can really streamline our processes and reduce errors. Let's hope we see these advancements soon!",
                "comment_author": "Adventurous-Snow-368",
                "comment_score": 1,
                "comment_created_utc": 1719870801.0,
                "comment_created_dt": "2024-07-01 17:53:21"
            },
            {
                "comment_body": "Excel is in a controlled environment and is also not internet based, where misinformation is everywhere. Reports are fine, sure, but he's asking about  other applications that could result in problems.\n\nLaziness is not only accepted but also accounted in planning labour, I wouldn't expect it from my management team as much, though. \n\nI can forsee a reliance starting to unfold that will end up costing a lot of time and money, you need to know exactly what's going on, not try and recover from a fuckup that resulted in relying on AI.",
                "comment_author": "kingpinjunky02",
                "comment_score": -3,
                "comment_created_utc": 1704935985.0,
                "comment_created_dt": "2024-01-10 20:19:45"
            },
            {
                "comment_body": "Imagine trying to use AI to do a program and it completely fuck your critical path.",
                "comment_author": "kingpinjunky02",
                "comment_score": 1,
                "comment_created_utc": 1704934040.0,
                "comment_created_dt": "2024-01-10 19:47:20"
            },
            {
                "comment_body": "That was we have entry level for lol.",
                "comment_author": "ZadaGrims",
                "comment_score": 1,
                "comment_created_utc": 1705179344.0,
                "comment_created_dt": "2024-01-13 15:55:44"
            },
            {
                "comment_body": "Could you dm me too please?",
                "comment_author": "beanowest",
                "comment_score": 1,
                "comment_created_utc": 1726660026.0,
                "comment_created_dt": "2024-09-18 07:47:06"
            },
            {
                "comment_body": "Can you send it my way to please?",
                "comment_author": "nreis1992",
                "comment_score": 1,
                "comment_created_utc": 1727006674.0,
                "comment_created_dt": "2024-09-22 08:04:34"
            },
            {
                "comment_body": "Can you share it with me too please! I think this would be really usefull for me! Thank you",
                "comment_author": "Parsley-Few",
                "comment_score": 1,
                "comment_created_utc": 1721314178.0,
                "comment_created_dt": "2024-07-18 10:49:38"
            },
            {
                "comment_body": "I'd love to! DM me!",
                "comment_author": "Disastrous_Ad8483",
                "comment_score": 1,
                "comment_created_utc": 1706575863.0,
                "comment_created_dt": "2024-01-29 19:51:03"
            },
            {
                "comment_body": "Hmmm that’s interesting. Appreciate you sharing!",
                "comment_author": "rp2DaC",
                "comment_score": 5,
                "comment_created_utc": 1704940131.0,
                "comment_created_dt": "2024-01-10 21:28:51"
            },
            {
                "comment_body": ">I can forsee a reliance starting to unfold [with the abacus] that will end up costing a lot of time and money, you need to know exactly what's going on, not try and recover from a fuckup that resulted in relying on [an abacus].\n\n-some PM in Sumeria\n\nIt's a tool. You learn how it can help, how it can't help, and what it gets wrong, and then your life is marginally easier. Like every other tool in human history (disregarding any potential broader societal impact AI could have).",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 2,
                "comment_created_utc": 1704988965.0,
                "comment_created_dt": "2024-01-11 11:02:45"
            },
            {
                "comment_body": "So you mean it would be as good as the average scheduler that is human?",
                "comment_author": "slowsol",
                "comment_score": 1,
                "comment_created_utc": 1705166822.0,
                "comment_created_dt": "2024-01-13 12:27:02"
            },
            {
                "comment_body": "Hey, DM'd you :)",
                "comment_author": "dtek_01",
                "comment_score": 1,
                "comment_created_utc": 1721326380.0,
                "comment_created_dt": "2024-07-18 14:13:00"
            },
            {
                "comment_body": "Trunk tools is the name!",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 1,
                "comment_created_utc": 1721768902.0,
                "comment_created_dt": "2024-07-23 17:08:22"
            },
            {
                "comment_body": "Hi dtek\\_0, can I also get a DM of this tool from this 6 month old thread? lol",
                "comment_author": "keeper642",
                "comment_score": 1,
                "comment_created_utc": 1721393843.0,
                "comment_created_dt": "2024-07-19 08:57:23"
            },
            {
                "comment_body": "Can I get it too please and thank you",
                "comment_author": "Nerdy_Viking86",
                "comment_score": 1,
                "comment_created_utc": 1731375152.0,
                "comment_created_dt": "2024-11-11 20:32:32"
            },
            {
                "comment_body": "Trunk tools is the name!",
                "comment_author": "Distinct-Chemist-495",
                "comment_score": 1,
                "comment_created_utc": 1721768946.0,
                "comment_created_dt": "2024-07-23 17:09:06"
            },
            {
                "comment_body": "Hey sure, DMing you :)",
                "comment_author": "dtek_01",
                "comment_score": 1,
                "comment_created_utc": 1721853465.0,
                "comment_created_dt": "2024-07-24 16:37:45"
            }
        ]
    },
    {
        "title": "How will AI affect our jobs/industry?",
        "selftext": "N/A",
        "url": "https://www.reddit.com/r/Revit/comments/1cxr32d/how_will_ai_affect_our_jobsindustry/",
        "score": 9,
        "num_comments": 40,
        "created_utc": 1716349739.0,
        "created_dt": "2024-05-21 23:48:59",
        "author": "superluminal",
        "subreddit": "Revit",
        "comments": [
            {
                "comment_body": "\"AI will not replace your job, the person who uses AI will.\" - Can \"Not\" Remember",
                "comment_author": "N/A",
                "comment_score": 32,
                "comment_created_utc": 1716351166.0,
                "comment_created_dt": "2024-05-22 00:12:46"
            },
            {
                "comment_body": "Unless AI companies are willing to take on the liabilities that come with incorrect/inaccurate drawings, there will always be a human involved\n\nAI, if used properly, will speed up processes and be a tool for architects/engineers, but will never replace them",
                "comment_author": "thisendup76",
                "comment_score": 50,
                "comment_created_utc": 1716351624.0,
                "comment_created_dt": "2024-05-22 00:20:24"
            },
            {
                "comment_body": "I'm moreconcerned about the cost. Autodesk charge me $4000.AUD ( $2700 US) Annually for subscription.\nHow much will the AI cost be.?",
                "comment_author": "Spaceninjawithlasers",
                "comment_score": 17,
                "comment_created_utc": 1716353449.0,
                "comment_created_dt": "2024-05-22 00:50:49"
            },
            {
                "comment_body": "Currently AI can’t write Dynamo code, it keeps trying to produce Python and Python needs specific integration with Revit to work.\n\nRevit isn’t common enough at the moment for Large Language Models (what most people mean by AI) to work and is too close to similar but not quite the same to work for some time.",
                "comment_author": "Psimo-",
                "comment_score": 10,
                "comment_created_utc": 1716359092.0,
                "comment_created_dt": "2024-05-22 02:24:52"
            },
            {
                "comment_body": "I don't think it's going to have much impact at all, honestly.\n\nMost of architecture is compliance work, and given the arbitrary, balkanized nature of building permit approvals,  it is impossible to create a set of drawings which would pass muster across multiple jurisdictions. (I'd even argue it's impossible to create a set that passes muster within the same building permit department, given how arbitrary their replies are). This also means that today's LLM approach to \"AI\" won't work for architecture, because in effect it is not possible to learn from past jobs. The code reviewers will make something up, every time, and that means a human has to figure out the idiosyncratic sacrifice this particular code reviewer wants.\n\nDesign might be more automated - we can already do that now, using grasshopper, dynamo, etc - but design is like 10-15% of a project's work.\n\nThe only way I see this dynamic changing is if the whole AEC process becomes automated - automatic building review, automatic shop drawings, automatic contractor workflows, etc - and we are many, many years away from that. I don't think that building reviews will ever become automated because local jurisdictions love their autonomy.\n\nSo yeah, as with most things \"AI\" right now, I think it's a bunch of hype for architecture.",
                "comment_author": "albacore_futures",
                "comment_score": 7,
                "comment_created_utc": 1716388251.0,
                "comment_created_dt": "2024-05-22 10:30:51"
            },
            {
                "comment_body": "I think we will eventually be able to input local building codes into Revit and have it spit out building options, interior designs, and renderings. It will be able to give options based on cost to optimize the site. I think it will be used more in concept design at the beginning and slowly roll into detailed design. I don't think it will take away every job but it will be a big change, like when we went from 2D to 3D drafting.",
                "comment_author": "appabooka",
                "comment_score": 3,
                "comment_created_utc": 1716375603.0,
                "comment_created_dt": "2024-05-22 07:00:03"
            },
            {
                "comment_body": "I think it will basically automate the \"middle 60%\" for projects.",
                "comment_author": "tiny10boy",
                "comment_score": 2,
                "comment_created_utc": 1716387316.0,
                "comment_created_dt": "2024-05-22 10:15:16"
            },
            {
                "comment_body": "Even if will not take the part of a human, it will drastically diminish the cost, so no more possibility to have many employees and either many firms in a certain area! ",
                "comment_author": "MeanCat4",
                "comment_score": 1,
                "comment_created_utc": 1716369011.0,
                "comment_created_dt": "2024-05-22 05:10:11"
            },
            {
                "comment_body": "Does anyone have any day to day uses for AI within Revit?",
                "comment_author": "BigBeerdPE",
                "comment_score": 1,
                "comment_created_utc": 1716410455.0,
                "comment_created_dt": "2024-05-22 16:40:55"
            },
            {
                "comment_body": "Short term, I don't see much affecting me or my crew.  A few years past that, it might be able to displace the low level modelers that are still employed because it's cheaper to keep them then pay a year of unemployment and start hiring again.  10+ years?  I agree it will replace the bulk grunt work and mundane work in modeling and integration.  There will be more unemployed people due to AI.  The scary part will be when potential clients can log on to \"Design your Dream Home .com\" and bring a set of plans straight to a contractor and engineer.",
                "comment_author": "Truxxis",
                "comment_score": 1,
                "comment_created_utc": 1716422009.0,
                "comment_created_dt": "2024-05-22 19:53:29"
            },
            {
                "comment_body": "Cynical interpretation - it will involve far more subscription services bolted onto the main software we are using. AI for checking compliance with certain regs, AI for populating visuals with furniture etc.  \nAnd you can be fairly confident that these places will all want to charge monthly fees (probably on a range of tiers), rather than offering an option to pay a sensible amount on a per-use basis.\n\nI'm really sick of this monthly fee approach for stuff that you only access occasionally. When you need it you need it, but if you only use it once every few months, you really don't want to be paying a monthly fee when you aren't using it. Particularly in small practices with a varied workload, you often have scenarios like this - you may be doing bigger projects that need a written spec only every couple of years for instance (on smaller projects you can re-use a previous one with minor changes). There are plenty more examples like this. It even applies to bigger bits of software - your firm may only use Photoshop or whatever occasionally for instance. Subscription ought to have made that easier, but has mostly done the opposite - no longer can you rely on the old copy from 5 years ago (which was fine as you didn't need the more cent features and it had by then paid for itself), instead you have to pay even when not using it.\n\nI fully understand why companies selling stuff love this approach - but I find it frustrating how easily it has taken over things (not just in Architecture) with minimal pushback.\n\n  \nOTOH, places where I can see AI being really helpful is for querying certain scenarios and getting back summarised information from a variety of sources (and with references to the primary sources). e.g. \"If we are using contract X and the MEP consultant dies during construction, what are the implications of directly appointing another consultant at that stage to complete their work\" which might bring up relevant legal cases or \"taking into account all relevant regulations regulations, what are the requirements for the single common stair in an apartment building serving 4 floors that continues down into an underground car park\" which would bring together disability, staircase and fire regulations etc to give you an exact list of the minimum requirements.",
                "comment_author": "mat8iou",
                "comment_score": 1,
                "comment_created_utc": 1716514475.0,
                "comment_created_dt": "2024-05-23 21:34:35"
            },
            {
                "comment_body": "It will reduce the number of available jobs as people become more productive with AI tools, just like CAD software drastically reduced the number of drafters in past decades.",
                "comment_author": "Certain_Swordfish_69",
                "comment_score": 0,
                "comment_created_utc": 1716413943.0,
                "comment_created_dt": "2024-05-22 17:39:03"
            },
            {
                "comment_body": "Where i think AI will affect the industry based on everything you said. It will help take down a lot of the heavy lifting a project needs. This will reduce the amount of drafting time needed. The issue is less entry level positions are required.",
                "comment_author": "G_Affect",
                "comment_score": 9,
                "comment_created_utc": 1716352633.0,
                "comment_created_dt": "2024-05-22 00:37:13"
            },
            {
                "comment_body": "Yeah, but ok principal Architect is ok, he might have someone below him to manage the AI but if I could automate the BS drafting... \n\nAI, room tag numbers on every room, every door and window. Make sure each window is associated to the closest level from its base. Roof plan- put drains in the most efficient places - model flat roof 1/4\" per ft. Tag walls like this in building sections. W1 Exterior finish see elevation keynote, 1x wd vert furring, weather barrier.... W2....\n\nOur firm could (it's not my goal) trade 25% of the staff for an AI.",
                "comment_author": "TylerHobbit",
                "comment_score": 5,
                "comment_created_utc": 1716352574.0,
                "comment_created_dt": "2024-05-22 00:36:14"
            },
            {
                "comment_body": "Given how much Autodesk ignores updates and features necessary to make a competent product, chances are that Autodesk University will be all about how amazing the technology is, but then never deliver. \n\nWouldn't be surprised if a startup starts to displace Revit, or, more likely, will be bought up by Autodesk to rot (like Revit)",
                "comment_author": "seeasea",
                "comment_score": 10,
                "comment_created_utc": 1716415880.0,
                "comment_created_dt": "2024-05-22 18:11:20"
            },
            {
                "comment_body": "Cheaper than an additional new hire.\n\nAI is just a tool, but it will be built to make go faster. If the user does garbage work it will magnify that, if it’s good work, it will magnify the good work output.",
                "comment_author": "einstein-314",
                "comment_score": 6,
                "comment_created_utc": 1716362511.0,
                "comment_created_dt": "2024-05-22 03:21:51"
            },
            {
                "comment_body": "I've had success using GPT to write Python to drop into Dynamo\n\nIt never works first time, but if you feed it back the error messages, or feed it a Python script that is close already, you can usually get it to work\n\nIt will sometimes go into a loop and you have to just start a new chat and try again, but it does work",
                "comment_author": "thisendup76",
                "comment_score": 2,
                "comment_created_utc": 1716429417.0,
                "comment_created_dt": "2024-05-22 21:56:57"
            },
            {
                "comment_body": "I would bet that Autodesk is using every B360 project to train an AI.",
                "comment_author": "corinoco",
                "comment_score": 2,
                "comment_created_utc": 1716454773.0,
                "comment_created_dt": "2024-05-23 04:59:33"
            },
            {
                "comment_body": "How ironic the especially annoying code reviewers may actually be saving our jobs.",
                "comment_author": "zerton",
                "comment_score": 3,
                "comment_created_utc": 1716422240.0,
                "comment_created_dt": "2024-05-22 19:57:20"
            },
            {
                "comment_body": "[deleted]",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1716398637.0,
                "comment_created_dt": "2024-05-22 13:23:57"
            },
            {
                "comment_body": "I use chat to help make parameter formulas when making families or sometimes to ask it how to do things in Revit when I forget, I find it mostly does a good job. I also use it to condense specification into smaller sentences notations on sheets, sometimes I give it images of my drawings to see if there are any improvements that can be made in terms of presentation.",
                "comment_author": "Suspicious-Secret-84",
                "comment_score": 3,
                "comment_created_utc": 1716474839.0,
                "comment_created_dt": "2024-05-23 10:33:59"
            },
            {
                "comment_body": "Right. It'll be a tool that, when properly used, would save on hours.\n\nAI that sells itself as a \"replace architect/engineer and design for you\" will never work IMO unless they also take on the liabilities that come with being an architect/engineer\n\nAnd I don't think AI will replace 25% of staff, I think the focus for that 25% shift from man power for mundane drafting to man power for management/oversight of more projects, man power for higher LOD, etc etc",
                "comment_author": "thisendup76",
                "comment_score": 6,
                "comment_created_utc": 1716353023.0,
                "comment_created_dt": "2024-05-22 00:43:43"
            },
            {
                "comment_body": "Who does QA for the ai production? Principal arch/engineer definitely isn't...",
                "comment_author": "EYNLLIB",
                "comment_score": 2,
                "comment_created_utc": 1716431447.0,
                "comment_created_dt": "2024-05-22 22:30:47"
            },
            {
                "comment_body": "That “make each window associated from the closest level at the base” would be game changing… it’s such a PITA to adjust things after when you don’t realize until after, or copy a window up and it maintains the previous reference level",
                "comment_author": "TalaHusky",
                "comment_score": 1,
                "comment_created_utc": 1716419207.0,
                "comment_created_dt": "2024-05-22 19:06:47"
            },
            {
                "comment_body": "It will be good at some point. I can knly imagine the garbage produced in the meantime.",
                "comment_author": "Spaceninjawithlasers",
                "comment_score": 3,
                "comment_created_utc": 1716366069.0,
                "comment_created_dt": "2024-05-22 04:21:09"
            },
            {
                "comment_body": "I speak from years of experience doing architecture across multiple building types and jurisdictions. Design is a minimal % of the work. I've never seen a project schedule that gave as much time to SD and pre-SD as it did to CDs.\n\nI don't know if AI is only useful for design. My point is that AI can't be used for full documentation (CDs) because the code reviewer will want something different, every time. So sure, the AI could generate say typical details - something everybody using Revit should already be doing - but beyond that, it's going to require a human knowing what the other human is idiosyncratically requiring. That is something LLMs can't process well, because each case is an outlier.",
                "comment_author": "albacore_futures",
                "comment_score": 2,
                "comment_created_utc": 1716404333.0,
                "comment_created_dt": "2024-05-22 14:58:53"
            },
            {
                "comment_body": "That market is already filled with drafters working for plan-selling companies. That demographic is more likely to be fully replaced by AI. \n\nHaving AI that can help with code and construction integration would be amazing. \n\nI do worry that it will end up extending beyond that for a significant market share though.",
                "comment_author": "PostPostModernism",
                "comment_score": 1,
                "comment_created_utc": 1716425681.0,
                "comment_created_dt": "2024-05-22 20:54:41"
            }
        ]
    },
    {
        "title": "Will AI replace architects?",
        "selftext": "I’m a high school student and I plan to study architecture , but many people tell me that architecture is not useful in the future because it will be replaced by AI , and they tell me to study something that will be in the future , computer science, petroleum engineering, marketing...but I really aspire and want to study architecture. It is a childhood dream. \nPls give some advice?\nShould I choose another major???",
        "url": "https://www.reddit.com/r/architecture/comments/17xmxnb/will_ai_replace_architects/",
        "score": 0,
        "num_comments": 34,
        "created_utc": 1700249364.0,
        "created_dt": "2023-11-17 14:29:24",
        "author": "FuzzyMinute7857",
        "subreddit": "architecture",
        "comments": [
            {
                "comment_body": "By the time Architects are replaced by AI, we’re going to have a lot of way bigger fish to fry.\n\nHow long do you think it’d take someone to trust living in a building made entirely by AI? End of the day, someone has to stamp the drawings, and I highly *highly* doubt that’s ever going anywhere, someones gotta be liable for failures and it’s never gonna be the ML companies.\n\nBeyond that, architects work with contractors and clients alike, things happen on construction sites, mistakes, unexpected issues etc.  \n\nGraphic design and to some degree Architectural visualization is toast though lol",
                "comment_author": "InpenXb1",
                "comment_score": 12,
                "comment_created_utc": 1700255965.0,
                "comment_created_dt": "2023-11-17 16:19:25"
            },
            {
                "comment_body": "When AI replace architects about everything will be replaced. We are looking at something like a intelligent agi. Hard to feed all the parameters to current AI to get a good training set or usefull result. Like 3dprinting and container houses, it only solves the simple problems.",
                "comment_author": "Grylf",
                "comment_score": 8,
                "comment_created_utc": 1700257389.0,
                "comment_created_dt": "2023-11-17 16:43:09"
            },
            {
                "comment_body": "Nope, you need that stamp/license (LAW) in most states and construction administration to be on site and oversee. Those people don’t know what they’re talking about, graphic designers are screwed though",
                "comment_author": "Ok-Atmosphere-6272",
                "comment_score": 9,
                "comment_created_utc": 1700251894.0,
                "comment_created_dt": "2023-11-17 15:11:34"
            },
            {
                "comment_body": "No, it won't.  Architecture is a blend of art and science.  Certain tasks may become AI-assisted, but the profession has significant health, safety and welfare responsibilities, so as long as lawyers exist, AI isn't taking over.  From the artistic side, no AI will ever produce anything as compelling as the Pantheon, Parthenon, Notre Dame, Villa Savoye, Fallingwater or the Guggenheim (or insert any architectural masterpiece of the last 2500 years).",
                "comment_author": "Sthrax",
                "comment_score": 15,
                "comment_created_utc": 1700250429.0,
                "comment_created_dt": "2023-11-17 14:47:09"
            },
            {
                "comment_body": "no, i dont think so..  AI its just another tool, architechts and designers will use more in the near future to accomplish even more complicated projects...",
                "comment_author": "poncemen",
                "comment_score": 6,
                "comment_created_utc": 1700251007.0,
                "comment_created_dt": "2023-11-17 14:56:47"
            },
            {
                "comment_body": "AI will take over computer science long before it takes over architecture. But don't do architecture as an alternative to something else. Do it because you can't imagine doing anything else.",
                "comment_author": "Qualabel",
                "comment_score": 3,
                "comment_created_utc": 1700254634.0,
                "comment_created_dt": "2023-11-17 15:57:14"
            },
            {
                "comment_body": "An AI will absolutly be a tool in an architects future tool box. But it will not replace one. An architects job is mostly human interaction. An AI will never handle a town hall meeting or a big design charette. It will take really good notes. Now to answer your question. Unless you are a person really pulled in the direction of building/inventing etc and just handle  really hard long hours and being constantly under valued. Then by all means architecture is for you. If you are smart enough to get a degree in architecture you are also someone who can do anything else... and alot of anything else pays better. Seriously tho. Architects are the sexiest.",
                "comment_author": "PNW_pluviophile",
                "comment_score": 3,
                "comment_created_utc": 1700261039.0,
                "comment_created_dt": "2023-11-17 17:43:59"
            },
            {
                "comment_body": "So-called AI is essentially automation software. If your job is to draft/model and simply solve problems of fit and dimension, your days are numbered. No software is any closer to design than a car is to being truly driverless.\n\nI heard the same stuff twice before: when CAD took off, and then when BIM took off. I still have a job. Many things I do have changed. Not all. I still design.",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700254380.0,
                "comment_created_dt": "2023-11-17 15:53:00"
            },
            {
                "comment_body": "Not likely. There are AI scripts to generate floor plans, and given enough time it is feasible to make one that could make full sets. But the issue is it’s not going to matter. Architectural plan sets are ever evolving in ways that AI won’t accelerate in any meaningful way. You’re better off just paying an intern to do the changes then AI. Beyond that the people who’d “utilize” AI are older owners who can’t even learn Revit because they don’t have the time in between running the business, doing pre design etc. they’ll always need architects to do the actual work AI will at best enhance our work, or be utterly meaningless in the grand scheme of things.\n\nI don’t need people going like “this is the worst it’ll ever be” I don’t care AI is largely pointless in so many applications. Anyone who is like “oh AI will replace you.” Doesn’t understand that basic automation will replace most jobs anyways. Don’t need AI to do this.",
                "comment_author": "Rockergage",
                "comment_score": 2,
                "comment_created_utc": 1700279099.0,
                "comment_created_dt": "2023-11-17 22:44:59"
            },
            {
                "comment_body": "AI can already design a good looking building.\n\nRather than replacing architects that AI is a design tool that can churn out concept design options for a project swiftly.  But it can't actually do the project. The concept design that an AI can already do are already the smallest part of architects jobs. And that AI needs input in order to create a concept, the architect refines the concept for the client.\n\nThe other options.... computer science, petro engineering...  If in the future AI has the capacity to fully replace architecture, how could it not already have replaced comp sci? How could it not have replaced petro-engineering, and lets not even get started on what kind of backwards person thinks that petro-engineering is the field to get into while climate change is our biggest problem and the move to electric vehicles is accelerating. \n\nWhen/if AI completely replaces architecture then what other professional jobs will it not be able to replace? What job would anyone in the world have? Study architecture, either you'll be working with AI tools in the future, or you'll be unemployed the same as every single other person in the world.",
                "comment_author": "Theranos_Shill",
                "comment_score": 2,
                "comment_created_utc": 1700343952.0,
                "comment_created_dt": "2023-11-18 16:45:52"
            },
            {
                "comment_body": "I am not a professional but I would personally never want to live in a house designed by AI. If a day arises when all architects could be feasibly replaced by AI, most other career fields would probably be long gone too. That day would be a catastrophic day.\n\nI wouldn't really worry about it, considering there's not much you could do to prepare anyways. You would be at risk no matter which career you choose. At most, AI might be utilized to automate some very specific tasks. It won't replace highly educated professionals such as architects in a long time.",
                "comment_author": "ovaru",
                "comment_score": 2,
                "comment_created_utc": 1721397286.0,
                "comment_created_dt": "2024-07-19 09:54:46"
            },
            {
                "comment_body": "AI (now) can do everything except creative thinking. We are safe for now.",
                "comment_author": "EfendiAdam-iki",
                "comment_score": 4,
                "comment_created_utc": 1700256024.0,
                "comment_created_dt": "2023-11-17 16:20:24"
            },
            {
                "comment_body": "[removed]",
                "comment_author": "N/A",
                "comment_score": 4,
                "comment_created_utc": 1700250343.0,
                "comment_created_dt": "2023-11-17 14:45:43"
            },
            {
                "comment_body": "Maybe eventually, but I suspect for some time, human architects will need to write and tweak the prompts, audit the results, and even make manual edits to AI architecture.",
                "comment_author": "Will-have-had",
                "comment_score": 1,
                "comment_created_utc": 1700250436.0,
                "comment_created_dt": "2023-11-17 14:47:16"
            },
            {
                "comment_body": "Yes it probably will, anyone that believes otherwise is downplaying the very real risks that AI poses. \n\nRight now, AI does not pose a significant risk and will probably continue to be like this for a long time and is mostly an extremely useful tool that will accelerate processes and will shortly become a must have in your toolbox just like MS Office or CAD software for architects. \n\nHowever, AI can be much more than just making fancy images on Midjourney or drafting plans from prompts or writing anything you want almost instantly. It has the potential to mimic human reasoning, this is a theoretical breakthrough in AI called Artificial General Intelligence. The difference is in the name itself, ChatGPT can write a script but it can't render a movie, an AGI system would be theoretically capable of doing anything a human could, it's capabilites are generalized like us rather than specialized like ChatGPT.\n\nHowever we are still a REALLY long way ahead until we achieve something close to AGI. One might think \"But wouldn't it just mean it's about combining all of these specialized bots into one unified system?\" No. Fundamentally, ChatGPT does not understand a single word, it generates responses based on patterns it identifies by scouring it's training data. It's like training a dog to do a paw-shake, he doesn't know its a human salutation, it just knows that when it does the thing humans tend to get happy and give it treats and it likes treats, same thing. And being able to understand things is fundamental to an AGI system, without it you can't reason or create new patterns, just repeat or rearange them. Also that's disregarding that ChatGPT and Midjourney are completely different things that you can't just \"combine\". \n\nWe're still a long way ahead, and there is still a big if, we don't know if AGI is even possible. It's purely theoretical for now. Some experts say it could take 10-20 years till we get there but it's all pure conjecture, there is also the possibility that there is actually a trick to AGI and someone could just randomly discover it right now somewhere and now pandora's box is open forever, the black swan metaphor.\n\nBut honestly, if AI poses a risk to architecture as a profession, rest assured, there are no \"future proof\" jobs. If you think studying computer science or programming is somehow safer you're dead wrong, programmers will code systems that could replace them, they already are, they're not an entity they're individuals. ChatGPT can already do a LOT of coding and it's not even an AI system designed for coding. So much so that people in programming are having the same discussion and maybe even a bit more distressed than us.\n\nHere's the deal from my POV, we're either entirely fucked, equally or we're good, there's nothing we can do about it, we can't predict it and we probably can't even slow it down, don't let it paralyze you, just do what you want to do.",
                "comment_author": "zyper-51",
                "comment_score": 1,
                "comment_created_utc": 1700259983.0,
                "comment_created_dt": "2023-11-17 17:26:23"
            },
            {
                "comment_body": "Done.",
                "comment_author": "N/A",
                "comment_score": 0,
                "comment_created_utc": 1700272892.0,
                "comment_created_dt": "2023-11-17 21:01:32"
            },
            {
                "comment_body": "Replacement already in progess.   Who does your drafting?  Only a matter of time before the government idiots forcing foreign work credentials to be accepted by associations will lead to them running the entire office out of another country.  Including the guy with the stamp.",
                "comment_author": "dendron01",
                "comment_score": -2,
                "comment_created_utc": 1700261220.0,
                "comment_created_dt": "2023-11-17 17:47:00"
            },
            {
                "comment_body": "The job requirement  in architecture and construction business would not be the same as the current ones by the time you search for breadwinning jobs. Make sure the education you will pursue will meet the job requirement that is in demand in 5 to 10 years of the future when you look for an entry level position. \nFinance used to be the domain that business and econ. Majors were going into up until early 2000. Just about a few years ago computer science and applied maths backgrounds graduates took over the positions quite significantly. Now many are competing with automated systems.\nI am pretty sure SI companies are already preparing for AI integrated solutions for building constructions in many domains and can see some governments are already doing POCs.",
                "comment_author": "Efficient-Credit774",
                "comment_score": 1,
                "comment_created_utc": 1702093347.0,
                "comment_created_dt": "2023-12-08 22:42:27"
            },
            {
                "comment_body": "AI doesnt need to replace anything, AEC industry is already rotten, and architects are already made themselves obsolete",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1709044429.0,
                "comment_created_dt": "2024-02-27 09:33:49"
            },
            {
                "comment_body": "It's not necessarily a question of whether AI will replace ALL architects, but rather 'How many?'. If future architects can 10x the productivity of current ones, that will mean a dramatic reduction in the workforce.",
                "comment_author": "oltieri",
                "comment_score": 1,
                "comment_created_utc": 1715029757.0,
                "comment_created_dt": "2024-05-06 17:09:17"
            },
            {
                "comment_body": "I know this is an old post, but this right here is what a lot of people are missing. I think AI will make actual architects much more stable of a profession choice. Instead of having to hire a small army of draftsmen and support staff that eat away at your bottom line, it allows architects to lessen the worst part of architecture which is the tedious time consuming aspects that detract from what your license is actually for.",
                "comment_author": "Ok_Tailor_8615",
                "comment_score": 2,
                "comment_created_utc": 1725990909.0,
                "comment_created_dt": "2024-09-10 13:55:09"
            },
            {
                "comment_body": "So that’s mean ai can be an assistant to architects?",
                "comment_author": "FuzzyMinute7857",
                "comment_score": 8,
                "comment_created_utc": 1700261856.0,
                "comment_created_dt": "2023-11-17 17:57:36"
            },
            {
                "comment_body": "I seek to study architecture as it is a childhood dream, as I said previously, and I will give all my effort to it compared to another major. I don’t t want to study major that I don’t want or don’t like just because it will be better job in the future or have a higher salary than architecture.",
                "comment_author": "FuzzyMinute7857",
                "comment_score": 5,
                "comment_created_utc": 1700261625.0,
                "comment_created_dt": "2023-11-17 17:53:45"
            },
            {
                "comment_body": "I think about this a lot . I believe we’ll eventually be living in a kind of black mirror episode. Specifically Season 1 episode 2 where people are put into fractions based on their income levels or whatever and the lowest levels jobs are to ride bikes that power the electricity that keeps everything going. Most likely households will have set allowances and assigned ”jobs”. Hopefully we’ll be dead before that takes place but with the way technology is being pushed with no limit…yeah black mirror was spot on",
                "comment_author": "mojovo",
                "comment_score": 2,
                "comment_created_utc": 1708131405.0,
                "comment_created_dt": "2024-02-16 19:56:45"
            },
            {
                "comment_body": "kidding themselves and downvoting your comment. This question produces a \"no\" in every sub dedicated to a profession.",
                "comment_author": "Leefa",
                "comment_score": 3,
                "comment_created_utc": 1700251363.0,
                "comment_created_dt": "2023-11-17 15:02:43"
            },
            {
                "comment_body": "[removed]",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1700261037.0,
                "comment_created_dt": "2023-11-17 17:43:57"
            },
            {
                "comment_body": "lol I’ve worked with plenty of these drafting services and am not slightest bit worried about them completely taking over a project. Also, a local architect will always be needed to understand site and AHJ requirements, like how a famous foreign architect might design a project but the architect of record is always local",
                "comment_author": "SpiritedPixels",
                "comment_score": 2,
                "comment_created_utc": 1700263782.0,
                "comment_created_dt": "2023-11-17 18:29:42"
            },
            {
                "comment_body": "Yep I agree",
                "comment_author": "Ok-Atmosphere-6272",
                "comment_score": 1,
                "comment_created_utc": 1725991784.0,
                "comment_created_dt": "2024-09-10 14:09:44"
            },
            {
                "comment_body": "I mean AI is already used by architects, at least for visualizations and conceptual ideation for projects.",
                "comment_author": "Snoo_72113",
                "comment_score": 3,
                "comment_created_utc": 1716066040.0,
                "comment_created_dt": "2024-05-18 17:00:40"
            },
            {
                "comment_body": "One of us! One of us!",
                "comment_author": "PNW_pluviophile",
                "comment_score": 2,
                "comment_created_utc": 1700262070.0,
                "comment_created_dt": "2023-11-17 18:01:10"
            },
            {
                "comment_body": "[removed]",
                "comment_author": "N/A",
                "comment_score": 6,
                "comment_created_utc": 1700251815.0,
                "comment_created_dt": "2023-11-17 15:10:15"
            },
            {
                "comment_body": "Thanks! AI has been an interest of mine for a number of years now. Lately I've been learning Python to try and get hands on with it eventually.\n\nHowever, assuming ASI or AGI, is an enforcement by the government really feasible? Like how do you quantify how many people an AGI has replaced in a particular business when its work output is so superior? And eventually what I think would happen is that business owners would only have humans work on menial tasks that don't actually contribute to anything so they don't bottleneck the AI's workflow. But even that is a lie because at some point the manager/owner would become the bottleneck. Wouldn't a better approach be to just (as idealistic as it sounds) to just throw capitalism out the window at that point?\n\nIf you can have a machine that can do all the work uncountably more efficiently including taking care of itself and making more of itself to suit whatever task it needs to fulfill, I mean why pretend like we're doing something at that point, sounds like the end-game for human technological progress. I think this is definitely the most optimistic outcome as there are end-of the world scenarios for the more pessimistic I suppose. \n\nWhat do you think?",
                "comment_author": "zyper-51",
                "comment_score": 1,
                "comment_created_utc": 1700268894.0,
                "comment_created_dt": "2023-11-17 19:54:54"
            },
            {
                "comment_body": "Times are changing fast bud...and not in a way you're gonna like...",
                "comment_author": "dendron01",
                "comment_score": 1,
                "comment_created_utc": 1700435872.0,
                "comment_created_dt": "2023-11-19 18:17:52"
            },
            {
                "comment_body": "There are plenty of parallels to draw with the evolution of professional roles.\n\nSailors have gone from knowing sails to combustion engines. Pilots have gone from crews of four to two with high levels of automation.\n\nChange is definitely coming. There will be hybrids and then there will be new careers that arise (renewable energy technicians being something unimaginable 100 years ago).\n\nPeople just need to do what humans do best of any species - adapt.",
                "comment_author": "Capitan_Scythe",
                "comment_score": 1,
                "comment_created_utc": 1700257448.0,
                "comment_created_dt": "2023-11-17 16:44:08"
            },
            {
                "comment_body": "This isn’t a very convincing response, if you want to shout the sky is falling go for it\n\nUntil these cheaper outsourced services can design better, coordinate better, and understand local codes at least to the same level as a local architect, I’m not worried. Could that happen someday with AI and technology? Maybe, but from  what i’ve seen these drafting services are just that, drafting, and so much more is required to complete a project",
                "comment_author": "SpiritedPixels",
                "comment_score": 1,
                "comment_created_utc": 1700437774.0,
                "comment_created_dt": "2023-11-19 18:49:34"
            },
            {
                "comment_body": "far far more careers will be eliminated than created. the new jobs will be taken by AI more readily than the old ones. this is the nature of exponents.",
                "comment_author": "Leefa",
                "comment_score": 0,
                "comment_created_utc": 1700292201.0,
                "comment_created_dt": "2023-11-18 02:23:21"
            }
        ]
    },
    {
        "title": "Automation and its effect",
        "selftext": "I am currently reading a new book called Rule of the Robots. It talks about how AI will transform everything. The good and the bad. What are your thoughts on how this will effect estimating and construction management in general?",
        "url": "https://www.reddit.com/r/estimators/comments/1067xq1/automation_and_its_effect/",
        "score": 9,
        "num_comments": 27,
        "created_utc": 1673147011.0,
        "created_dt": "2023-01-07 22:03:31",
        "author": "Gon_jalt",
        "subreddit": "estimators",
        "comments": [
            {
                "comment_body": "I think we like to pretend that construction will be impossible to automate because there are so many variables, but ultimately it's just a matter of accurately capturing and applying the data. When we get to the point that a machine learning process has processed and can reference data from tens or hundreds of thousands of projects, it seems to me it'd be pretty obvious that it'd be better than a human at 99% of estimation. Are we there yet? No. But we're not too far away mo.",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 9,
                "comment_created_utc": 1673156890.0,
                "comment_created_dt": "2023-01-08 00:48:10"
            },
            {
                "comment_body": "Until clients are willing to spend the money upfront to\nProduce decent specs and drawings with minimal\nHoles to no holes I think this is a way off.\n\nI mean electrically we’re there now with auto\nTake offs and pricing and they are wrong most of the time with differences between specs / drawings and just plain crap drawings.",
                "comment_author": "Traditional_Earth149",
                "comment_score": 7,
                "comment_created_utc": 1673163217.0,
                "comment_created_dt": "2023-01-08 02:33:37"
            },
            {
                "comment_body": "More and more engineers are sharing electronic documents that make takeoffs easier. AI in my opinion will never completely replace an intuitive analysis of AI generated information. \n\nI’m biding a job where pipe is getting installed at the bottom of a wet basin and the nearest intersection that is intended to be drained by this storm system will be constantly flooded due to fluid mechanics. Long story short standing water in wet basin is elevation 105. Top of curb at intersection is elevation 104.  Water seeks a uniform elevation. \n\nI doubt AI could pick that issue up.",
                "comment_author": "Floyd-fan",
                "comment_score": 3,
                "comment_created_utc": 1673182550.0,
                "comment_created_dt": "2023-01-08 07:55:50"
            },
            {
                "comment_body": "I think the first thing AI will assist with is interpreting data from schedules (equipment, door, windows, hardware, etc.) and formatting them into an excel compatible list. So much time is consumed by just doing data entry for schedules that it's a no brainer value proposition to have human supervised softwafe for it.\n\nThe hardest part to construction AI adoption is the crazy high inertia in nearly every construction firm I know. These guys are usually very resistant to any kind of change so persuading them to get new software is tricky.",
                "comment_author": "SlangFreak",
                "comment_score": 2,
                "comment_created_utc": 1673179607.0,
                "comment_created_dt": "2023-01-08 07:06:47"
            },
            {
                "comment_body": "I think it will effect vendors the most.  Start cutting out middlemen and sales people.  Why cant I just chose what I need from the manufacturer online for pricing.  I'm already seeing it start",
                "comment_author": "randazz18",
                "comment_score": 2,
                "comment_created_utc": 1673192009.0,
                "comment_created_dt": "2023-01-08 10:33:29"
            },
            {
                "comment_body": "AI will never decipher the nonsense architects send out, not concerned at all on the estimating front. Humans can't even figure out what an architect wants so I don't see how a human will design an AI that actually can.\n\nIt'll be big in manufacturing though. It's the next step after CNC automation",
                "comment_author": "OK_Opinions",
                "comment_score": 2,
                "comment_created_utc": 1673265047.0,
                "comment_created_dt": "2023-01-09 06:50:47"
            },
            {
                "comment_body": "I think for electrical it’s possible but won’t be soon. The current auto count software has improved over the last 10 years but it’s far from machine learning. I have to tell it what symbols to count, then verify it counted the correct symbols, and all of them. It only does quantity take off, it can’t do circuiting. And if the drawings are crowded, shaded weird, or not on a square plan the program isn’t reliable. It’s also just counts— I still have to input what materials we’re using per spec and code.",
                "comment_author": "PancakesAlways",
                "comment_score": 1,
                "comment_created_utc": 1673192716.0,
                "comment_created_dt": "2023-01-08 10:45:16"
            },
            {
                "comment_body": "I think the effect of AI is generally overstated in the short term over next 5 years but understated over the next 25 years.  I see areas where automation can be added to my job as an estimator but it would more modify what I do rather than eliminate what I do.",
                "comment_author": "Learningontheclock",
                "comment_score": 1,
                "comment_created_utc": 1673719211.0,
                "comment_created_dt": "2023-01-14 13:00:11"
            },
            {
                "comment_body": "I’ve ran across way too many sets of drawings with unknown variables. Idk. Think boilerplate specs, missing specs, difference in specs and drawings, things actually not on the drawings at all but you know from experience they need to be added to your takeoff, etc. \n\nI’m sure it’ll occur at some point I’m just not sure it’s something that will be super reliable. Maybe I’m wrong though.",
                "comment_author": "HereForGunTalk",
                "comment_score": 6,
                "comment_created_utc": 1673157385.0,
                "comment_created_dt": "2023-01-08 00:56:25"
            },
            {
                "comment_body": "This implies that plans/specs make sense and are complete and coordinated…. Which they never are. \n\nAI’s time would be better spent automating architecture.",
                "comment_author": "martincline",
                "comment_score": 3,
                "comment_created_utc": 1673199257.0,
                "comment_created_dt": "2023-01-08 12:34:17"
            },
            {
                "comment_body": "AI would be able to pick up whatever issue it’s coded to pick up.\n\nEventually it will just be robots bidding to robots with a few humans there to review things make sense.",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1673183211.0,
                "comment_created_dt": "2023-01-08 08:06:51"
            },
            {
                "comment_body": "For door, equipment, room matrix schedules I’m able to export them directly from the PDF using Bluebeam to an excel sheet. It’s a huge time saver and works the majority of the time as long as the drawing are formatted correctly. Maybe you already knew that but wanted to throw it out because it helps me out a lot.",
                "comment_author": "johnnyhopkins1515",
                "comment_score": 2,
                "comment_created_utc": 1673191105.0,
                "comment_created_dt": "2023-01-08 10:18:25"
            },
            {
                "comment_body": "That is what I am thinking as well.\n\nI think it will end up being more like self checkout at Walmart, where the AI does the majority of the work and the humans are there for the exceptions and to review the estimates or at least sanity check the estimates.",
                "comment_author": "Unlikely_Track_5154",
                "comment_score": 1,
                "comment_created_utc": 1691060992.0,
                "comment_created_dt": "2023-08-03 07:09:52"
            },
            {
                "comment_body": "Sure, but the whole point is that computers are pretty much always better at complex problem solving than people if given the right information. Say you've got all the data from drawings *and* all the data from change orders and RFIs that resulted from them. A machine learning program could ostensibly identify similar projects and specifications and identify gaps better than a person.\n\nI think we're a long way off from estimation without human oversight, but automation will probably start replacing some estimating jobs in the next 10 years. There's not some unimaginable technology leap required. I think eventually you absolutely will have fully automated estimating, it's just a question of how long it takes.",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 6,
                "comment_created_utc": 1673168158.0,
                "comment_created_dt": "2023-01-08 03:55:58"
            },
            {
                "comment_body": "I’m in agreement on this. Being able to determine any human error in assembling the bid package; overlapping specs, missing specs, scale issues, missing plans, etc. Anyone can count and measure, but also there is an art to estimating in the “factors” and how they impact the work. \n\nI think the technology will be there, and some divisions will get damn close to fully utilizing it before others, but let’s stop and think here… To be able to feed a set of plans or a model in to a program to get a complete cost, the entire job would need to be laid out by someone. It would need to be laid out prior to the competitive bid stage, to be specific. In my experience in the electrical division, the drawings have gotten less detailed and complete and the expectation is that the contractor assumes responsibility for delivering a complete and functioning system, regardless of every part and piece is called out. All to say, I don’t think the design firms and engineers will shell out the time and money to fully design some divisions. They don’t want the liability or the up front cost. \n\nYes, I do think someday it will get there, but I think it’s a long way off for some divisions. The trends go where the money flows!",
                "comment_author": "Hamwag0n",
                "comment_score": 1,
                "comment_created_utc": 1673223926.0,
                "comment_created_dt": "2023-01-08 19:25:26"
            },
            {
                "comment_body": "I think that ai will be more like an assistant in that way.\n\nIt will do the 99% of the work, and then the humans will check the estimate and add what needs to be added.",
                "comment_author": "Unlikely_Track_5154",
                "comment_score": 1,
                "comment_created_utc": 1691060646.0,
                "comment_created_dt": "2023-08-03 07:04:06"
            },
            {
                "comment_body": "Well, A) if architecture is automated, that to some extent implies estimating is as well. It's the same data set more or less.\n\nB) Like I said in my other response, if an AI is learning off of change order and RFI data as well, there's no reason it couldn't compare drawings and specs from past projects and identify areas where specs are lacking. If anything, with the right data, an AI should be *better* than a person at identifying problems with the documents and predicting conflict.\n\nLet's say you've got an AI with thousands of projects each with hundreds or thousands of variables. All the minute details of a project. All it'd have to do is identify projects that share those variables, and notable variables that are out of place in the current project. \"Hey, 89% of projects that are 60% similar or more contain this missing spec. 76% of projects 60% similar or more without this spec in original drawings ultimately adopted it via change order.\"\n\nWe're obviously a long way out from perfect data capture, but as technology improves, incentives to improve data capture are higher, until eventually you get to a point where predictive models are better than people at this stuff.\n\nThis is the same refrain people have been saying since we first started using computers. \"X is too complicated a problem, only a person could do it.\" But time and time again, it turns out people on average aren't that great at solving complex problems, and given the right inputs, a computer absolutely is.",
                "comment_author": "dilligaf4lyfe",
                "comment_score": 2,
                "comment_created_utc": 1673201595.0,
                "comment_created_dt": "2023-01-08 13:13:15"
            },
            {
                "comment_body": "Therein lies the rub. Someone has to anticipate that. Point of the comment is every situation being anticipated is highly unlikely. At least not in my lifetime. My opinion.",
                "comment_author": "Floyd-fan",
                "comment_score": 1,
                "comment_created_utc": 1673186497.0,
                "comment_created_dt": "2023-01-08 09:01:37"
            },
            {
                "comment_body": "If we all pay the same subscription to the estimating software...we'll have the same price.\n\nIf it ever gets to where you describe, we won't be bidding based off scope. We'll be bidding solely off of rates, fees, insurance. Potentially maybe bidding off of productivity rates that the AE firm plugs into this software with the Owner. But there will be no need to \"bid\" the material costs as you are describing anyway.",
                "comment_author": "RocktownLeather",
                "comment_score": 1,
                "comment_created_utc": 1673643673.0,
                "comment_created_dt": "2023-01-13 16:01:13"
            },
            {
                "comment_body": "I'm still learning bluebeam, so I didn't. Thanks for the tip, I'll look into it!",
                "comment_author": "SlangFreak",
                "comment_score": 3,
                "comment_created_utc": 1673195059.0,
                "comment_created_dt": "2023-01-08 11:24:19"
            },
            {
                "comment_body": "One of the problems with AI is that the drawings that we estimate from are so bad that as an estimator your job is as much to see what's not in the drawings as it is to see what is there. I don't think AI will be able to fill in those gaps in a meaningful way for the foreseeable future.",
                "comment_author": "Learningontheclock",
                "comment_score": 1,
                "comment_created_utc": 1691179615.0,
                "comment_created_dt": "2023-08-04 16:06:55"
            },
            {
                "comment_body": "It's already happening. I priced a projects where were provided a fully-connected model of the structural steel -- including all bolts, welds, and hardware. So there was zero take-off, we could basically export and start calculating costs. And didn't need to use our connection assumptions / calculators. \n\nThere was still some attributing work in the model so we could identify and categorize it how we wanted, of course.",
                "comment_author": "jonny24eh",
                "comment_score": 1,
                "comment_created_utc": 1673191232.0,
                "comment_created_dt": "2023-01-08 10:20:32"
            },
            {
                "comment_body": "Exactly. In commercial paint I can’t tell you how many times there were coating conflicts where the finish schedule said one thing and the specs another and I have to call or email the GC and then they have to call the architect and the architect has to call a meeting with the owner. If everything were black and white I’d agree we’d be screwed.",
                "comment_author": "HereForGunTalk",
                "comment_score": 1,
                "comment_created_utc": 1673225539.0,
                "comment_created_dt": "2023-01-08 19:52:19"
            },
            {
                "comment_body": "Your point was that the future can’t be predicted perfectly? Who would have thought",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1673187171.0,
                "comment_created_dt": "2023-01-08 09:12:51"
            },
            {
                "comment_body": "Agree to disagree 🤷‍♂️",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1673652557.0,
                "comment_created_dt": "2023-01-13 18:29:17"
            },
            {
                "comment_body": "Thank you Capt Obvious. The point is humans will still be programming and unless they can pick it up to tell the system to look for it regardless of AI learning situations these types of things will occur. BIM still has major issues.",
                "comment_author": "Floyd-fan",
                "comment_score": 1,
                "comment_created_utc": 1673264613.0,
                "comment_created_dt": "2023-01-09 06:43:33"
            },
            {
                "comment_body": "Yea I already said that above but without so many words",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1673266229.0,
                "comment_created_dt": "2023-01-09 07:10:29"
            }
        ]
    }
]