[
    {
        "title": "Best Gaming Laptop of 2024 So Far...",
        "selftext": " \n\nI'm currently on the hunt for the ultimate gaming laptop of 2024. I'm interested in what is currently available or coming soon on the market, and I'm seeking anyone's collective wisdom and expertise.\n\nI'm fortunate to not have a budget constraint, so I'm open to exploring all options, from the top-of-the-line models to any hidden gems that might have emerged in the gaming laptop market recently.\n\nMy main priorities revolve around top-notch performance, cutting-edge graphics capabilities, efficient cooling systems to handle intense gaming sessions, and any innovative features that might enhance the gaming experience. Portability is also a factor, as I often find myself gaming on the go.\n\nI'm reaching out to this community because I value diverse perspectives and real-world experiences. So, whether you're a seasoned gamer, a tech enthusiast, or someone with insider knowledge of the latest trends in gaming laptops, I'd love to hear your recommendations, insights, and feedback.\n\nYour thoughts, experiences, and recommendations are not just valuable, they are crucial in guiding my decision. I truly appreciate your input and look forward to hearing from you.\n\nThank you all in advance for your time and assistance. I'm eagerly looking forward to your responses.",
        "url": "https://www.reddit.com/r/GamingLaptops/comments/1cfmj4f/best_gaming_laptop_of_2024_so_far/",
        "score": 12,
        "num_comments": 12,
        "created_utc": 1714353052.0,
        "created_dt": "2024-04-28 21:10:52",
        "author": "digitaledgz",
        "subreddit": "GamingLaptops",
        "comments": [
            {
                "comment_body": "Im not usually one to say this, but if I were you I would wait a few months for the 50 series cards. Of course new technologies are always emerging, but it would be a shame to spend so much on a top of the line laptop now when the new generation of cards is just round the corner. Nvidia releases a new GPU generation every two years, and previous gen cards are often discounted shortly after the new release. Unless you need a laptop now, buying a laptop in a few months time would allow you to enjoy top of the line performance for the next 2 ish years and would be a much wiser way to spend your money. \n\nIf, however, you decide to purchase a laptop now, all the aforementioned options are excellent, and have their own unique advantages and drawbacks. The 'jarrod's tech' YouTube channel is an excellent resource to research any potential gaming laptop you may be considering, and I couldn't recommend it more highly.\n\nBest of luck with your hunt for a new laptop!",
                "comment_author": "Boring-Shock-2729",
                "comment_score": 5,
                "comment_created_utc": 1714364534.0,
                "comment_created_dt": "2024-04-29 00:22:14"
            },
            {
                "comment_body": "3 best, for different reasons, and in no particular order:\n1. ROG Strix SCAR 17 X3D Gaming Laptop (2023)\nG733PYV-XH97 - 7945HX3D + 4090 is probably the most powerful combo, and I couldn't find any other brand using an X3D chip, 240hz mini led 1440p screen 3800 USD\n2. Titan 18 HX A14VIG-036US 18\" UHD Gaming Laptop - 14900HX + 4090 has a full mechanical keyboard, 120hz 4k mini led screen 5800 USD\n3. Legion 9i Gen 9 Intel (16″) with RTX™ 4090 - 14900HX + 4090 exceptional build quality 165hz 3.2k mini led display 3900 USD",
                "comment_author": "usernamedisallowed",
                "comment_score": 4,
                "comment_created_utc": 1714355977.0,
                "comment_created_dt": "2024-04-28 21:59:37"
            },
            {
                "comment_body": "Honestly I'd also consider waiting for the RTX 50 series mobile GPUs if you can, this year's laptops have no real performance improvements over last year's models, more just a wider availability of miniLED and OLED screens in gaming laptops.",
                "comment_author": "UnionSlavStanRepublk",
                "comment_score": 2,
                "comment_created_utc": 1714373502.0,
                "comment_created_dt": "2024-04-29 02:51:42"
            },
            {
                "comment_body": "Prepare to be disappointed",
                "comment_author": "iNaturalSelection",
                "comment_score": 1,
                "comment_created_utc": 1714357058.0,
                "comment_created_dt": "2024-04-28 22:17:38"
            },
            {
                "comment_body": "Here's my perspective from someone who had been gaming on laptops for over 20 years because I travel for work...  Since you have an unlimited budget, just build a nice desktop PC for maximum performance at home and then buy a nice thin and light Asus Zephyrus for gaming on the road.  Just sync your work via cloud backups so it's on both machines.  This is what I've finally settled on from fighting with overheating and underperforming laptops all these years.  You never get the same performance and the closer you do get, the bigger and heavier the laptop gets. ",
                "comment_author": "Saigudbai",
                "comment_score": 1,
                "comment_created_utc": 1726807404.0,
                "comment_created_dt": "2024-09-20 00:43:24"
            },
            {
                "comment_body": "Thank you for the insights. Maybe it would be best to wait? I dunno. I am actively trying to buy something now, to be honest, but I don't want to shoot myself in the foot, either. I could try looking over Jarrod's Tech YouTube channel and see if that helps give me a better idea of what would be best. Too many options to choose from lol ![img](emote|t5_2x4m3|8582)",
                "comment_author": "digitaledgz",
                "comment_score": 3,
                "comment_created_utc": 1714366127.0,
                "comment_created_dt": "2024-04-29 00:48:47"
            },
            {
                "comment_body": "Should we keep waiting for the new release? lol",
                "comment_author": "mafangulo",
                "comment_score": 1,
                "comment_created_utc": 1729626161.0,
                "comment_created_dt": "2024-10-22 15:42:41"
            },
            {
                "comment_body": "Thank you for these suggestions. Wouldn't the ROG Strix SCAR 2024 model be better? I find it crazy that the Titan 18 is over $5K, but maybe it's worth it. I currently own the Legion 5 Pro 16IAH7H and its been decent, but I am ready to get something really nice and add a monitor to it for gaming and work due to my space not being big enough for a desktop. Appreciate the feedback.",
                "comment_author": "digitaledgz",
                "comment_score": 1,
                "comment_created_utc": 1714365980.0,
                "comment_created_dt": "2024-04-29 00:46:20"
            },
            {
                "comment_body": "hey! i saw your comment and ive been looking  into the asus rog zephyrus g16, i know nothing about specs and ive seen so many mixed reviews. Would you say its worth the buy?",
                "comment_author": "Sa1nt19",
                "comment_score": 1,
                "comment_created_utc": 1728312187.0,
                "comment_created_dt": "2024-10-07 10:43:07"
            },
            {
                "comment_body": "They haven't made an X3D for the 2024 lineup yet, and the 7945HX3D currently outperforms the 14900HX in all metrics, so it's not worth going to the 2024 edition over the 2023. And you're welcome, I had a TITAN a long time ago (dual 980ti), and it was sweet. It's definitely monstrous in size, built it was sturdy, and I never felt like I had to be gentle with it. It was also nice having a full-size keyboard on a laptop was nice.",
                "comment_author": "usernamedisallowed",
                "comment_score": 2,
                "comment_created_utc": 1714369767.0,
                "comment_created_dt": "2024-04-29 01:49:27"
            },
            {
                "comment_body": "Over been looking at the G16 and honestly almost bought one.  My current Zephyrus is 5 years old so it's almost time to replace.  The only thing I'm getting hung up on is the OLED screen.  I know they look amazing, but I'm just concerned about pixel degradation when I run my laptops for so many years.   To answer your question, I do think the G16 is a great choice for a really portable thin and light unit.  I wouldn't buy it if I was trying to get maximum performance or to replace a desktop though, but if you travel with a laptop and still do want gaming and don't care if it's not desktop performance, I think it's great.   I personally would look for one with 32gb ram since it's soldered in, and a 4070, maybe a 4060. ",
                "comment_author": "Saigudbai",
                "comment_score": 1,
                "comment_created_utc": 1728381348.0,
                "comment_created_dt": "2024-10-08 05:55:48"
            },
            {
                "comment_body": "Do you know when the new models are coming out?",
                "comment_author": "digitaledgz",
                "comment_score": 1,
                "comment_created_utc": 1714417737.0,
                "comment_created_dt": "2024-04-29 15:08:57"
            }
        ]
    },
    {
        "title": "Which gaming laptop would you recommend? ",
        "selftext": "1. [ASUS - ROG Zephyrus G14 (2024)](https://www.bestbuy.com/site/asus-rog-zephyrus-g14-2024-14-oled-3k-120hz-gaming-laptop-amd-ryzen-9-8945hs-16gb-lpddr5x-geforce-rtx-4060-1tb-ssd-platinum-white/6570270.p?skuId=6570270) Like the sound quality and OLED screen and keyboard layout. Dislike the diagonal black bar on the back and blinking drive indicator in the middle\n2. [ROG Flow X13 Gaming Laptop (2023)](https://rog.asus.com/us/laptops/rog-flow/rog-flow-x13-2023-series/spec/)\n3. [Lenovo - Legion Pro 5i ](https://www.bestbuy.com/site/lenovo-legion-pro-5i-16-gaming-laptop-wqxga-intel-14th-gen-core-i9-with-16gb-memory-nvidia-geforce-rtx-4060-8gb-1tb-ssd-onyx-grey/6575389.p?skuId=6575389)\n4. [Lenovo - Legion 7i](https://www.bestbuy.com/site/lenovo-legion-7i-16-gaming-laptop-wqxga-intel-14th-gen-core-i7-with-16gb-memory-nvidia-geforce-rtx-4060-8gb-1tb-ssd-glacier-white/6575391.p?skuId=6575391)  Likes the easy tab to lift the laptop open, the good comments others are saying it performs slightly, and dissipates heat better then rog. Dislike the numpad and how the touchpad is more pushed to the left.\n5. [Legion Slim 5 Gen 9](https://www.lenovo.com/us/en/p/laptops/legion-laptops/legion-slim-series-laptops/lenovo-legion-slim-5-gen-9-(16-inch-amd)/len101g0036#tech_specs)\n\nMessed around with the Legion 7i and Rog Zephyrus G14 2024 at Bestbuy demo display, Legion 7i felt pretty hot near top center of the keyboard and Zephyrus G14 2024 didn't feel much heat anywhere on the keyboard surface just slight warmth.\n\nBudget \\~$1.6  \nUse Gaming / Streaming while traveling  \nGames: Nier, Elden Ring, League, Fortnite  \nWatching Twitch /Anime\n\nWhich one would you recommend, or would you recommend something other?",
        "url": "https://www.reddit.com/r/SuggestALaptop/comments/1cycxwk/which_gaming_laptop_would_you_recommend/",
        "score": 14,
        "num_comments": 39,
        "created_utc": 1716416057.0,
        "created_dt": "2024-05-22 18:14:17",
        "author": "pyroblage",
        "subreddit": "SuggestALaptop",
        "comments": [
            {
                "comment_body": "Gonna make this like the GOTY awards\n\nBest overall portability: asus rog zephyrus g14 and the asus rog flow x16.\n\nBest display: asus rog zephyrus g14 2024.\n\nBest outside-of-gaming performance: lenovo legion 7i\n\nBest gaming performance: Lenovo legion 7i and the lenovo legion slim 5 gen 9.\n\nBest battery: lenovo legion slim 5 gen 9\n\nWorst probable contender: lenovo legion pro 5i\n\nOverall champion of performance and gaming: lenovo legion 7i.\n\nBest display and portability ratio: Asus rog zephyrus g14 2024.\n\nMost reliable: asus rog flow X16 (TIE) lenovo legion slim 5 gen 9.\n\nOverall champion of the club: Lenovo legion 7i or the Asus rog zephyrus g14 2024.\n\nChampion spec wins: Lenovo legion 7i: better performance overall. Asus rog zephyrus g14 2024: best display, battery life and portability. \n\nThis took forever comparing these...",
                "comment_author": "AquaticArroww",
                "comment_score": 7,
                "comment_created_utc": 1716417577.0,
                "comment_created_dt": "2024-05-22 18:39:37"
            },
            {
                "comment_body": "I may be biased since I have a Zephyrus G14 but it's a really good laptop imo. I've got the 2023 model with an RTX 4080 though. The 2024 only goes up to an RTX 4070.",
                "comment_author": "jikesar968",
                "comment_score": 2,
                "comment_created_utc": 1716416851.0,
                "comment_created_dt": "2024-05-22 18:27:31"
            },
            {
                "comment_body": "Get the fifth option, the Legion Slim 5 with the 8845HS and RTX 4070. Best gaming performance thanks to the GPU, yet cheaper than the other options.\n\n\nThe Zephyrus G14 is very nice, but if you want an OLED screen there's another Slim 5 on sale with an OLED at Bestbuy https://www.bestbuy.com/site/lenovo-legion-slim-5-14-5-oled-gaming-laptop-ryzen-7-7840hs-with-16gb-memory-nvidia-geforce-rtx-4060-8gb-with-1-tb-ssd-storm-grey/6559123.p?skuId=6559123\n\n\nThe 3rd and 4th options are only worth it if you're doing something that's extremely demanding on the CPU.  The other options have quite powerful CPUs as it is, but the HX CPUs offer more power at the cost of increased power consumption and therefore worse battery. Also they get hotter too. It's a bit of a waste of you don't need the extra CPU performance, most work and most games don't need it. In regards to gaming, you'd be better off getting a better GPU. For your usage it's no good; similar performance in games you're playing and worse battery life.\n\n\nThe X13 is nice but don't bother with it unless you want a 2 in 1.",
                "comment_author": "Lion12341",
                "comment_score": 1,
                "comment_created_utc": 1716451751.0,
                "comment_created_dt": "2024-05-23 04:09:11"
            },
            {
                "comment_body": "just picked up a 2024 g14 for $1099 plus tax yesterday.  tried to get another this morning but best buy reverted the price to $1599. Anyways loving out so far,  the display whole smaller than my old Legion is beautiful.  ",
                "comment_author": "PackageInner5451",
                "comment_score": 1,
                "comment_created_utc": 1721062326.0,
                "comment_created_dt": "2024-07-15 12:52:06"
            },
            {
                "comment_body": "Currently there's a 4070 g16 thats $1400\nor a 4080 g16 at $2400\n\nWhat should I get at BestBuy?",
                "comment_author": "HeliChwan",
                "comment_score": 1,
                "comment_created_utc": 1724497744.0,
                "comment_created_dt": "2024-08-24 07:09:04"
            },
            {
                "comment_body": "I went to several sources about buying a laptop, but this is the one that really made a difference. Thank you.",
                "comment_author": "One_Letterhead_9109",
                "comment_score": 1,
                "comment_created_utc": 1730069152.0,
                "comment_created_dt": "2024-10-27 18:45:52"
            },
            {
                "comment_body": "I'm selling my MSI Stealth 16.  Sent it to MSI to have it factory reset. Nothing wrong with it, basically a brand new machine.  I spent more $ on a higher end rig.  [https://www.ebay.com/itm/204991063797](https://www.ebay.com/itm/204991063797)",
                "comment_author": "nsbohn",
                "comment_score": 0,
                "comment_created_utc": 1726250543.0,
                "comment_created_dt": "2024-09-13 14:02:23"
            },
            {
                "comment_body": "Thank you for taking the time to breaking it down! Which one would you personally go for?",
                "comment_author": "pyroblage",
                "comment_score": 1,
                "comment_created_utc": 1716435718.0,
                "comment_created_dt": "2024-05-22 23:41:58"
            },
            {
                "comment_body": "Hey so Im looking into this too. Isn't there already a g15 and g16? What makes the g14 better than those options?",
                "comment_author": "DarkDreamT2",
                "comment_score": 1,
                "comment_created_utc": 1721232347.0,
                "comment_created_dt": "2024-07-17 12:05:47"
            },
            {
                "comment_body": "Any pros and cons after having used it for a while now?",
                "comment_author": "pyroblage",
                "comment_score": 1,
                "comment_created_utc": 1716435758.0,
                "comment_created_dt": "2024-05-22 23:42:38"
            },
            {
                "comment_body": "Lenovo Legion pro 5i and 7i still better.",
                "comment_author": "HelperHelpingIHope",
                "comment_score": 1,
                "comment_created_utc": 1729916127.0,
                "comment_created_dt": "2024-10-26 00:15:27"
            },
            {
                "comment_body": "G14 also has OLED ?",
                "comment_author": "Zealousideal-Fuel834",
                "comment_score": 1,
                "comment_created_utc": 1716633168.0,
                "comment_created_dt": "2024-05-25 06:32:48"
            },
            {
                "comment_body": "i am pretty biased when it comes to the asus rog zephyrus due to them being heavily portable. although if you just need pure and raw performance than the lenovo legion 7i is good for you. if you're going for a better reliability that is also versatile the asus rog zephyrus g14 2024 is good for you.\n\nits just on which one you'll choose.",
                "comment_author": "AquaticArroww",
                "comment_score": 2,
                "comment_created_utc": 1716436472.0,
                "comment_created_dt": "2024-05-22 23:54:32"
            },
            {
                "comment_body": "To be honest. Nothing.. the g14 doesnt seem to have a significsnt point to be better at an aspect. It pretty much is a smaller and more portable design and has lesser overheating issues. If the 2024 version we talking about its pretty much THE best 14\" laptop as of now. Biased against razer so im not sure\n\n\"Zephyrus\" is supposed to be that rog version to be alot more portable and still have powerful specs. the G14 is pretty much a flagship to that. The G16 Although a better one isnt really contributing to what ROG Zephyrus is. \n\nI do know theres less overheating issues to the G16 to the G14. Although i havent seen anything bout the G15. Just that i know the G14 Has less problems and is more versatile at situations.",
                "comment_author": "AquaticArroww",
                "comment_score": 1,
                "comment_created_utc": 1721232666.0,
                "comment_created_dt": "2024-07-17 12:11:06"
            },
            {
                "comment_body": "No complaints whatsoever.",
                "comment_author": "jikesar968",
                "comment_score": 1,
                "comment_created_utc": 1716438738.0,
                "comment_created_dt": "2024-05-23 00:32:18"
            },
            {
                "comment_body": "The Lenovo Legion 7i and 5i gpu's run at higher wattages, hence why theyre better.",
                "comment_author": "HelperHelpingIHope",
                "comment_score": 1,
                "comment_created_utc": 1729916166.0,
                "comment_created_dt": "2024-10-26 00:16:06"
            },
            {
                "comment_body": "Depends on your needs and form factor requirements.",
                "comment_author": "jikesar968",
                "comment_score": 1,
                "comment_created_utc": 1729916352.0,
                "comment_created_dt": "2024-10-26 00:19:12"
            },
            {
                "comment_body": "Yes, but it's a bit pricy compared to the Slim 5, considering the specs are pretty much the same. Both should be good though.",
                "comment_author": "Lion12341",
                "comment_score": 1,
                "comment_created_utc": 1716634189.0,
                "comment_created_dt": "2024-05-25 06:49:49"
            },
            {
                "comment_body": "G14 or g16? Trying to play new games and take to and fro work in backpack",
                "comment_author": "Jesus_inacave",
                "comment_score": 1,
                "comment_created_utc": 1730151688.0,
                "comment_created_dt": "2024-10-28 17:41:28"
            },
            {
                "comment_body": "Ahh I see, excellent thank you. This helps a lot with narrowing down a laptop cuz I've been looking to upgrade. Do you just get it from the website? And are there any specific specs/features to go for that you'd think would be worthwhile? I havent gone shopping for a new comp in years so if you got anything I should know I'd greatly appreciate it.",
                "comment_author": "DarkDreamT2",
                "comment_score": 1,
                "comment_created_utc": 1721232895.0,
                "comment_created_dt": "2024-07-17 12:14:55"
            },
            {
                "comment_body": "Perhaps. But just in general it’s a superior laptop.",
                "comment_author": "HelperHelpingIHope",
                "comment_score": 1,
                "comment_created_utc": 1729966149.0,
                "comment_created_dt": "2024-10-26 14:09:09"
            },
            {
                "comment_body": "I believe the g14 will be more easier to use and to travel with. For gaming experiences the g16 is better cause of it being 16\".. but if you want something more versatile the g14 would be better..",
                "comment_author": "AquaticArroww",
                "comment_score": 2,
                "comment_created_utc": 1730182345.0,
                "comment_created_dt": "2024-10-29 02:12:25"
            },
            {
                "comment_body": "Honestly i cant check the website but uhh\n\nAlways go 32GB\n\n4060 is good stuffs. would recommend purchasing a 4070 version but its whatever. no vram increase though\n\nDO NOT buy off 2023-2021 variants\n\nWould recommend buying via Bestbuy cuz warranty ig\n\nAnd if Zephyrus: Delete Armoury crate, Download Ghelper, Remove McAfee and MyAsus\n\nI would recommend going for a legion but uhh im in a rush so i cant recommend anything right now. Soo maybe by like 5-7 hours i can go check.\n\nI'd think youd spend abit too much money if this is your first gaming laptop. or if its the first one you purchased after a long time. Honestly i can recommend another.\n\nJust tell past laptop, Preferred Screensize, if prefer something light \"KG\", and Usage. plus budget anyways",
                "comment_author": "AquaticArroww",
                "comment_score": 2,
                "comment_created_utc": 1721233333.0,
                "comment_created_dt": "2024-07-17 12:22:13"
            },
            {
                "comment_body": "Mine has a 4080. Both of the Legions only go up to a 4070 as far as I can tell. It's also way lighter and more compact.",
                "comment_author": "jikesar968",
                "comment_score": 1,
                "comment_created_utc": 1729992460.0,
                "comment_created_dt": "2024-10-26 21:27:40"
            },
            {
                "comment_body": "You think the legion would be better? I have discounts for Lenovo HP and Dell. \n\nAnd my most recent laptop was an MSI gl75 leopard, can't remember exactly which one it was but I'm thinking it's that. The idea of a smaller now powerful laptop sounds pretty good to me tho, tho if there's a better option out there that's a little bigger that's fine too.\n\nAnd budget wise I guess 1800 or less would be fine, give or take.",
                "comment_author": "DarkDreamT2",
                "comment_score": 1,
                "comment_created_utc": 1721239124.0,
                "comment_created_dt": "2024-07-17 13:58:44"
            },
            {
                "comment_body": "I don't like that you can't get 64gb ram. I mean 32gb is okay now, but 2 years from now? IDK.",
                "comment_author": "CouplePurple8617",
                "comment_score": 1,
                "comment_created_utc": 1730467341.0,
                "comment_created_dt": "2024-11-01 09:22:21"
            },
            {
                "comment_body": "After last gen they added a new line called 9i where they moved the higher end GPUs to. Busy as many have pointed out, a 4070 mobile gpu with more watts will actually out outperform a low watt 4080 GPU. Keep that in mind.\n\nI have 9i with a 4090 and am very happy with it.",
                "comment_author": "HelperHelpingIHope",
                "comment_score": 1,
                "comment_created_utc": 1730045079.0,
                "comment_created_dt": "2024-10-27 12:04:39"
            },
            {
                "comment_body": "Honestly i was the best follower of Asus till that incident that occured a couple months ago. anyways,\n\n>Legion has the least problems\n\nHonestly Lenovo Legion is probably the best gaming laptop series  by far. versatile specs with powerful gpu and a fast processor. and a good looking display.\n\nIf having 16gb ram isnt a problem then the [legion slim 5 gen 8 14\"](https://www.lenovo.com/us/en/p/laptops/legion-laptops/legion-5-series/legion-slim-5-gen-8-(14-inch-amd)/len101g0032) is a pretty great answer. It isnt \"Slim\" but it is pretty easier to travel with the dimensions. and on the other size [legion 7i gen 9 16\"](https://www.lenovo.com/us/en/p/laptops/legion-laptops/legion-7-series/legion-7i-gen-9-(16-inch-intel)/len101g0037) might have good specs..\n\nAnd obviously the [Alienware X14 R2 is a great choice.](https://www.dell.com/en-us/shop/game-laptops/x14/spd/alienware-x14-r2-laptop) think its on sale including the [m16 R2](https://www.dell.com/en-us/shop/game-laptops/new-m16/spd/alienware-m16-r2-laptop/useashctom16r204).\n\nAlthough im not really a dell dude so im not sure if they are any better. just good choices with the Zephyrus. i believe the two legions i've recommended are better. including the [slim 5 gen 9 16\"] im planning to get by the end of the year. hope this helps..",
                "comment_author": "AquaticArroww",
                "comment_score": 1,
                "comment_created_utc": 1721262945.0,
                "comment_created_dt": "2024-07-17 20:35:45"
            },
            {
                "comment_body": ">4070 mobile gpu with more watts will actually out outperform a low watt 4080 GPU\n\nIt absolutely does not. You're thinking of 30 series. The 4070 tops out at around 100W. The 4080 and 4090 meanwhile are not limited in wattage.",
                "comment_author": "jikesar968",
                "comment_score": 1,
                "comment_created_utc": 1730070587.0,
                "comment_created_dt": "2024-10-27 19:09:47"
            },
            {
                "comment_body": "Ah yes, you're correct, the 30 series had different power scaling characteristics. In either case, generally, the Legion series are still superior laptops.",
                "comment_author": "HelperHelpingIHope",
                "comment_score": 1,
                "comment_created_utc": 1730074073.0,
                "comment_created_dt": "2024-10-27 20:07:53"
            }
        ]
    },
    {
        "title": "Gaming laptop to buy in 2024?",
        "selftext": "Ok, as the title states. What should I get? And let me clarify as best I can what’s holding up my decision. I’m currently debating laptop or building a desktop. I travel for work, sometimes by air sometimes by car. I like playing in bed while I’m home but also play outside and enjoy smoking a cigar while playing when weather permits. I’m leaning towards laptop for that reason. \n\nWhat kind of graphics card fall off is there? I’ve kind of poked around in a couple posts talking about how I want a 4090 cause it’s the best but a lot of people have chimed in that performance drops off and heat sky rockets (preventing playing with the laptop on my lap or chest in bed). What’s worth the extra spend?\n\nWhat am I considering? New 2024 Zephyrus g16, new 2024 Blade 16 are my top two choices. I like OLED screens, I like the overall look of both machines (I’m superficial and don’t care if it costs more due to this). Judge me if you must lol.\n\nAnyways just looking for information and recommendations from all of you who for sure know more than I do.\n\nFor reference I have a 2021 Razer Blade 14 with a 3080 currently that gets the job done but runs hot and is quite heavy compared to my MacBook Air (which of course doesn’t really do the job for gaming lol and while I used it for weight comparison I do actually know the difference:)).\n\nThanks in advance for any help!",
        "url": "https://www.reddit.com/r/GamingLaptops/comments/197hu8o/gaming_laptop_to_buy_in_2024/",
        "score": 28,
        "num_comments": 23,
        "created_utc": 1705347900.0,
        "created_dt": "2024-01-15 14:45:00",
        "author": "Ok-Signature-1434",
        "subreddit": "GamingLaptops",
        "comments": [
            {
                "comment_body": "Let's get some things clear: \n\n1. You should not play on the bed. You should put your laptop on a flat, hard surface. On the bed you will block the vents and the thing will fry itself. \n\n2. You shouldn't aim at gaming on battery. It will not work out. You will just kill the battery and the performance drop will not be pleasant anyway. \n\nIf you want to truly play on the go, your best bet currently is a handheld. OR maybe you should wait for Strix Halo, although that may only arrive in 2025. \n\nOtherwise the models you picked are good, although I don't think you need a 4090 for gaming. Depends on what kind of games you're playing. I think a 4080 will be a decent upgrade.",
                "comment_author": "N/A",
                "comment_score": 8,
                "comment_created_utc": 1705350227.0,
                "comment_created_dt": "2024-01-15 15:23:47"
            },
            {
                "comment_body": "The G16 with a 4080 runs at 115W, compared to the Blade 16 at 150W. The CPU will also run at higher power in the Blade 16. The RAM is also soldered on the G16, but upgradable on the Blade.\n\nIf you don’t care about the OLED display, last gen Blade 16’s are $2799 with the 4080 at Micro Center, depending where you’re located. The i9-13950HX is basically the same chip as the 14900HX in the 2024 model. Best of luck!",
                "comment_author": "Teqtonix",
                "comment_score": 4,
                "comment_created_utc": 1707186232.0,
                "comment_created_dt": "2024-02-05 21:23:52"
            },
            {
                "comment_body": "The blade is a terrible laptop, I have the blade 14 my cpu runs at 100 degrees under 30% capacity and my battery is bloated. Razer support is non existent. Get something with better cooling.",
                "comment_author": "the_onion_k_nigget",
                "comment_score": 2,
                "comment_created_utc": 1726983010.0,
                "comment_created_dt": "2024-09-22 01:30:10"
            },
            {
                "comment_body": "Hey everyone! I’m in the scenario where I want to play competitive CALL OF DUTY. I currently play on ps5 but I obviously can’t compete vs PC. I can’t buy a pc because I travel to much. I’m looking for a laptop but I’m still indecisive on the type that I need to perform on a competitive level. I still have on stand by the Alienware X16 R1 Gaming Laptop - 16-inch QHD+ 240Hz Display, Intel Core i9-13900HK, 32GB LPDDR5 RAM, 1TB SSD, NVIDIA GeForce RTX 4080 12GB GDDR6, Windows 11 Home - Lunar Silver\n\nAnd the  MSI Stealth 17 Studio 17.3\" QHD 240Hz Gaming Laptop: 13th Gen Intel Core i9, RTX 4080, 32GB DDR5, 1TB NVMe SSD, Thunderbolt 4, USB-Type C, Cooler Boost Trinity+, Win11 Home: Core Black A13VH-053US\n\nI hear a lot about “battery life” or “they don’t perform as good” I literally don’t play any other game. I will do this and probably stream (need a good camera) \n\nSo any suggestions for my needs?",
                "comment_author": "Lennylopeztrainer",
                "comment_score": 1,
                "comment_created_utc": 1712424153.0,
                "comment_created_dt": "2024-04-06 13:22:33"
            },
            {
                "comment_body": "I am a big console guy, mainly PlayStation 5, it’s a long story with my Xbox series X. I used to use my PS for ps exclusives only, everything else Xbox. I upgraded my WiFi system to the Orbi system and it’s fantastic. So much faster, coverage distance, etc. I’ve never had any dropping issues EXCEPT in two weird moments. 1. Whenever I turn on my Xbox, my Orbi suddenly drops. It will reconnect and drop again in a matter of minutes. As soon as I shut it off. Boom, perfect internet again. 2. Sometimes when download PS5 games, it’ll drop. But I’m able to get it downloaded if I set them to download when I’m not home (I know it’s odd) but I can still play and I’m not going to sacrifice the incredible internet if my PS5 is perfectly playable.  So if anyone has any idea wtf that is about, let me know. Oh, and I even bought a new Xbox series X to see if it was the box (mine was super early model) but nope. New Xbox did the same crap so I returned it. \n\nWith all that being said, you can see why I want a gaming laptop. I need to finish dying light two and want to play starfield and flight sim. So anyways, any insight on good options $2k and under would be cool.",
                "comment_author": "1776DontTreadOnMe74",
                "comment_score": 1,
                "comment_created_utc": 1706833072.0,
                "comment_created_dt": "2024-02-01 19:17:52"
            },
            {
                "comment_body": "the blade 14 is a good laptop for the go and you could build a pc and use the 14 when travaling. if you buy a new one it will waste the 14.",
                "comment_author": "Potential-Emu-8530",
                "comment_score": 1,
                "comment_created_utc": 1707366422.0,
                "comment_created_dt": "2024-02-07 23:27:02"
            },
            {
                "comment_body": "“you should not play on the bed” ☝️🤓",
                "comment_author": "Exotic-Brilliant5868",
                "comment_score": 7,
                "comment_created_utc": 1718919074.0,
                "comment_created_dt": "2024-06-20 17:31:14"
            },
            {
                "comment_body": "I only use my laptop in bed, just put something under it like a book or the box it came in.",
                "comment_author": "Happy-Chocolate-6574",
                "comment_score": 5,
                "comment_created_utc": 1720013064.0,
                "comment_created_dt": "2024-07-03 09:24:24"
            },
            {
                "comment_body": "Oh sorry to mislead, I have a laptop table thing for when I play on the bed, still hot. Also plugged in I rarely play in battery.\n\nWould like good performance playing triple A titles: new Call Of Duty’s, Cyber Punk, new stuff coming out. \n\nAnd definitely would like to purchase in the near future not looking to wait till 2025.\n\nWhat kind of differences in performance vs best am I getting say between 4070, 4080, 4090. I know the price increases exponentially between them but what’s worth it to make the laptop as future proof as I can? I want to still be playing triple A titles in 2026 say…",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1705352163.0,
                "comment_created_dt": "2024-01-15 15:56:03"
            },
            {
                "comment_body": "What about the shitshow on intel stability issues? They say it doesn't affect mobile but I'm not too convinced. I would prefer AMD but the number of options are limited. Any good ones you know of?",
                "comment_author": "1RogerAnderson",
                "comment_score": 1,
                "comment_created_utc": 1722332022.0,
                "comment_created_dt": "2024-07-30 05:33:42"
            },
            {
                "comment_body": "Yeah looking through posts finally of the 2024 G16 and seeing benchmarks vs the 2024 Blade 16 has me all sorts of questioning now:/. And both of them have OLED now so that’s a moot point. The 2024 Blade though looks to be $3500 with the 4080 (only selling it with 32gb ram so the price shoots up as soon as you choose it heh). The G16 with the 4080 shows as currently sitting at $2900 but I think that is with only 16gb of ram. I can’t imagine them charging less than at least $300 on a ram upgrade. So basically now I get to decide if the $200-$300 is going to be worth the extra performance and minus the form factor:/. This is less than fun this year and a little more expensive than I had wanted lol.",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1707199137.0,
                "comment_created_dt": "2024-02-06 00:58:57"
            },
            {
                "comment_body": "redo the thermal paste on the cpu/gpu. my MAXQ17 did the same thing. repasted with artic mx6 and im steady at 88degrees @ 100% usage",
                "comment_author": "Mysterious-Salad9609",
                "comment_score": 1,
                "comment_created_utc": 1731209495.0,
                "comment_created_dt": "2024-11-09 22:31:35"
            },
            {
                "comment_body": "Bringing it back heh. I think I’m going with the Zephyrus g16. Just read an article about the Blade that said they’re having some cpu performance issues right now. Prices on the g16 are a bit better as well. Just waiting for them to actually become available (prices just went up so I imagine soon).",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1707069905.0,
                "comment_created_dt": "2024-02-04 13:05:05"
            },
            {
                "comment_body": "LOL, I like you",
                "comment_author": "Zaranius",
                "comment_score": 1,
                "comment_created_utc": 1726162768.0,
                "comment_created_dt": "2024-09-12 13:39:28"
            },
            {
                "comment_body": "back issues, my adjustable bed or the couch are the only real seating options Im sure someone makes a base they can sell me",
                "comment_author": "FieryDoormouse",
                "comment_score": 1,
                "comment_created_utc": 1729719610.0,
                "comment_created_dt": "2024-10-23 17:40:10"
            },
            {
                "comment_body": "A 4080 would be enough for you, I think. \n\nThere is a hefty 50% average performance difference between the 4070 and the 4080 in 1440p, whereas between the 4080 and the 4090 is only around 10% in 1440p and 15% in 4K. Price difference may or may not follow the performance difference. If you find a Razer Blade 16 or a Legion Pro 7 at a nice price with 4080, it's definitely worth considering. I assume you want something more premium and have the disposable income for it. The main argument for the 4090 is the 16 gigs of VRAM. That could help out in the future, but the 4080 already has 12, so there is no huge issue here.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1705353118.0,
                "comment_created_dt": "2024-01-15 16:11:58"
            },
            {
                "comment_body": "I don't like that you can't get 64gb ram.",
                "comment_author": "CouplePurple8617",
                "comment_score": 1,
                "comment_created_utc": 1730467141.0,
                "comment_created_dt": "2024-11-01 09:19:01"
            },
            {
                "comment_body": "Did you manage to buy the lapop, and if so. What is your opinion?",
                "comment_author": "Codeine_ZA",
                "comment_score": 1,
                "comment_created_utc": 1710060022.0,
                "comment_created_dt": "2024-03-10 04:40:22"
            },
            {
                "comment_body": "So if I am only playing on the laptop and not utilizing a 4k monitor the gains from 4080-4090 isn’t really there? Because for sure I am not using anything external except for a mouse heh. Also I see a lot of talk about TDP in terms of the GPU. For example the 2024 Blade 16 says 150 TDP but spread between the GPU and CPU while the new ROG Zephyrus talks about 115 TDP for just the GPU. Not sure how that split makes a difference or if it does?\n\nAnd yeah it sounds like the 4080 is probably going to be what I settle on, I just don’t want to end up regretting it in a year or two I guess:). Thank you for the help!",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1705355854.0,
                "comment_created_dt": "2024-01-15 16:57:34"
            },
            {
                "comment_body": "So I slept on the 4080 and BB has been sold out ever since. I keep checking but guess I messed up:/. Still my plan to purchase just have to wait on the stock now…",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1710082347.0,
                "comment_created_dt": "2024-03-10 10:52:27"
            },
            {
                "comment_body": "PS I lied it’s now listed as unavailable :/. Not sure that’s a good thing…",
                "comment_author": "Ok-Signature-1434",
                "comment_score": 1,
                "comment_created_utc": 1710082407.0,
                "comment_created_dt": "2024-03-10 10:53:27"
            },
            {
                "comment_body": "The 4090 isn't really worth it imo. The best value for you os the 4080. \n\nThe TDP of the GPU is called TGP more often. The Blade's TGP is 150W, not shared with the CPU.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1705356402.0,
                "comment_created_dt": "2024-01-15 17:06:42"
            },
            {
                "comment_body": "Is 4070 good?",
                "comment_author": "Kyle_67890",
                "comment_score": 1,
                "comment_created_utc": 1707608618.0,
                "comment_created_dt": "2024-02-10 18:43:38"
            }
        ]
    },
    {
        "title": "Should I buy a 2021 gaming laptop in 2024?",
        "selftext": "What are the downsides of buying a 2021 laptop in 2024. I have recently purchased a rtx3070 legion 5 laptop. The only downside I could think of is that it's slightly outdated yet still powerful gpu. But I've seen in many places people stating that you need to be wary of buying old laptops, not sure why though?",
        "url": "https://www.reddit.com/r/GamingLaptops/comments/1djwsct/should_i_buy_a_2021_gaming_laptop_in_2024/",
        "score": 11,
        "num_comments": 34,
        "created_utc": 1718838281.0,
        "created_dt": "2024-06-19 19:04:41",
        "author": "FCGLITCHES",
        "subreddit": "GamingLaptops",
        "comments": [
            {
                "comment_body": "So, generally speaking, technology gets better over time. The core components are the most important sure, but everything else too - better batteries, newer standards for connectors, better display tech, so on. Now whether that's changed enough to super matter from 2021 to now is very subjective, but that is point 1\n\nPoint 2 is that maintenance for a gaming laptop is significantly less foolproof than other expensive purchases. You won't necessarily see if something is messed up inside and it's been abused and worn harder than something that had been better taken care of. This point is only really relevant for USED products, but I think if you want to buy something older you're probably buying used? \n\nFor personal opinion's sake, 2021 is not old enough that I'd be horribly concerned as long as it was quite good in 2021. 2021's \"okay\" is today's \"not good\", but 2021's \"awesome\" is today's \"pretty good\", y'know?",
                "comment_author": "Icy_Desperation",
                "comment_score": 25,
                "comment_created_utc": 1718838842.0,
                "comment_created_dt": "2024-06-19 19:14:02"
            },
            {
                "comment_body": "Thats a good laptop, its only a question of price and it doing what u need.",
                "comment_author": "Electrical-Bobcat435",
                "comment_score": 6,
                "comment_created_utc": 1718840758.0,
                "comment_created_dt": "2024-06-19 19:45:58"
            },
            {
                "comment_body": "3070 has greater memory bus than 4070",
                "comment_author": "Papabelus",
                "comment_score": 4,
                "comment_created_utc": 1718849330.0,
                "comment_created_dt": "2024-06-19 22:08:50"
            },
            {
                "comment_body": "Don't stress it out dude I've the same laptop as yours 15ACH6H and it's so good and runs games flawlessly obviously new laptops are going to be better but if it gets the job done then why bother yourself, enjoy your purchase",
                "comment_author": "Delicious-Rutabaga-7",
                "comment_score": 3,
                "comment_created_utc": 1718853195.0,
                "comment_created_dt": "2024-06-19 23:13:15"
            },
            {
                "comment_body": "The difference between the 3070 and 4070 is around.. maybe less than 10%. I’m keeping my 3070 laptop for at least a couple more years. Hopefully you got a good deal though. If temps are high you could do a repast… upgrade ram and SSD if needed.",
                "comment_author": "word2yourface",
                "comment_score": 5,
                "comment_created_utc": 1718840918.0,
                "comment_created_dt": "2024-06-19 19:48:38"
            },
            {
                "comment_body": "Legion 5 is an excellent laptop and the 3070 still kicks ass today. It will continue to perform well for the next several years without issues.",
                "comment_author": "AdPrevious4844",
                "comment_score": 2,
                "comment_created_utc": 1718861815.0,
                "comment_created_dt": "2024-06-20 01:36:55"
            },
            {
                "comment_body": "Good laptop in this case, really comes down to what you're paying for it.\n\nThe RTX 3070 here is on par with a RTX 4060 100W+ in pure rasterisation performance in games, still a solid GPU.",
                "comment_author": "UnionSlavStanRepublk",
                "comment_score": 2,
                "comment_created_utc": 1718867021.0,
                "comment_created_dt": "2024-06-20 03:03:41"
            },
            {
                "comment_body": "Thermal paste dries out, possibly not an issue now but may be in the near future. \n\nHonestly I have a 3070 laptop from 2021 and it's good enough I've had no desire to upgrade.",
                "comment_author": "Agentfish36",
                "comment_score": 2,
                "comment_created_utc": 1718894016.0,
                "comment_created_dt": "2024-06-20 10:33:36"
            },
            {
                "comment_body": "There are no big downsides of buying a 2021 gaming laptop. They are still buyable,sellable and has a long life ahead of them\n\nWell,there would be downsides if u purchased something like 1650,2050,3050. i'd doubt u could play games easily in a few years. but u've got a 3070 legion 5 so its fine as hell.\n\nI've decided to get a victus with i5 13500h(not the 13420h) and 4050,im normally against the 50 series cards but 4050 was a great leap,it outperforms the 3060  while being absolutely price/performance machine\n\nBUT it is worse than your 3070 laptop i am sure(unless u didn't take care of it or your cpu is weak) so depending on how much you paid or how clean is the laptop i can say you either \"did a great purchase\" or \"could have gotten a 4060 laptop instead\"\n\nI just read that you got it for 750USD. I don't really know if you could have bought a 4060 that price but 4060 probably would be a slightly better choice.But 3070 is still new and powerful. i'd give it a solid pass till 2028-2029. after that it will probably be in the state where 1050/1060 laptops currently are.",
                "comment_author": "RemarkableRip5457",
                "comment_score": 2,
                "comment_created_utc": 1727672382.0,
                "comment_created_dt": "2024-09-30 00:59:42"
            },
            {
                "comment_body": "If its a 30 series card you'll be fine for quite a while. Most games are designed for consoles and the current gen are the equivalent of a 20 series.",
                "comment_author": "TheCorbeauxKing",
                "comment_score": 1,
                "comment_created_utc": 1718839400.0,
                "comment_created_dt": "2024-06-19 19:23:20"
            },
            {
                "comment_body": "The downside is it being old and outdated like you have said",
                "comment_author": "chorong761",
                "comment_score": 1,
                "comment_created_utc": 1718841642.0,
                "comment_created_dt": "2024-06-19 20:00:42"
            },
            {
                "comment_body": "what if for example legion 7 with 12800hx cou and 3060ti? i believe this is 2022..?",
                "comment_author": "Lazy_Possibility5705",
                "comment_score": 1,
                "comment_created_utc": 1718849129.0,
                "comment_created_dt": "2024-06-19 22:05:29"
            },
            {
                "comment_body": "There are 3 reasons I can think of:\n\n1. Is the laptop used or new? If new, why hasn't been sold yet. I would be very suspicious. Could be a repaired unit. If so, what was the issue in the first place?\n\n2. The 3070 is an OK GPU but you will lose the longevity of DLSS 3.5 and FrameGen. 30-series GPUs can't perform these. Therefore, you would need to upgrade sooner if you want to play AAA games.\n\n3. The battery life would be affected. LiIon batteries degrade over time. And a 3 year old laptop could have a cooked battery. Better check it.",
                "comment_author": "N/A",
                "comment_score": -2,
                "comment_created_utc": 1718872370.0,
                "comment_created_dt": "2024-06-20 04:32:50"
            },
            {
                "comment_body": "Ah okay got you makes sense. Half of the issues mentioned don't apply to me like battery life, I usually have it connected. Also yes I got it used for a very good price so it was worth it with warranty as well.\n\n\nThe thing is ofcourse legion 5 is not top of line with the latest and greatest tech so I wouldn't be missing out on much for the price i got it for $750. Thank you for clarifying it.",
                "comment_author": "FCGLITCHES",
                "comment_score": 3,
                "comment_created_utc": 1718839455.0,
                "comment_created_dt": "2024-06-19 19:24:15"
            },
            {
                "comment_body": "It's funny you talk about better over time. I generally don't disagree with you. But laptops have seriously stagnated. \n\nScreens -Apart from OLED, basically the same and most gaming laptops are still on IPS (which is fine). \n\nCPUs - have increased in performance but aren't the most necessary for gaming for anything but esports. I have zero complaints about the 5900hs, I wouldn't mind having an alder lake laptop for gaming. \n\nGPUs - Nvidia has served up a steaming plate of hot garbage this gen. 4060 is a decent value option but it's basically a 3070. 4070 is basically 3080 or 3070ti. Unacceptable for a 3 year jump but not bad if you're buying an older laptop. \n\nMisc - battery, cases, etc havent had a big change so no loss there. \n\nAs a 2021 laptop owner myself, there's literally nothing worth upgrading to this gen IMO, which means buying a used one now isn't a bad idea.",
                "comment_author": "Agentfish36",
                "comment_score": 1,
                "comment_created_utc": 1718894489.0,
                "comment_created_dt": "2024-06-20 10:41:29"
            },
            {
                "comment_body": "It's good in both departments ",
                "comment_author": "FCGLITCHES",
                "comment_score": 2,
                "comment_created_utc": 1718841101.0,
                "comment_created_dt": "2024-06-19 19:51:41"
            },
            {
                "comment_body": "The 4060 if the same price is still definitely better, similar performance, lower power consumption, dlss3, and paired with newer (often faster) cpus.",
                "comment_author": "Kaiewaii",
                "comment_score": 1,
                "comment_created_utc": 1718865742.0,
                "comment_created_dt": "2024-06-20 02:42:22"
            },
            {
                "comment_body": "I have the Rog zephyrus g15 with the ryzen 9 5900hs GA503QR-211.ZG15. 3070\nStill runs world of tanks without a hitch. Keyboards falling to pieces and they won't go good for it.  Even thought they have replaced it once before",
                "comment_author": "JackG79",
                "comment_score": 2,
                "comment_created_utc": 1723602973.0,
                "comment_created_dt": "2024-08-13 22:36:13"
            },
            {
                "comment_body": "So far so good no complaints. Wow a few years lol, that's a good thing. Never knew it was only 10% better thats crazy",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1718841156.0,
                "comment_created_dt": "2024-06-19 19:52:36"
            },
            {
                "comment_body": "Love to see it",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1718879536.0,
                "comment_created_dt": "2024-06-20 06:32:16"
            },
            {
                "comment_body": "Paid $750 not a bad deal at all, especially here in the UK, not found a price close to it",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1718879606.0,
                "comment_created_dt": "2024-06-20 06:33:26"
            },
            {
                "comment_body": "If temps increase, thatll be the first thing i check lol",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1718903737.0,
                "comment_created_dt": "2024-06-20 13:15:37"
            },
            {
                "comment_body": "So far so good playing nearly all games at 1080p max settings.",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1727735700.0,
                "comment_created_dt": "2024-09-30 18:35:00"
            },
            {
                "comment_body": "Yeah but you can get a brand new 4060 right now for $850 if you shop around for a good deal (several brands are running this special right now).\n\nSo if you are in the USA, haven't purchased yet & are actually looking for advice (as opposed to just looking for validation for something you already did), I would still recommend against shelling out $750 for an old 2021 model given the comparable prices on a new 2024 model.\n\nFor example:\n\nThis Legion 5 Slim with RTX 4060 was on sale for $800 (only $50 more) just a couple days ago:\n\n[https://slickdeals.net/f/17553324-lenovo-legion-slim-5-16-gaming-laptop-wuxga-ryzen-5-7640hs-with-16gb-memory-nvidia-geforce-rtx-4060-8gb-512gb-ssd-storm-grey-799-99?src=SiteSearchV2Algo](https://slickdeals.net/f/17553324-lenovo-legion-slim-5-16-gaming-laptop-wuxga-ryzen-5-7640hs-with-16gb-memory-nvidia-geforce-rtx-4060-8gb-512gb-ssd-storm-grey-799-99?src=SiteSearchV2Algo)\n\nThis MSI Bravo with RTX 4060 still on sale now for $880:\n\n[https://slickdeals.net/f/17565729-msi-bravo-15-15-6-144-hz-ips-amd-ryzen-9-7940hs-rtx-4060-16gb-ddr5-1tb-ssd-880-w-zip-checkout-free-shipping?src=category\\_page](https://slickdeals.net/f/17565729-msi-bravo-15-15-6-144-hz-ips-amd-ryzen-9-7940hs-rtx-4060-16gb-ddr5-1tb-ssd-880-w-zip-checkout-free-shipping?src=category_page)\n\nThis Dell G15 with RTX 4060 still on sale for $899:\n\n[https://slickdeals.net/f/17565720-dell-g15-5530-15-6-fhd-360hz-ips-i7-13650hx-rtx-4060-16gb-ddr5-1tb-ssd-899-99?src=category\\_page](https://slickdeals.net/f/17565720-dell-g15-5530-15-6-fhd-360hz-ips-i7-13650hx-rtx-4060-16gb-ddr5-1tb-ssd-899-99?src=category_page)\n\nThis 17\" Acer with RTX 4060 on sale in store (Microcenter) for $899:\n\n[https://slickdeals.net/f/17527401-microcenter-in-store-acer-nitro-17-17-3-fhd-165hz-ryzen-7-8845hs-rtx-4060-16gb-ddr5-1tb-ssd-899-99?src=category\\_page](https://slickdeals.net/f/17527401-microcenter-in-store-acer-nitro-17-17-3-fhd-165hz-ryzen-7-8845hs-rtx-4060-16gb-ddr5-1tb-ssd-899-99?src=category_page)\n\nIf it were me & my budget was $750, I would scape together $50 more to get the Legion Slim 5 RTX 4060 that was on sale a couple days ago for $800.  The older something is, the more likely components may go bad over time.  If you don't have a warranty & end up with a bad motherboard, for example, you could end up being out the whole $750.  It's entirely understandable to be on a budget, but would still suggest that it's worth the minimal effort to bargain hunt for the best option within a given budget.",
                "comment_author": "Sad-Possession7729",
                "comment_score": 7,
                "comment_created_utc": 1718850822.0,
                "comment_created_dt": "2024-06-19 22:33:42"
            },
            {
                "comment_body": "But if you already have it AND it is performing well with no problems, then I wouldn't say that you made a bad choice (you should be fine with it).  The 3070 is basically on par with newer models.\n\nI would just caution you against buying if you haven't done so already because of the greater potential variance on quality control & possibility that it may have problems right out of the box when dealing with older units.  Different story if you have a chance to test it before buying (or if you already bought and it works fine).",
                "comment_author": "Sad-Possession7729",
                "comment_score": 2,
                "comment_created_utc": 1718851013.0,
                "comment_created_dt": "2024-06-19 22:36:53"
            },
            {
                "comment_body": "New legion 5 with AMD and 4060 is 799.99 new.",
                "comment_author": "JackG79",
                "comment_score": 1,
                "comment_created_utc": 1718850542.0,
                "comment_created_dt": "2024-06-19 22:29:02"
            },
            {
                "comment_body": "so you paid significantly less than 1k for it? then i would consider it an ok deal",
                "comment_author": "Dayv1d",
                "comment_score": 2,
                "comment_created_utc": 1718859043.0,
                "comment_created_dt": "2024-06-20 00:50:43"
            },
            {
                "comment_body": "Solid deal then.",
                "comment_author": "UnionSlavStanRepublk",
                "comment_score": 1,
                "comment_created_utc": 1718885543.0,
                "comment_created_dt": "2024-06-20 08:12:23"
            },
            {
                "comment_body": "yeah 3070 is capable of doing that. you should get 120+fps on every game that is not AAA too.\n\nbuying an old powerful laptop is same as buying an old powerful car. its like buying a 2014 mustang instead of a 2024 prius. im sure u get it.",
                "comment_author": "RemarkableRip5457",
                "comment_score": 2,
                "comment_created_utc": 1727757800.0,
                "comment_created_dt": "2024-10-01 00:43:20"
            },
            {
                "comment_body": "\n\nRTX 4070 performs as RTX 3070ti in 1440p. theoretically RTX 3070TI has 10% more cuda, but in gpu games it will be on an average 6% faster.\n\nWorst nvidia release is 4070 in 2023,no performanceimprovement . 3070ti is 22% faster than 4060. 3070 will be 15% . also have twice vram bandwidth too.",
                "comment_author": "Appropriate_Turn3811",
                "comment_score": 1,
                "comment_created_utc": 1718860430.0,
                "comment_created_dt": "2024-06-20 01:13:50"
            },
            {
                "comment_body": "Yh I purchased it and it works fine. ",
                "comment_author": "FCGLITCHES",
                "comment_score": 1,
                "comment_created_utc": 1718857998.0,
                "comment_created_dt": "2024-06-20 00:33:18"
            },
            {
                "comment_body": "Yh u thought about it, but i would rather have a gpu with better raw performance. ",
                "comment_author": "FCGLITCHES",
                "comment_score": 0,
                "comment_created_utc": 1718857897.0,
                "comment_created_dt": "2024-06-20 00:31:37"
            },
            {
                "comment_body": "Paid £600 for it. $750. I've not seen it go close to this price.",
                "comment_author": "FCGLITCHES",
                "comment_score": 2,
                "comment_created_utc": 1718879434.0,
                "comment_created_dt": "2024-06-20 06:30:34"
            },
            {
                "comment_body": "RTX 4070 performs as RTX 3070ti in 1440p. theoretically RTX 3070TI has 10% more cuda, but in gpu games it will be on an average 6% faster. \n\nWorst nvidia release is 4070 in 2023,no performanceimprovement . 3070ti is 22% faster than 4060. 3070 will be 15% . also have twice vram bandwidth too.",
                "comment_author": "Appropriate_Turn3811",
                "comment_score": 2,
                "comment_created_utc": 1718860370.0,
                "comment_created_dt": "2024-06-20 01:12:50"
            }
        ]
    },
    {
        "title": "Question: Should I buy a gaming laptop before 2024 ends?",
        "selftext": "Did anything worthy came out in the last 8 months? Anything coming in the next few months?\n\nI am looking somewhere between 1000-1200 budget to get something I can work and game a bit without the hassle of carrying a brick as an adapter. \n\nThanks for the input. \n",
        "url": "https://www.reddit.com/r/laptops/comments/1evabty/question_should_i_buy_a_gaming_laptop_before_2024/",
        "score": 2,
        "num_comments": 12,
        "created_utc": 1723990680.0,
        "created_dt": "2024-08-18 10:18:00",
        "author": "N/A",
        "subreddit": "laptops",
        "comments": [
            {
                "comment_body": "The only noteworthy laptop that's come out this year (besides the snapdragons) in my opinion is the Framework 16. \n\n\nFully modular, build it yourself, upgradable GPU, etc. Unfortunately, it's over the budget you quoted. I think you may get bang for your buck getting a Steam Deck and non gaming laptop.",
                "comment_author": "TechPriestNhyk",
                "comment_score": 6,
                "comment_created_utc": 1723991981.0,
                "comment_created_dt": "2024-08-18 10:39:41"
            },
            {
                "comment_body": "If you want to carry it around without the brick adapter maybe you should look for something else, a gaming laptop is always going to have a poorer battery life",
                "comment_author": "Advanced-Platform-97",
                "comment_score": 2,
                "comment_created_utc": 1723990999.0,
                "comment_created_dt": "2024-08-18 10:23:19"
            },
            {
                "comment_body": "yes but,\n\nLunar Lake is the codename for the upcoming Series 2 Core Ultra mobile processors designed by Intel, set for release on **September 3, 2024**.\n\nNvidia RTX 5000 series is meant to be out by christmas.",
                "comment_author": "Think_Taste9237",
                "comment_score": 2,
                "comment_created_utc": 1723996110.0,
                "comment_created_dt": "2024-08-18 11:48:30"
            },
            {
                "comment_body": "Thank you for the comment guys, I’ll drop an update with your recommendations and might even might or increase my budget a bit.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1724024814.0,
                "comment_created_dt": "2024-08-18 19:46:54"
            },
            {
                "comment_body": "I am also on the fence about Amazon prime big day deal amd black friday",
                "comment_author": "Medical_Bike_3369",
                "comment_score": 1,
                "comment_created_utc": 1727340135.0,
                "comment_created_dt": "2024-09-26 04:42:15"
            },
            {
                "comment_body": "This is some solid advice. MacBook Air (699-799) plus steam deck (350) would be in his budget. \n\n  \nOP: This commenter is onto something for your needs. If you HAVE to have one device just know gaming laptops do have pretty bad battery life for the budget you mentioned. Check [gaminglaptop.deals](http://gaminglaptop.deals) and check the reviews from u/jarrodstech for some more info. (YouTube)",
                "comment_author": "GodOfLeg1on",
                "comment_score": 3,
                "comment_created_utc": 1723995952.0,
                "comment_created_dt": "2024-08-18 11:45:52"
            },
            {
                "comment_body": "140W GAN chargers work great to not have to do this. It charges my Legion Pro 5i just fine even when playing games (most games anyway)",
                "comment_author": "GodOfLeg1on",
                "comment_score": 2,
                "comment_created_utc": 1723995552.0,
                "comment_created_dt": "2024-08-18 11:39:12"
            },
            {
                "comment_body": "That is the dilemma my friend. Currently have a Dell Inspiron something something with a 9th gen i5 H CPu and 3050ti mobile. It’s not bad but the fans can scream…",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1724024410.0,
                "comment_created_dt": "2024-08-18 19:40:10"
            },
            {
                "comment_body": "That’s close by! I wonder if the new series will make a couple hundred bucks drop on current lineups.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1724024639.0,
                "comment_created_dt": "2024-08-18 19:43:59"
            },
            {
                "comment_body": "This one is a good price for what it is...just remember battery life is only going to last you 4-6 hours for browsing and much less for gaming. I would follow u/TechPriestNhyk advice of two devices. Go MacBook Air for all day battery and slim light charger.  \n[HP Victus 15.6 inch FHD IPS 144Hz Gaming Laptop AMD Ryzen 5-8645HS NVIDIA GeForce RTX 4050 8GB DDR5 512GB SSD Mica Silver (2024) - Walmart.com](https://www.walmart.com/ip/HP-Victus-15-6-inch-FHD-144Hz-Gaming-Laptop-AMD-Ryzen-5-8645HS-NVIDIA-GeForce-RTX-4050-8GB-DDR4-512GB-SSD-Mica-Silver-2024/5395277312?nrtv_cid=dx8ewmz44g83c&clickid=XOf2vU2IAxyKTGpwvESgWVwkUkCwsow9LU0FwY0&irgwc=1&sourceid=imp_XOf2vU2IAxyKTGpwvESgWVwkUkCwsow9LU0FwY0&veh=aff&wmlspartner=imp_376373&affiliates_ad_id=565706&campaign_id=9383&sharedid=)",
                "comment_author": "GodOfLeg1on",
                "comment_score": 3,
                "comment_created_utc": 1723996154.0,
                "comment_created_dt": "2024-08-18 11:49:14"
            },
            {
                "comment_body": "Do tell me more about your Legion Pro 5i. It’s on my list…",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1724024444.0,
                "comment_created_dt": "2024-08-18 19:40:44"
            },
            {
                "comment_body": "What would you like to know? It works great (13700HX and RTX 4070) but it will drain your battery quickly if playing games. Even youtube/browsing will only get you 5-6 hours at most.",
                "comment_author": "GodOfLeg1on",
                "comment_score": 1,
                "comment_created_utc": 1724070818.0,
                "comment_created_dt": "2024-08-19 08:33:38"
            }
        ]
    },
    {
        "title": "Should I buy 2024 G14 or wait for 2025 G14?",
        "selftext": "I already have an Omen 15 gaming laptop with some really good specs (R7, 3070, etc.) I'm going to college next year and I need a gaming laptop with a slimmer body and much longer battery life. I have opted for the G14 as a good replacement since I've seen reviews showing how slim the 2024 model is and how good the battery is. The question is should I wait for the 2025 model or get the 3070/32 GB ram version of the 2024 model which is currently $1699 at best buy (although not for much longer; the deal, as of this post, ends approximately in 9:30 hours) ",
        "url": "https://www.reddit.com/r/ZephyrusG14/comments/1fscn7n/should_i_buy_2024_g14_or_wait_for_2025_g14/",
        "score": 5,
        "num_comments": 39,
        "created_utc": 1727638380.0,
        "created_dt": "2024-09-29 15:33:00",
        "author": "Draglox_YT",
        "subreddit": "ZephyrusG14",
        "comments": [
            {
                "comment_body": "At this point you might as well wait for the g14 2026",
                "comment_author": "chaotikz7",
                "comment_score": 28,
                "comment_created_utc": 1727641057.0,
                "comment_created_dt": "2024-09-29 16:17:37"
            },
            {
                "comment_body": "I got my 2021 G14 in 2022 for about $1200, new from Bestbuy. Risking getting downvotes, I'd be honest and say this laptop I got, at least this 2021 model I have, is plagued with issues. Wifi card bugs, easily overheating, and I have three non functioning keys now with normal usage (I don't even game with it). Also battery will degrade fast due to the overheating. However since I only paid $1200 for it, it easily beats almost anything else in terms of specs at the same price. I'd say I get what I pay for and it was a fair price for its value. $1699? I don't know how much inflation there is from 2022, but it seems a bit high.\n\nIt seems you still have one year before you go to college? Probably wouldn't hurt to wait a bit. You will get better deals.",
                "comment_author": "sille_palmfelt",
                "comment_score": 11,
                "comment_created_utc": 1727640486.0,
                "comment_created_dt": "2024-09-29 16:08:06"
            },
            {
                "comment_body": "I’ll wait. New 50 series gpu will get announced at ces and new laptops will likely roll around in may or June. Since you go to college in Sep next year you have plenty of time",
                "comment_author": "Ok_Combination_6881",
                "comment_score": 10,
                "comment_created_utc": 1727641073.0,
                "comment_created_dt": "2024-09-29 16:17:53"
            },
            {
                "comment_body": "wait for black friday. This is your best option",
                "comment_author": "Automatic-Cut-2650",
                "comment_score": 3,
                "comment_created_utc": 1727649930.0,
                "comment_created_dt": "2024-09-29 18:45:30"
            },
            {
                "comment_body": "wait for 2025 and buy 2024 on sale for 11 hundred+-",
                "comment_author": "PensionFond",
                "comment_score": 4,
                "comment_created_utc": 1727639622.0,
                "comment_created_dt": "2024-09-29 15:53:42"
            },
            {
                "comment_body": "wait for 2077 g14",
                "comment_author": "incheon_J",
                "comment_score": 3,
                "comment_created_utc": 1727641688.0,
                "comment_created_dt": "2024-09-29 16:28:08"
            },
            {
                "comment_body": "Since you already have a capable laptop and don't need a smaller one until next year then I think it's worth waiting for what will hopefully be a 12gb vram 5070 in next year's model.",
                "comment_author": "ThreeWholeFrogs",
                "comment_score": 1,
                "comment_created_utc": 1727640997.0,
                "comment_created_dt": "2024-09-29 16:16:37"
            },
            {
                "comment_body": "If you are going to college next September, I would say wait for G14 2025. It would go on sale on Best Buy anyway during July/August with Back to School deals, and if reviews for that aren't that great/ you dont like it, there is a high chance G14 2024 is still being sold at a similar/lower price.\n\nAlso, G14 2024 goes on sale on BB pretty often these days, use this website to track: [https://pricetracker.wtf/](https://pricetracker.wtf/)",
                "comment_author": "Curious_yet_Lazy",
                "comment_score": 1,
                "comment_created_utc": 1727662128.0,
                "comment_created_dt": "2024-09-29 22:08:48"
            },
            {
                "comment_body": "I'd wait, honestly. I got an open box 2023 model before I left for college this September. It's been great so far and from what I've seen the 2024 model is a pretty decent improvement. But if you don't need the laptop till next year, wait until then to see if the 2025 model is worth getting. Because otherwise, you'll be able to get a 2024 model for cheaper than it is right now. And if people trade theirs in for a 2025, you could buy an open box 2024 for a great discount",
                "comment_author": "Subatomic_Spooder",
                "comment_score": 1,
                "comment_created_utc": 1727664302.0,
                "comment_created_dt": "2024-09-29 22:45:02"
            },
            {
                "comment_body": "If you can wait, wait.   \nnot sure when the 2025 will be coming out, but for the past few models, its been:  \nAnnounce in January at CES, Ship around March.  \nsince 2024 is a new design, I'm assuming it'll get carried over to 2025, unless there is some major design flaw.\n\nI got a 2022 well into 2023 model release. It's been a while since I've dealt with a PC so... tempermental and delicate.  \nWith what was available at the time, I still think it was the right decision, but hindsight, I probably should've chosen a different manufacturer.",
                "comment_author": "fractal324",
                "comment_score": 1,
                "comment_created_utc": 1727671689.0,
                "comment_created_dt": "2024-09-30 00:48:09"
            },
            {
                "comment_body": "Next year? Then you should be fine getting the 2025 model as the new laptop GPU should be out by mid 2025 (Q2). If you want to get one now, I suggest getting the 2024 model instead of the 2023 model. The slimness of 2024 model is just so good with only minor performance hit. Plus, OLED laptops are amazing.",
                "comment_author": "MrCoffee0996",
                "comment_score": 1,
                "comment_created_utc": 1727671826.0,
                "comment_created_dt": "2024-09-30 00:50:26"
            },
            {
                "comment_body": "I'd recommend sizing up. I've had a bunch of issues with mine, multiple motherboard replacements and finally a full blown laptop replacement. New unit overheats and shuts off unexpectedly. Unreliable.",
                "comment_author": "foxbot0",
                "comment_score": 1,
                "comment_created_utc": 1727709960.0,
                "comment_created_dt": "2024-09-30 11:26:00"
            },
            {
                "comment_body": "If using it for college, I would wait, hopefully the 2025 model has Strix Halo and is a super boost for productivity instead of just gaming exclusive.",
                "comment_author": "guesdo",
                "comment_score": 1,
                "comment_created_utc": 1727726460.0,
                "comment_created_dt": "2024-09-30 16:01:00"
            },
            {
                "comment_body": "When does the 2025 come out?",
                "comment_author": "LiviNG4them",
                "comment_score": 0,
                "comment_created_utc": 1727640685.0,
                "comment_created_dt": "2024-09-29 16:11:25"
            },
            {
                "comment_body": "I’m waiting for the 2026",
                "comment_author": "Saurobit",
                "comment_score": 0,
                "comment_created_utc": 1727641593.0,
                "comment_created_dt": "2024-09-29 16:26:33"
            },
            {
                "comment_body": "Waiting for g14 foldable",
                "comment_author": "RedX801",
                "comment_score": 0,
                "comment_created_utc": 1727643649.0,
                "comment_created_dt": "2024-09-29 17:00:49"
            },
            {
                "comment_body": "Hate to break it to you but whoever told you the g14 had a good battery needs to be criminally charged. Mine dies in under 2 hours if I’m on Disney plus. Just get a Mac if you can.",
                "comment_author": "Upbeat-Personality43",
                "comment_score": -4,
                "comment_created_utc": 1727644060.0,
                "comment_created_dt": "2024-09-29 17:07:40"
            },
            {
                "comment_body": "Or 2027…",
                "comment_author": "xjrryx",
                "comment_score": 6,
                "comment_created_utc": 1727655586.0,
                "comment_created_dt": "2024-09-29 20:19:46"
            },
            {
                "comment_body": "2050",
                "comment_author": "bstylz01",
                "comment_score": 2,
                "comment_created_utc": 1727664083.0,
                "comment_created_dt": "2024-09-29 22:41:23"
            },
            {
                "comment_body": "I dont get why people wait if you can wait you dont really need it and if you need it cant really wait... price bad... then wait until you just dont need a pc anymore maybe lol (sarcastic obviously)",
                "comment_author": "Distinct-Suspect7610",
                "comment_score": 1,
                "comment_created_utc": 1727748395.0,
                "comment_created_dt": "2024-09-30 22:06:35"
            },
            {
                "comment_body": "OR\n\n  \n2077 🔥🔥🔥🔥",
                "comment_author": "Critical_Flounder_81",
                "comment_score": 1,
                "comment_created_utc": 1727756394.0,
                "comment_created_dt": "2024-10-01 00:19:54"
            },
            {
                "comment_body": "just get MSI GE RIDER next time!!!",
                "comment_author": "Future_Palpitation_3",
                "comment_score": 1,
                "comment_created_utc": 1727658163.0,
                "comment_created_dt": "2024-09-29 21:02:43"
            },
            {
                "comment_body": "I wouldn't recommend this one. The following year Asus will release a revolutionary G14 for 2078, sporting the latest and greatest from AMCEL and Qualidia. Its GPU can render 20k at 500fps, straight to your brain. The graphics are well beyond 2077 from my experience. I'll try it again after fixing my time machine.",
                "comment_author": "NaorobeFranz",
                "comment_score": 7,
                "comment_created_utc": 1727654529.0,
                "comment_created_dt": "2024-09-29 20:02:09"
            },
            {
                "comment_body": "Thanks for the useful resource, I appreciate it. Honestly I might just get either 2025 or 2024 model next year summer",
                "comment_author": "Draglox_YT",
                "comment_score": 1,
                "comment_created_utc": 1727669979.0,
                "comment_created_dt": "2024-09-30 00:19:39"
            },
            {
                "comment_body": "Prob Jan or feb next year like this year’s",
                "comment_author": "RobinZhang140536",
                "comment_score": 1,
                "comment_created_utc": 1727643747.0,
                "comment_created_dt": "2024-09-29 17:02:27"
            },
            {
                "comment_body": "Ghelper, G H E L P E R, GGGHHHHEEELLLPPPPPEEEERRRRR!\n\nSeriously though I was suffering from bad battery life amongst other issues and I was CONTINUOUSLY defending armory crate, but seriously Ghelper is BY FAR and away the best manufacturer made or not command center of ANY brand.",
                "comment_author": "PhillyFlyersNhL",
                "comment_score": 6,
                "comment_created_utc": 1727648566.0,
                "comment_created_dt": "2024-09-29 18:22:46"
            },
            {
                "comment_body": "Interesting, I've seen numerous videos (probably over 10) demonstrating the G14 2024 version having excellent battery",
                "comment_author": "Draglox_YT",
                "comment_score": 1,
                "comment_created_utc": 1727653278.0,
                "comment_created_dt": "2024-09-29 19:41:18"
            },
            {
                "comment_body": "Playing what 500fps 😭",
                "comment_author": "xjrryx",
                "comment_score": 2,
                "comment_created_utc": 1727655644.0,
                "comment_created_dt": "2024-09-29 20:20:44"
            },
            {
                "comment_body": "Hi fellow time traveler I see your just now getting are outdated ancient technology I'd recommend waiting till 2136 as we have are as you call it \"laptops\" inside our brains are frame rate is our optical sensors which you would call your eyes and our resolution is going out of our chambers you would call it a front door but anyways our resolution is going out of our chambers and touching the green mush we float above our technology is so advanced now that our gpus and cpus are the size of 1/4 of a AM4 chip you once used. Good chat I must return to my timeline now adios\n\n(Your comment made me laugh figured I'd join in on the fun lmfao)",
                "comment_author": "IcedWoozy",
                "comment_score": 2,
                "comment_created_utc": 1727664317.0,
                "comment_created_dt": "2024-09-29 22:45:17"
            },
            {
                "comment_body": "That’s what I would assume…BUT, it depends if Asus decides to wait for the new GPU generation which release date is still up in the air.\n\nFingers crossed for Q1!",
                "comment_author": "jipiboily",
                "comment_score": 2,
                "comment_created_utc": 1727648877.0,
                "comment_created_dt": "2024-09-29 18:27:57"
            },
            {
                "comment_body": "I might have to switch to ghelper as well then 😅",
                "comment_author": "Upbeat-Personality43",
                "comment_score": 6,
                "comment_created_utc": 1727649005.0,
                "comment_created_dt": "2024-09-29 18:30:05"
            },
            {
                "comment_body": "My 23 gets like 14-15 for document workloads, 12+ browsing, 10+ VS, and I think around 12 for local video.",
                "comment_author": "NaorobeFranz",
                "comment_score": 1,
                "comment_created_utc": 1727654287.0,
                "comment_created_dt": "2024-09-29 19:58:07"
            },
            {
                "comment_body": "Silly 😋. Though I do hope we have such computers that can backup our memories and consciousness. I want to live on as a robot!",
                "comment_author": "NaorobeFranz",
                "comment_score": 2,
                "comment_created_utc": 1727841333.0,
                "comment_created_dt": "2024-10-01 23:55:33"
            },
            {
                "comment_body": "It probably won’t be price competitive for another year, so I am still gonna buy this year’s g14 when it is on sale",
                "comment_author": "RobinZhang140536",
                "comment_score": 3,
                "comment_created_utc": 1727651216.0,
                "comment_created_dt": "2024-09-29 19:06:56"
            },
            {
                "comment_body": "I was a skeptic until I tried it. I'm not a bandwagoner and I think for myself, so I eventually (3 months after getting g14) installed Ghelper looking for reasons to dislike it and things I'd \"miss\" from armory crate.\n\n\nNot only did Ghelper not lack features, but everything is integrated into the UI absolutely beautifully. \n\n\nHere are just but a few of the features Ghelper allowed me to create not including 8 hours of battery.\n\n\n-Disable DGPU when unplugged and use eco mode forcefully (have not had a single issue with this)\n\n\n-Allow screen to shut off when closing laptop and plugged into external display.\n\n\n-Undervolt CPU and GPU\n\n\n-Set temperature limit for BOTH cpu and gpu.\n\n\nMight be forgetting a few, but these are the stand outs for me.",
                "comment_author": "PhillyFlyersNhL",
                "comment_score": 5,
                "comment_created_utc": 1727662361.0,
                "comment_created_dt": "2024-09-29 22:12:41"
            },
            {
                "comment_body": "Hours I'm guessing right?",
                "comment_author": "Draglox_YT",
                "comment_score": 0,
                "comment_created_utc": 1727655255.0,
                "comment_created_dt": "2024-09-29 20:14:15"
            },
            {
                "comment_body": "Absolutely makes sense. Pragmatic decision :)",
                "comment_author": "jipiboily",
                "comment_score": 2,
                "comment_created_utc": 1727651258.0,
                "comment_created_dt": "2024-09-29 19:07:38"
            },
            {
                "comment_body": "Lol yeah. Longest battery I've seen, aside from my ARM Chromebooks.",
                "comment_author": "NaorobeFranz",
                "comment_score": 1,
                "comment_created_utc": 1727655978.0,
                "comment_created_dt": "2024-09-29 20:26:18"
            },
            {
                "comment_body": "It’s always waiting for better specs or better deal",
                "comment_author": "RobinZhang140536",
                "comment_score": 1,
                "comment_created_utc": 1727651336.0,
                "comment_created_dt": "2024-09-29 19:08:56"
            }
        ]
    },
    {
        "title": "What are some budget gaming laptops to buy in 2024?",
        "selftext": "N/A",
        "url": "https://www.reddit.com/r/AskReddit/comments/1bsfn6v/what_are_some_budget_gaming_laptops_to_buy_in_2024/",
        "score": 2,
        "num_comments": 25,
        "created_utc": 1711905620.0,
        "created_dt": "2024-03-31 13:20:20",
        "author": "igniter-oo7",
        "subreddit": "AskReddit",
        "comments": [
            {
                "comment_body": "For the most part, [1] you should never buy a gaming laptop that's not on sale and [2] the general rule of gaming laptops is \"grab the most GPU you can\".\n\nThe first one you'll want to add another 8gb of RAM on, but has a better CPU than the 2nd. ...and yes, I'm saying a RTX 4050 should be the minimum GPU to aim for in most current situations.:\n\nhttps://www.bestbuy.com/site/lenovo-loq-15-6-gaming-laptop-fhd-amd-ryzen-7-7840hs-with-8gb-memory-nvidia-geforce-rtx-4050-6gb-512gb-ssd-storm-grey/6534465.p?skuId=6534465\n\nhttps://www.bhphotovideo.com/c/product/1749193-REG/acer_an515_58_56ch_15_6_nitro_5_laptop.html",
                "comment_author": "thegreatsquare",
                "comment_score": 3,
                "comment_created_utc": 1711906031.0,
                "comment_created_dt": "2024-03-31 13:27:11"
            },
            {
                "comment_body": "Xbox Series X",
                "comment_author": "Disastrous-Bike659",
                "comment_score": 2,
                "comment_created_utc": 1711905688.0,
                "comment_created_dt": "2024-03-31 13:21:28"
            },
            {
                "comment_body": "depends on what game you want to play. Odds are you are going to pay a lot for something that can run new games. But if you are into old games you can spend $200 on a laptop that will play everything 20 years or older",
                "comment_author": "RandomNameGenFail003",
                "comment_score": 1,
                "comment_created_utc": 1711906166.0,
                "comment_created_dt": "2024-03-31 13:29:26"
            },
            {
                "comment_body": "Microsoft Surface",
                "comment_author": "Hanenbowtie",
                "comment_score": 0,
                "comment_created_utc": 1711905829.0,
                "comment_created_dt": "2024-03-31 13:23:49"
            },
            {
                "comment_body": "4050 is soo expensive for me as I'm a student rn. I'm considering 3050 rtx. Do you think hp victus might do fine for my budget??",
                "comment_author": "igniter-oo7",
                "comment_score": 2,
                "comment_created_utc": 1711906125.0,
                "comment_created_dt": "2024-03-31 13:28:45"
            },
            {
                "comment_body": "Nah i wanna play recent stuffs, a laptop which should be able to play rdr2 on 1440p",
                "comment_author": "igniter-oo7",
                "comment_score": 0,
                "comment_created_utc": 1711906239.0,
                "comment_created_dt": "2024-03-31 13:30:39"
            },
            {
                "comment_body": "Did the word \"budget\" just not register in your head?",
                "comment_author": "praisethecosmicsloth",
                "comment_score": 5,
                "comment_created_utc": 1715341848.0,
                "comment_created_dt": "2024-05-10 07:50:48"
            },
            {
                "comment_body": "Avoid anything HP.  I’m a VAR and Managed Service Provider.  HP everything is a data collection and advertising machine, especially their consumer products.  If you buy a new HP printer, it won’t print until you connect it to the Internet and register it.\n\nThey’re desperately trying to be more despicable than Broadcom, which is a very tall order.",
                "comment_author": "ImpliedSlashS",
                "comment_score": 3,
                "comment_created_utc": 1711906301.0,
                "comment_created_dt": "2024-03-31 13:31:41"
            },
            {
                "comment_body": "https://www.youtube.com/watch?v=k6sWAi176nc\n\nI'm of the belief that spending a little more can be cheaper in the long run if it keeps you from needing to buy a whole new laptop for a couple extra years.\n\n...now if you're OK with the chance of finding some games won't run sooner rather than later, go with the 3050.\n\nNow, if that's the route, try to go with the 3050 6gb. Take the core count of the 3050ti and 2gb more Vram in exchange for lower Vram bandwidth.\n\nhttps://www.youtube.com/watch?v=hKqc7diDdDA",
                "comment_author": "thegreatsquare",
                "comment_score": 1,
                "comment_created_utc": 1711906880.0,
                "comment_created_dt": "2024-03-31 13:41:20"
            },
            {
                "comment_body": "Well it's recommended to get an i7 with 12GB ram with a 1060 Nvidia and 6GB VRam and a 150GB SSD to play that.",
                "comment_author": "RandomNameGenFail003",
                "comment_score": 1,
                "comment_created_utc": 1711906456.0,
                "comment_created_dt": "2024-03-31 13:34:16"
            },
            {
                "comment_body": "An open box 16GB ram Surface Laptop Studio is like $1200 ish and is amazing for games and productivity, is that not \"budget\" compared to like $4000+ gaming laptops that are heavier than the average dog?",
                "comment_author": "Hanenbowtie",
                "comment_score": 3,
                "comment_created_utc": 1715343312.0,
                "comment_created_dt": "2024-05-10 08:15:12"
            },
            {
                "comment_body": "Ight which one would you recommend then? I mean the internet is not secure either way. Every one collects data no matter hp or Lenovo or even apple",
                "comment_author": "igniter-oo7",
                "comment_score": 1,
                "comment_created_utc": 1711906503.0,
                "comment_created_dt": "2024-03-31 13:35:03"
            },
            {
                "comment_body": "Won't i5 12th gen, rtx 3050, 4GB Vram, 512 GB SSD do?",
                "comment_author": "igniter-oo7",
                "comment_score": 0,
                "comment_created_utc": 1711906579.0,
                "comment_created_dt": "2024-03-31 13:36:19"
            },
            {
                "comment_body": "Not sure what your financial situation is, but $1200 is not \"budget\". Nobody expects premium specs when they are looking for budget purchases.",
                "comment_author": "Almightyblob",
                "comment_score": 8,
                "comment_created_utc": 1715511471.0,
                "comment_created_dt": "2024-05-12 06:57:51"
            },
            {
                "comment_body": "I find Dell PCs to be slow, regardless of spec or series; been that way for years.  They are reliable and have decent support, however.  \n\nAsus and Acer have poor support and parts availability.  LG and Samsung have a poor record of reliability and notoriously poor support.  MSI seems to make a good machine, but also poor support.\n\nPretty much leaves Lenovo.",
                "comment_author": "ImpliedSlashS",
                "comment_score": 3,
                "comment_created_utc": 1711906700.0,
                "comment_created_dt": "2024-03-31 13:38:20"
            },
            {
                "comment_body": "The processor will do. The grafisch card has plenty of power but the VRAM inside it will not. I have a GTX 1060 with 6 GB VRAM and it’s hardly enough. The SSD is fine. Bigger rarely a problem. You can even run it from an HDD if you accept loading speeds as a bottleneck. You did not mention RAM only VRAM. \n\nConsidering you are talking about a laptop I would go a bit above what you need. Laptops with the same components as a desktop will never preform to same level. They also have less upgrade possibilities.",
                "comment_author": "Petrus_Rock",
                "comment_score": 1,
                "comment_created_utc": 1711908030.0,
                "comment_created_dt": "2024-03-31 14:00:30"
            },
            {
                "comment_body": "What is a non-premium gaming computer? Either get a non-gaming computer for like $200 ish (HP Stream) or get one with high end specs for gaming that costs much more.",
                "comment_author": "Hanenbowtie",
                "comment_score": 1,
                "comment_created_utc": 1715513241.0,
                "comment_created_dt": "2024-05-12 07:27:21"
            },
            {
                "comment_body": "Alright! Now I'm left with 2 options, Lenovo IdeaPad gaming 3 and HP victus. Which one should I go for",
                "comment_author": "igniter-oo7",
                "comment_score": 1,
                "comment_created_utc": 1711937229.0,
                "comment_created_dt": "2024-03-31 22:07:09"
            },
            {
                "comment_body": "Hp victus or Lenovo IdeaPad gaming 3? Which one is better",
                "comment_author": "igniter-oo7",
                "comment_score": 1,
                "comment_created_utc": 1711937270.0,
                "comment_created_dt": "2024-03-31 22:07:50"
            },
            {
                "comment_body": "Well it's 16GB RAM. I'm trynna buy HP victus, even that's a little over budget for me.",
                "comment_author": "igniter-oo7",
                "comment_score": 0,
                "comment_created_utc": 1711936325.0,
                "comment_created_dt": "2024-03-31 21:52:05"
            },
            {
                "comment_body": "There's plenty of sub 1k gaming laptops like the tried and true Acer Nitro. Usually retails for $600-800 depending on configuration. If you're rich and a bit out of touch just say that.",
                "comment_author": "praisethecosmicsloth",
                "comment_score": 5,
                "comment_created_utc": 1715612602.0,
                "comment_created_dt": "2024-05-13 11:03:22"
            },
            {
                "comment_body": "I have a victus and it’s great",
                "comment_author": "Thiscatisjesus",
                "comment_score": 2,
                "comment_created_utc": 1714613173.0,
                "comment_created_dt": "2024-05-01 21:26:13"
            },
            {
                "comment_body": "In my personal experience, which is anecdotal, Lenovo is hit or miss. I’ve had issues with my current HP laptop too but those were fixable, usually just software being weird. My Lenovo had hardware problems and unlike desktops you can’t just more or less swap any part. I do have great experience with Dell. We have an old Windows Vista Dell that still runs like clockwork. Their desktops I used at work were very solid machines too. From what I see Acer seems to preform great but I haven’t owned one yet. MSI doesn’t make bad stuff but is overhyped. They often work together with HP so I don’t expect higher quality than HP. \n\nTLDR: Lenovo is a risk. HP is good for the price. Dell is solid. Acer seems good. MSI is overhyped. Just my opinion though.",
                "comment_author": "Petrus_Rock",
                "comment_score": 2,
                "comment_created_utc": 1711939947.0,
                "comment_created_dt": "2024-03-31 22:52:27"
            },
            {
                "comment_body": "I wasn't rich in the past when I had no idea gaming computers had budget brands. \"Gaming\" was always synonymous with black with rainbow lights and $4500 **and** a $4500 device you'll only use for one task. \n\nAn all-in-one device is always going to be more cost effective. #surfacefam",
                "comment_author": "Hanenbowtie",
                "comment_score": 1,
                "comment_created_utc": 1715613767.0,
                "comment_created_dt": "2024-05-13 11:22:47"
            },
            {
                "comment_body": "Some people say built quality of MSI is poor. I'm not sure if that's right or not.",
                "comment_author": "igniter-oo7",
                "comment_score": 1,
                "comment_created_utc": 1712122628.0,
                "comment_created_dt": "2024-04-03 01:37:08"
            }
        ]
    },
    {
        "title": "Best 14 inch gaming laptop so far (aug 2024) ?",
        "selftext": "Hi everybody,\n\nI need your help for a difficult choice. As Planet Coaster 2 releases this fall, I need a new laptop to run it smoothly. I'm looking for a 14 inch gaming laptop (I move a lot for work) with a strong CPU power, as most of the game I play (Sim games) are very demanding on the CPU. As far as I know, there are 3 main options available this year : HP Omen Transcend 14, ASUS ROG Zephyrus G14, and Razer Blade 14. Each of them has its pros and cons, and it's very difficult to make a choice.\n\nThe specs I'm looking for are 32G of RAM, a strong CPU and a RTX 4070. Here are the pros and cons of each model as I could understand :\n\n* Razer Blade 14 : very powerful (the most of the 3), runs silent, very good looking and well built. The issue is that it's expensive as hell (3000 euros (or dollars) taxes includes for the configuration above). I'm pretty sure that it's clearly overpriced and I don't know if some of them get their price reduced for black friday. And also the screen is not even OLED (for 3000 bucks, lol).\n* Zephyrus G14 : a lot say it's the best 14 inch gaming laptop. It seems beautiful, powerful, and well-built, with a nice screens. The main issue is that it's not easily available in France, and it's also priced pretty high for the specs above (2700 euros taxes included). I've also heard that it can be very noisy which is a major issue to me, as I use my PC a lot when I travel by train (and I've also read that ASUS' customer service is awful but people are saying that for every brand).\n* HP Omen Transcend 14 : my favorite, looks pretty nice, runs apparently very quiet and cool. Though, it has a low TDP (65 W) which impacts a lot its performance compared to the two others. My main concern is the CPU, that could apparently under-perform considering a TGP that low. It cost 2600 euros with the specs above, but is apparently very often on sales (I could have it for 2100 2 weeks ago). Also a concern for it's reparaibility, we have a notation system for that in France and it's pretty bad (5,6/10).\n\nI spend a lot of time finding which one is the good choice, but I don't understand why the price here in France are that high. I know that in the US, you don't include taxes in the selling price, though all the prices I could read on reddit are far below. I would gladly consider all of your advice and feedback if you have any of these machines.\n\nThank you in advance !",
        "url": "https://www.reddit.com/r/ZephyrusG14/comments/1emb3fv/best_14_inch_gaming_laptop_so_far_aug_2024/",
        "score": 9,
        "num_comments": 30,
        "created_utc": 1723035488.0,
        "created_dt": "2024-08-07 08:58:08",
        "author": "RemsOwer",
        "subreddit": "ZephyrusG14",
        "comments": [
            {
                "comment_body": "The G14 is easily the best out of the 3. The Omen and Blade are missing some key features like having no Gsync on the Blade 14 or Advanced Optimus, so you’d have to reboot every time you want to switch between GPU-only for gaming and Hybrid mode for battery life. Actually, the Omen doesn’t even have a mux switch at all so you’re just stuck with Optimus. Also no USB-C port that connects directly to GPU on the Omen. The only way to get a direct connection to the GPU is through HDMI. The GPU in it also seems to rarely even hit the already-low 60W. \n\nThe G14 also typically gets better battery life than all of them, is lighter weight than all of them, and the display and speakers are WAY better than the Blade 14. Omen also has average/subpar speakers.\n\nAbout the fan noise, you can tune the G14 to run at almost any desired fan noise level. For example, the G14 in its Balanced mode will perform better than the Omen in its Turbo mode and be quieter while doing it. The performance gap between the G14 and the Blade is also pretty small, typically just a few fps. You can easily match what a Blade 14 would score in games with a simple overclock and undervolt. And the fan noise while just doing basic tasks is essentially silent.",
                "comment_author": "ModrnJosh",
                "comment_score": 15,
                "comment_created_utc": 1723039915.0,
                "comment_created_dt": "2024-08-07 10:11:55"
            },
            {
                "comment_body": "If you're going to be doing productivity, the G14 is basically the best 14inch laptop that has came out so far  \n(ignoring new gen stuff)\n\nBut for gaming, the G14 still wins mainly from the price and other advantages it gives",
                "comment_author": "AceLamina",
                "comment_score": 2,
                "comment_created_utc": 1723047599.0,
                "comment_created_dt": "2024-08-07 12:19:59"
            },
            {
                "comment_body": "Go for Lenovo Slim 5 14\". It also has oled and beats all of them in terms of performance, thermal, fan noise except the look",
                "comment_author": "Amazing-Review6032",
                "comment_score": 5,
                "comment_created_utc": 1723051479.0,
                "comment_created_dt": "2024-08-07 13:24:39"
            },
            {
                "comment_body": "Guys for my uses the New Asus Tuff 14 is the best option for 1080 gaming.  180 degree lid critical for me and my triple screen layout as takes up no room when vertical. The others do not have that ( the g14 does not lay flat now!)  It also has 6 ports including power which allows me to hook up ethernet to one of the Usb C ports which again critical in additon to plugging in 2 other screens.  Thirdly reviews say it runs quiet unlike the other options and a bonus military specs and light. For most users this is the best option right now.. I see lenovo legion 14 is either discontinued or another version coming out it also has 6 ports and goes 180 I believe I would consider that if it comes back.  If you must have 4070 go for the Alienware m16r2 as it is small and well built not much larger than a 14 which is my second option for the warranty and more power...  Waiting for prices to come down",
                "comment_author": "GhostofShula",
                "comment_score": 2,
                "comment_created_utc": 1724355166.0,
                "comment_created_dt": "2024-08-22 15:32:46"
            },
            {
                "comment_body": "if you use virtual machine often you might want a bigger ram though",
                "comment_author": "RobinZhang140536",
                "comment_score": 1,
                "comment_created_utc": 1723064182.0,
                "comment_created_dt": "2024-08-07 16:56:22"
            },
            {
                "comment_body": "They are all good laptops. Just get the brand with better service in your country. My ROG Zephyrus has been experiencing several issues after 6 months and just died yesterday. I tried talking to their customer service for warranty but they refused. On a laptop standpoint I think ROG is still the best among the three. I am based in the Philippines and I hope the service center in France is okay.",
                "comment_author": "Brave_Mechanic_8593",
                "comment_score": 1,
                "comment_created_utc": 1723124632.0,
                "comment_created_dt": "2024-08-08 09:43:52"
            },
            {
                "comment_body": "I am in France too, i just got the G14 2024 RTX 4070 From Cashexpress for 1500 EUR, check their website they still have one available for the same price. They have also the Asus ProArt PX13 OLED 13,3\" AMD RYZEN AI 9 HX 370 5,1GHZ 1TO 32GO GEFORCE RTX 4070 for 1600 EUR, its a great laptop with a more powerful cpu than the g14.",
                "comment_author": "Suspicious-Fix-8634",
                "comment_score": 1,
                "comment_created_utc": 1731516438.0,
                "comment_created_dt": "2024-11-13 11:47:18"
            },
            {
                "comment_body": "I love my 2024 G14! I have the 4070 32GB Ram 1TB Storage spec. I love it! Looking to upgrade the storage with another 2TB. You can find my exact spec for $1700 right now:\nhttps://www.bestbuy.com/site/asus-rog-zephyrus-g14-14-oled-3k-120hz-gaming-laptop-amd-ryzen-9-8945hs-32gb-lpddr5x-nvidia-geforce-rtx-4070-1tb-ssd-platinum-white/6570271.p?skuId=6570271",
                "comment_author": "JAEEIGHTY",
                "comment_score": 1,
                "comment_created_utc": 1723036963.0,
                "comment_created_dt": "2024-08-07 09:22:43"
            },
            {
                "comment_body": "Is 16gb enough for a student in cybersecurity who won't game on the laptop.",
                "comment_author": "mothekillox",
                "comment_score": 1,
                "comment_created_utc": 1723043804.0,
                "comment_created_dt": "2024-08-07 11:16:44"
            },
            {
                "comment_body": "Thank you for your answer. I’ve heard that Asus customer service can be really annoying though. And also that 2700 bucks for a 4070 PC is clearly overpriced. Do you agree with that ?",
                "comment_author": "RemsOwer",
                "comment_score": 1,
                "comment_created_utc": 1723048084.0,
                "comment_created_dt": "2024-08-07 12:28:04"
            },
            {
                "comment_body": "I have the G14 and I need to reboot if I want dGPU exclusive. Am I missing something? Also no GSync on Blade and Omen??? It's 2024 ☠️☠️☠️",
                "comment_author": "Lords-Judgement",
                "comment_score": 1,
                "comment_created_utc": 1723063983.0,
                "comment_created_dt": "2024-08-07 16:53:03"
            },
            {
                "comment_body": "Thank you for your answer. The only issue I have is that it’s very pricey.",
                "comment_author": "RemsOwer",
                "comment_score": 1,
                "comment_created_utc": 1723048125.0,
                "comment_created_dt": "2024-08-07 12:28:45"
            },
            {
                "comment_body": "It’s not available in France unfortunatly, that’s I didn’t talk about it",
                "comment_author": "RemsOwer",
                "comment_score": 2,
                "comment_created_utc": 1723061778.0,
                "comment_created_dt": "2024-08-07 16:16:18"
            },
            {
                "comment_body": "Which gen?",
                "comment_author": "HospitalLegal",
                "comment_score": 1,
                "comment_created_utc": 1726896863.0,
                "comment_created_dt": "2024-09-21 01:34:23"
            },
            {
                "comment_body": "He’s in France, and BB won’t ship internationally \n\nAs for OP’s Q - G14 hands down. I had all three of them, returned Razer and Omen; G14 really does it in value factor.",
                "comment_author": "Digital_1337",
                "comment_score": 2,
                "comment_created_utc": 1723088896.0,
                "comment_created_dt": "2024-08-07 23:48:16"
            },
            {
                "comment_body": "Wish I had seen your comment a few weeks ago, now the price is 2k!",
                "comment_author": "chrisabrams",
                "comment_score": 1,
                "comment_created_utc": 1725286023.0,
                "comment_created_dt": "2024-09-02 10:07:03"
            },
            {
                "comment_body": "Why is it so much cheaper in American that everywhere else?",
                "comment_author": "jkarpy-",
                "comment_score": 1,
                "comment_created_utc": 1725505445.0,
                "comment_created_dt": "2024-09-04 23:04:05"
            },
            {
                "comment_body": "I’ve never owned a gaming laptop before and I really want one now. Can it run a lot of games? I play a lot of open world games like MiHoyo games and WuWa stuff like that…",
                "comment_author": "soleilscb",
                "comment_score": 1,
                "comment_created_utc": 1727919947.0,
                "comment_created_dt": "2024-10-02 21:45:47"
            },
            {
                "comment_body": "Easily!",
                "comment_author": "ModrnJosh",
                "comment_score": 1,
                "comment_created_utc": 1723044718.0,
                "comment_created_dt": "2024-08-07 11:31:58"
            },
            {
                "comment_body": "if you ever need to upgrade the ram you can, 8gb is soldered on but you can change the other stick to whatever you need (24, 40).",
                "comment_author": "minimover_",
                "comment_score": -1,
                "comment_created_utc": 1723044711.0,
                "comment_created_dt": "2024-08-07 11:31:51"
            },
            {
                "comment_body": "Yeah they all seem overpriced! But at only 100 more than the Omen and 300 less than the Blade, seems like a decent deal. It’s much cheaper here in the US though. Also, yeah I recommend buying through a third-party or using 3rd party coverage if possible. Asus is definitely taking steps to improve their support, but Razer is just as bad if not worse, and even though I’ve had good experiences with HP, I’ve heard plenty of horror stories about their support as well 🤣",
                "comment_author": "ModrnJosh",
                "comment_score": 1,
                "comment_created_utc": 1723051068.0,
                "comment_created_dt": "2024-08-07 13:17:48"
            },
            {
                "comment_body": "Yeah, no need to reboot! Nvidia Advanced Optimus handles that for you. Make sure you're in GPU Standard mode in Armoury Crate or G-Helper. Then open Nvidia Control Panel and under \"Manage Display Mode\" you can select whether to be in Hybrid or dGPU mode. You can even keep a toggle in your taskbar for it to switch quickly on the fly. Click the \"desktop\" bar at the top of NVCP and select the \"show dynamic display mode tray icon\".",
                "comment_author": "ModrnJosh",
                "comment_score": 3,
                "comment_created_utc": 1723068405.0,
                "comment_created_dt": "2024-08-07 18:06:45"
            },
            {
                "comment_body": "Import Taxes.",
                "comment_author": "Professionaldragon69",
                "comment_score": 1,
                "comment_created_utc": 1726966906.0,
                "comment_created_dt": "2024-09-21 21:01:46"
            },
            {
                "comment_body": "This would easily run Mihoyo games and Wuthering waves. You could play basically everything on the market atm on high, save like black myth wukong or the space marine game which will still run but at lower settings",
                "comment_author": "FlayedAsWell",
                "comment_score": 1,
                "comment_created_utc": 1728461079.0,
                "comment_created_dt": "2024-10-09 04:04:39"
            },
            {
                "comment_body": "Wait is this available in the 2024 g14?",
                "comment_author": "mothekillox",
                "comment_score": 1,
                "comment_created_utc": 1723051461.0,
                "comment_created_dt": "2024-08-07 13:24:21"
            },
            {
                "comment_body": "The thing is that the Omen is very often on sales, I could have it for 2100 euros 2 weeks ago. That’s a 600 euros difference with the G14. I do not know if Asus is doing such sales.",
                "comment_author": "RemsOwer",
                "comment_score": 1,
                "comment_created_utc": 1723062109.0,
                "comment_created_dt": "2024-08-07 16:21:49"
            },
            {
                "comment_body": "How does Optimus play with G helper? Does G helper have control over the GPU or does Optimus? Like if I switch to Eco on G helper does Nividia Control Panel switch off the 4070 GPU for display too?",
                "comment_author": "Lords-Judgement",
                "comment_score": 1,
                "comment_created_utc": 1723069044.0,
                "comment_created_dt": "2024-08-07 18:17:24"
            },
            {
                "comment_body": "2024 model has soldered ram. It cannot be upgraded",
                "comment_author": "ClassyOrb",
                "comment_score": 3,
                "comment_created_utc": 1723053827.0,
                "comment_created_dt": "2024-08-07 14:03:47"
            },
            {
                "comment_body": "Oh, yeah that’s definitely a major difference in price, but there will also be a pretty major difference in performance and features between the two! Basically think of it like going from a 4060 to a 4070 or even a little more than that, plus the extra features like mux, battery, more fan/power tuning options, undervolting, etc. to me that’s still worth it!",
                "comment_author": "ModrnJosh",
                "comment_score": 1,
                "comment_created_utc": 1723063948.0,
                "comment_created_dt": "2024-08-07 16:52:28"
            },
            {
                "comment_body": "I’m pretty sure they work together seamlessly! Like you’ll get a warning message if you try to do anything that you can’t do. So like switching to Eco mode from dGPU mode, it will tell you to switch to Optimus before doing so. At least if I remember correctly, not near my laptop right now to check",
                "comment_author": "ModrnJosh",
                "comment_score": 2,
                "comment_created_utc": 1723406143.0,
                "comment_created_dt": "2024-08-11 15:55:43"
            }
        ]
    },
    {
        "title": "should i buy a mid range gaming laptop this summer or wait for the rtx 5000 series to release next year?",
        "selftext": "i'm planning on buying either the lenovo legion pro 5 or acer predator helios 16 with rtx 4060.  \n\n\ncurrently i am having a acer aspire 3 with i3 10th gen with no dedicated graphics card\n\n&#x200B;\n\ncould use some help for you guys",
        "url": "https://www.reddit.com/r/GamingLaptops/comments/1apprev/should_i_buy_a_mid_range_gaming_laptop_this/",
        "score": 16,
        "num_comments": 28,
        "created_utc": 1707817546.0,
        "created_dt": "2024-02-13 04:45:46",
        "author": "N/A",
        "subreddit": "GamingLaptops",
        "comments": [
            {
                "comment_body": "Buy for what you need today. In tech, if you just wait for the next best thing you may be waiting forever.",
                "comment_author": "JunglistE",
                "comment_score": 46,
                "comment_created_utc": 1707820372.0,
                "comment_created_dt": "2024-02-13 05:32:52"
            },
            {
                "comment_body": "I think you should wait for rtx 60 series in the coming 5 years. \n\nIf serious then buy now, older gaming laptops do not become obselete. I was content with my 1060 gaming laptop which could even do vr. It was powerful enough to run the latest games in medium settings, which, honestly i didnt mind. Having settings on ultra max settings does not mean more fun to me. \n\nI think this question boils down to what kind of person you are and your expectations. I was content of what I got from my 1060 to the point I thought that I could use it even longer. Now i bought 3070 rtx laptop and it is a lot powerful and can run games on max settings on QHD. For me it is a wet dream and boy it even runs cooler than my previous laptop. What a dream. BUT OTHER PEOPLE SAY THAT THEIR RTX 3070 LAPTOP IS NOW TRASH AND CANT RUN GAMES?!? \n\nI think this is a mindset rather the hardware. If you are the person to play games on ultra max settings on the highest possible fps, then sure, you wont ever be content with anything besides desktop pc.",
                "comment_author": "DrMercman",
                "comment_score": 19,
                "comment_created_utc": 1707818559.0,
                "comment_created_dt": "2024-02-13 05:02:39"
            },
            {
                "comment_body": "if you need it now just buy it but if you can wait you might as well wait for a better deal or something newer\n\nbut even then if you do wait that long for the next series next year you may feel less impressed to buy it as there'll be a new generation coming soon after, so just get what you need now",
                "comment_author": "mapletamamo",
                "comment_score": 6,
                "comment_created_utc": 1707818559.0,
                "comment_created_dt": "2024-02-13 05:02:39"
            },
            {
                "comment_body": "You'd have to wait at least a full year, not really worth it imo.\n\nHowever, if you're not in a huge hurry, maybe you can take your time and save a bit more to get something more powerful, with a 4070? Better for longevity",
                "comment_author": "thewildnath2",
                "comment_score": 3,
                "comment_created_utc": 1707825948.0,
                "comment_created_dt": "2024-02-13 07:05:48"
            },
            {
                "comment_body": "Yah wait for another 5 years ![img](emote|t5_2x4m3|8567)  \n\nJoking aside just buy now if you need it lol you won't win anything by waiting",
                "comment_author": "atomanas",
                "comment_score": 2,
                "comment_created_utc": 1707823193.0,
                "comment_created_dt": "2024-02-13 06:19:53"
            },
            {
                "comment_body": "I would just get a new laptop now  \nthe new generation will be more expensive anyways",
                "comment_author": "AceLamina",
                "comment_score": 2,
                "comment_created_utc": 1707824626.0,
                "comment_created_dt": "2024-02-13 06:43:46"
            },
            {
                "comment_body": "ah yes wait for another generation of xx60 cards like whats the point, did you see the improvement of 4060 over 3060 thats right there almost is none theyre just gatekeeping dlss behind every gpu generation and you expect something more from a 5060",
                "comment_author": "kirbash",
                "comment_score": 2,
                "comment_created_utc": 1707828699.0,
                "comment_created_dt": "2024-02-13 07:51:39"
            },
            {
                "comment_body": "Your post has been automatically assigned the **News** flair.\n\nIf this is incorrect, please give your post the [correct flair](/r/GamingLaptops/wiki/flairing).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLaptops) if you have any questions or concerns.*",
                "comment_author": "AutoModerator",
                "comment_score": 0,
                "comment_created_utc": 1707817546.0,
                "comment_created_dt": "2024-02-13 04:45:46"
            },
            {
                "comment_body": "u/djdanger007 i barely can use over 50% in my rtx2050 and gtx1660ti .-. so you know",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707820596.0,
                "comment_created_dt": "2024-02-13 05:36:36"
            },
            {
                "comment_body": "Just go with 5000 series if budget's not gonna be your issue.  \nor if you don't have patience go with 4000 series instead  \nGood Thermals =  acer predator helios 16   \nlegion is quieter +plus the storage on the legion is better = Legion  \n\n\nChoice is yours mate!",
                "comment_author": "AniruddhaPlaysGames",
                "comment_score": 1,
                "comment_created_utc": 1707826833.0,
                "comment_created_dt": "2024-02-13 07:20:33"
            },
            {
                "comment_body": " wait for 5000 series, so you could wait for 6000 series",
                "comment_author": "VariationGlobal4422",
                "comment_score": 1,
                "comment_created_utc": 1707832799.0,
                "comment_created_dt": "2024-02-13 08:59:59"
            },
            {
                "comment_body": "Just get what you need now, or if you don't need it keep the Acer.  If you have good internet there is Geforce Now and Shadow.",
                "comment_author": "Endeavour1988",
                "comment_score": 1,
                "comment_created_utc": 1707834766.0,
                "comment_created_dt": "2024-02-13 09:32:46"
            },
            {
                "comment_body": "It isn't like all possibilities launch on launch day.  If you wanted a new version of a given brand you might have to wait months after 5k launch to even see it and pay a launch day price for it.\nIf you do, then I really hope it is a huge upgrade to whatever 4k you can get on sale and be enjoying now, and was worth the wait.",
                "comment_author": "21sacharm",
                "comment_score": 1,
                "comment_created_utc": 1707842205.0,
                "comment_created_dt": "2024-02-13 11:36:45"
            },
            {
                "comment_body": "If you can afford something now, buy now. Even if 5000 series laptops are announced next year, it'll be a few months before they're widely available, and then some more time yet before they're sanely priced.",
                "comment_author": "Tony_the-Tigger",
                "comment_score": 1,
                "comment_created_utc": 1707844148.0,
                "comment_created_dt": "2024-02-13 12:09:08"
            },
            {
                "comment_body": "Look. The roster for laptop gpu's is trash with rtx 4000. The 4060 is barely faster than the 3060. 4070 is litearlly no faster than the 3070ti. \n\nGiven you're on an aspire 3, any gpu would be a MASSIVE jump in performance for you. Want my advice? Don't go for the 4060. Its not gonna age that well since its not much faster than a 3060. 8gb of vram ain't doing you any favors either. Why spend so much on such a GPU? \n\nI'm assuming you're in the US, right? If so, get a very cheap gaming laptop that can tide you over for a year or so. Sell it off and then buy yourself a proper midrange gaming laptop. Hopefully rtx 5060 will pack more vram and actually bring a proper performance boost. \n\nAnd if rtx 5000 doesn't pan out, hopefully by then you can catch a cheap 4080 laptop. Or something like that.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707857791.0,
                "comment_created_dt": "2024-02-13 15:56:31"
            },
            {
                "comment_body": "Sound advice",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1707833495.0,
                "comment_created_dt": "2024-02-13 09:11:35"
            },
            {
                "comment_body": "i want to do casual gaming at 1080p 60fps+, thats enough for me (no lag just smooth gameplay).  \nthe only thing that concerns me is that whatever i buy should atleast last for more than 6 years",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707819595.0,
                "comment_created_dt": "2024-02-13 05:19:55"
            },
            {
                "comment_body": "i want to do casual gaming at 1080p 60fps+, thats enough for me (no lag just smooth gameplay).\r  \nthe only thing that concerns me is that whatever i buy should atleast last for more than 6 years",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1707819667.0,
                "comment_created_dt": "2024-02-13 05:21:07"
            },
            {
                "comment_body": "RTX 2050 can barely run Tekken 8",
                "comment_author": "newerprofile",
                "comment_score": 2,
                "comment_created_utc": 1707826845.0,
                "comment_created_dt": "2024-02-13 07:20:45"
            },
            {
                "comment_body": "extremely thermals= water cooling laptop lel",
                "comment_author": "N/A",
                "comment_score": 3,
                "comment_created_utc": 1707829033.0,
                "comment_created_dt": "2024-02-13 07:57:13"
            },
            {
                "comment_body": "Rtx 4060 will be just enough for you then to last those 6+ years. However the question is about what laptop you will buy. \n\nDo not ever consider msi gaming laptops as their low and mid range gaming laptops are built from sticks and stones. Hinges will break easier than the twigs. \n\nI suggest either lenovo or asus rog strix. This years asus tufs have different hinge than previous years failing hinges of asus tuf. Acer nitro dunno. I suggest you searching their forums to see what issues most ppl have.  \n\nHonestly plastic doesnt last, but metal do last. My last msi laptop broke apart not in hinge-wise but also the bottom plastic as well, which proved the point that plastic does not last. Thats why i got myself lenovo slim 7 that has all metal body. Lenovo had the least amount issues when i searched reddit for my options\n\nBut plastic can be durable - lenovo thinkpads last for eternity.",
                "comment_author": "DrMercman",
                "comment_score": 2,
                "comment_created_utc": 1707820365.0,
                "comment_created_dt": "2024-02-13 05:32:45"
            },
            {
                "comment_body": "If in 6 years you're still playing the same games you're playing today , then you don't have to worry about anything. Issues only come up when people want hardware to be future proof, which is a fool's errand. But in 6 years, you'll probably have other problems come up, like fans failing, battery needing replacement etc.\n\nLook up benchmarks for the games you want to play today, get the hardware that allows you to play those games at the settings you want.",
                "comment_author": "Cheezdogs",
                "comment_score": 1,
                "comment_created_utc": 1707837174.0,
                "comment_created_dt": "2024-02-13 10:12:54"
            },
            {
                "comment_body": "well the high end 1080 laptops from years ago can still accomplish 1080p 60 pretty easily as long as you know the limits of such thing so even today\n\n id ensure a 4060 or 4070 should be able to do the same thing especially for casual gaming, even you got new technology like upscaling and the like that can help",
                "comment_author": "mapletamamo",
                "comment_score": 1,
                "comment_created_utc": 1707819817.0,
                "comment_created_dt": "2024-02-13 05:23:37"
            },
            {
                "comment_body": "720p low settting .-. reach 60fos",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707828967.0,
                "comment_created_dt": "2024-02-13 07:56:07"
            },
            {
                "comment_body": "2024 XMG Neo 16/17 or other regional equivalents. :)",
                "comment_author": "UnionSlavStanRepublk",
                "comment_score": 1,
                "comment_created_utc": 1707848502.0,
                "comment_created_dt": "2024-02-13 13:21:42"
            },
            {
                "comment_body": "i would like to play the games coming in the future also",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707838325.0,
                "comment_created_dt": "2024-02-13 10:32:05"
            },
            {
                "comment_body": "btw when i buy laptop i dont care much thermal,   \ncause the manufacturer will know when a better fan is needed  \neven thermal throttle, it not throttle performance much .-.",
                "comment_author": "N/A",
                "comment_score": 1,
                "comment_created_utc": 1707887852.0,
                "comment_created_dt": "2024-02-14 00:17:32"
            },
            {
                "comment_body": "Then just be ready for your graphics settings to gradually go lower as it gets older. Although, https://youtu.be/Sv31ftuC0vY?si=qC5URhIikLUhNt4v shows a Legion 5i rtx 2060 still hitting 60fps on High settings in CP2077. The 2060 is a 5 year old card. So maybe 6 years is actually doable.",
                "comment_author": "Cheezdogs",
                "comment_score": 1,
                "comment_created_utc": 1707840098.0,
                "comment_created_dt": "2024-02-13 11:01:38"
            }
        ]
    },
    {
        "title": "Should I buy 2023 model or wait for 2024 model?",
        "selftext": "I start working this month for the first time and planning on buying this laptop after my first two paycheck. I love the looks on the zephyeus series. Still don't know if I want the 14 inch model or 16 inch model. I Honestly wish they would bring back 15 inch models.",
        "url": "https://www.reddit.com/r/ZephyrusG14/comments/18byqhk/should_i_buy_2023_model_or_wait_for_2024_model/",
        "score": 4,
        "num_comments": 15,
        "created_utc": 1701847778.0,
        "created_dt": "2023-12-06 02:29:38",
        "author": "WillingnessScary7057",
        "subreddit": "ZephyrusG14",
        "comments": [
            {
                "comment_body": "Knowing that:\n\n* There aren't going to be any new AMD CPUs\n* There aren't going to be any new Nvidia dGPUs\n* ASUS has historically not fixed any of the core design issues in their laptops (meaning I wouldn't expect them to start now)\n* You'll be far more likely to find a good deal on an \"old\" laptop rather than a brand-new one\n\nI would have no qualms about looking at buying a 2023 model (as long as it came with a Zen 4 CPU, that is)",
                "comment_author": "MaxOfS2D",
                "comment_score": 10,
                "comment_created_utc": 1701850910.0,
                "comment_created_dt": "2023-12-06 03:21:50"
            },
            {
                "comment_body": "depends on how quick you need it.\n\nif history is any indicator, the 2023 models were announced in January at CES, but they didn't start trickling into the market until sometime in Q2(May-iish?)  \nIf you can wait that long, maybe they'll announce something in the 15 inch size you want.  \nPersonally haven't heard NVIDIA or AMD or Intel juicing the news outlets on their upcoming solutions. Will it be iterative or epoch making? who knows.  \n\n\ngood luck",
                "comment_author": "fractal324",
                "comment_score": 6,
                "comment_created_utc": 1701850134.0,
                "comment_created_dt": "2023-12-06 03:08:54"
            },
            {
                "comment_body": "Well the 2023 is on sale and the 2024 will not be on sale for many months after release.",
                "comment_author": "N/A",
                "comment_score": 2,
                "comment_created_utc": 1701867753.0,
                "comment_created_dt": "2023-12-06 08:02:33"
            },
            {
                "comment_body": "No new GPUs next year and the price will be marked up, also the body never changes so I’d do it now",
                "comment_author": "EasyPerformer612",
                "comment_score": 2,
                "comment_created_utc": 1701905365.0,
                "comment_created_dt": "2023-12-06 18:29:25"
            },
            {
                "comment_body": "2022 model is the better version of this laptop going by literally EVERY review online.",
                "comment_author": "RottieMad",
                "comment_score": 1,
                "comment_created_utc": 1701866784.0,
                "comment_created_dt": "2023-12-06 07:46:24"
            },
            {
                "comment_body": "Buy both",
                "comment_author": "N/A",
                "comment_score": -2,
                "comment_created_utc": 1701856131.0,
                "comment_created_dt": "2023-12-06 04:48:51"
            },
            {
                "comment_body": "Is the size of 16 inch that different from old 15 inch one? I thought they just made the bottom bezel smaller in order to fit 16:10 without significantly changing the dimensions.",
                "comment_author": "Wolper321",
                "comment_score": 1,
                "comment_created_utc": 1701850546.0,
                "comment_created_dt": "2023-12-06 03:15:46"
            },
            {
                "comment_body": "Not the advice the board is made for but financially if you start working for the first time in your life I wouldn't spend your whole first paycheck on a laptop",
                "comment_author": "terran1212",
                "comment_score": 1,
                "comment_created_utc": 1701912769.0,
                "comment_created_dt": "2023-12-06 20:32:49"
            },
            {
                "comment_body": "Do they still use LM?",
                "comment_author": "scrattaaa",
                "comment_score": 1,
                "comment_created_utc": 1701966782.0,
                "comment_created_dt": "2023-12-07 11:33:02"
            },
            {
                "comment_body": "If you don't need to use your computer on the go, don't have to carry it hotel-to-hotel  or travel with it, don't move housing frequently, and are not cramped on room space, consider a desktop.\n\nI have used a lot of laptops, 13, 14 & 16in, gaming & non-gaming, Windows & Macs, and in general, 16in are not the right fit for most people. They are not fun to sit with on the couch either. The 16in Macbook Pro is the only really good laptop I have seen and even that I won't recommend to anyone.\n\nIf you go with nVidia 4070 or less, they are all power-limited to 100W and do not benefit at all from the larger chassis of a 16in, and I don't just mean compute performance or FPS, I am also including fan noise and cooling.\n\n&#x200B;\n\nG14 is one of the good laptops. It is the right balance of size, power, fun to use, portability, and battery life (software fiddling required).\n\nIf you don't have a laptop and need one now, or your current system degrades the quality of work and/or fun, you can get one now instead of waiting.\n\nI liked the G14, a rare endorsement from me.\n\nIf you decide to get the G14:\n\nIf you can get the last year's model from BestBuy for 800$, (there was sale like that during Black Friday, if you can still find that), buy that. \n\nIf not, get the 2023 Nvidia 4060 model for 1250$ from BestBuy, then upgrade the RAM & SSD for \\~200$.",
                "comment_author": "iterateandgit",
                "comment_score": 1,
                "comment_created_utc": 1703268140.0,
                "comment_created_dt": "2023-12-22 13:02:20"
            },
            {
                "comment_body": "This. There is no new generation of GPU releasing in 2024, so I doubt ASUS will even make 2024 model gaming laptops.",
                "comment_author": "N/A",
                "comment_score": 6,
                "comment_created_utc": 1701852805.0,
                "comment_created_dt": "2023-12-06 03:53:25"
            },
            {
                "comment_body": "Well, none that any have released or leaked info about.   \nIf I worked at any of those vendors, I wouldn't want to sink last minute Q4 christmas sales by telling the world about \"your new shiny\" shipping next quarter and have people wait for next year.\n\nto me, the G14 2023 seemed like an iterative bump in spec and creature comforts over the 2022(CPU, NVIDIA, USB4,1080camera), especially the 4060 level GPU that was in my budget range. the 4080 and above looked like a significant enough bump in spec, just way more than I'm willing to pay for a PC.\n\nThe 2023 lineup has only been around for 6 months, but the chassis design is a carry over from 2022, which is iterative of 2021. can they pull the same design with some tweaks for more than 3 years? the only companies I know that do that are the remains of VAIO(who can't afford a totally new chassis, they don't have the scale since Sony withdrew) and Porsche(look at 10 consecutive model year 911s and maybe the headlights changed?)\n\nPersonally I'd love to see them shrink the gap in battery life when DGPU is active. igpu 8 hours+ vs dgpu <2hours, but that seems more a GPU issue than an Asus issue",
                "comment_author": "fractal324",
                "comment_score": 2,
                "comment_created_utc": 1701854403.0,
                "comment_created_dt": "2023-12-06 04:20:03"
            },
            {
                "comment_body": "Yeah I'm thinking about buying the asus zephyrus m16 4070 model with the AMD ryzen 9 chip with its price drop.",
                "comment_author": "WillingnessScary7057",
                "comment_score": 1,
                "comment_created_utc": 1701895023.0,
                "comment_created_dt": "2023-12-06 15:37:03"
            },
            {
                "comment_body": "Correct on most. 16:10 is the reason we’re seeing slightly different sizes. 14”, 16” 18”",
                "comment_author": "Dangerous_Choice_664",
                "comment_score": 1,
                "comment_created_utc": 1701868090.0,
                "comment_created_dt": "2023-12-06 08:08:10"
            },
            {
                "comment_body": "I dont really have to pay bills yet. Living in this economy by your self is a big mistake",
                "comment_author": "WillingnessScary7057",
                "comment_score": 1,
                "comment_created_utc": 1701925732.0,
                "comment_created_dt": "2023-12-07 00:08:52"
            }
        ]
    }
]